#pragma once

// PUBG (7.1.6.5) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "PUBG_Basic.hpp"
#include "PUBG_Engine_classes.hpp"
#include "PUBG_TslCommon_classes.hpp"
#include "PUBG_CoreUObject_classes.hpp"
#include "PUBG_UMG_classes.hpp"
#include "PUBG_SlateCore_classes.hpp"
#include "PUBG_InputCore_classes.hpp"
#include "PUBG_AIModule_classes.hpp"
#include "PUBG_CustomizableObject_classes.hpp"
#include "PUBG_Slate_classes.hpp"
#include "PUBG_PhysXVehicles_classes.hpp"
#include "PUBG_OceanPlugin_classes.hpp"
#include "PUBG_CoherentUIGTPlugin_classes.hpp"
#include "PUBG_EngineSettings_classes.hpp"
#include "PUBG_OnlineSubsystemUtils_classes.hpp"
#include "PUBG_AnimGraphRuntime_classes.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum TslGame.EPopupButtonID
enum class EPopupButtonID : uint8_t
{
	Cancel_Or_No                   = 0,
	Yes_Or_OK                      = 1,
	EPopupButtonID_MAX             = 2
};


// Enum TslGame.ESystemMessageType
enum class ESystemMessageType : uint8_t
{
	Debug                          = 0,
	Notify                         = 1,
	Warning                        = 2,
	Error                          = 3,
	Important                      = 4,
	NotifyCommand                  = 5,
	ESystemMessageType_MAX         = 6
};


// Enum TslGame.EOutGamePlatformProvider
enum class EOutGamePlatformProvider : uint8_t
{
	Unknown                        = 0,
	Bro                            = 1,
	PcSteam                        = 2,
	PcDmm                          = 3,
	PcMailRu                       = 4,
	PcKakao                        = 5,
	PcTencent                      = 6,
	ConsoleXbox                    = 7,
	ConsolePsn                     = 8,
	PcLiteGarena                   = 9,
	PcLiteGlobalAccount            = 10,
	Max                            = 11,
	EOutGamePlatformProvider_MAX   = 12
};


// Enum TslGame.EDamageReason
enum class EDamageReason : uint8_t
{
	None                           = 0,
	HeadShot                       = 1,
	TorsoShot                      = 2,
	PelvisShot                     = 3,
	ArmShot                        = 4,
	LegShot                        = 5,
	NonSpecific                    = 6,
	EDamageReason_MAX              = 7
};


// Enum TslGame.EDamageTypeCategory
enum class EDamageTypeCategory : uint8_t
{
	Damage_None                    = 0,
	Damage_Instant                 = 1,
	Damage_Gun                     = 2,
	Damage_Melee                   = 3,
	Damage_Punch                   = 4,
	Damage_ZombiePunch             = 5,
	Damage_Groggy                  = 6,
	Damage_BlueZone                = 7,
	Damage_VehicleHit              = 8,
	Damage_VehicleCrashHit         = 9,
	Damage_Molotov                 = 10,
	Damage_Explosion               = 11,
	Damage_Explosion_Grenade       = 12,
	Damage_Explosion_RedZone       = 13,
	Damage_Explosion_Vehicle       = 14,
	Damage_Instant_Fall            = 15,
	Damage_Drown                   = 16,
	Damage_BleedOut                = 17,
	Damage_Explosion_JerryCan      = 18,
	Damage_ZombieBuff              = 19,
	Damage_CPPWinExit              = 20,
	Damage_MeleeThrow              = 21,
	Damage_Explosion_C4            = 22,
	Damage_Explosion_StickyBomb    = 23,
	Damage_Explosion_Breach        = 24,
	Damage_Explosion_PanzerFaustWarhead = 25,
	Damage_Explosion_PanzerFaustWarheadVehicleArmorPenetration = 26,
	Damage_Explosion_PanzerFaustBackBlast = 27,
	Damage_Explosion_BlackZone     = 28,
	Damage_MAX                     = 29
};


// Enum TslGame.ESkydiveState
enum class ESkydiveState : uint8_t
{
	Skydive_None                   = 0,
	Skydive_Freefall               = 1,
	Skydive_ParachuteDeploying     = 2,
	Skydive_ParachuteDeployed      = 3,
	Skydive_ParachuteCollapsing    = 4,
	Skydive_MAX                    = 5
};


// Enum TslGame.EMarkerType
enum class EMarkerType : uint8_t
{
	Normal                         = 0,
	Attack                         = 1,
	Danger                         = 2,
	Defend                         = 3,
	Loot                           = 4,
	Regroup                        = 5,
	Vehicle                        = 6,
	EMarkerType_MAX                = 7
};


// Enum TslGame.EPlatoonSupportRequestEventType
enum class EPlatoonSupportRequestEventType : uint8_t
{
	Start                          = 0,
	Interactible                   = 1,
	Finish                         = 2,
	EPlatoonSupportRequestEventType_MAX = 3
};


// Enum TslGame.EPlatoonCarePackageType
enum class EPlatoonCarePackageType : uint8_t
{
	NotDesignated                  = 0,
	WeaponPackage                  = 1,
	HealingPackage                 = 2,
	EPlatoonCarePackageType_MAX    = 3
};


// Enum TslGame.EBreathType
enum class EBreathType : uint8_t
{
	Apnea                          = 0,
	ADS                            = 1,
	EBreathType_MAX                = 2
};


// Enum TslGame.ETargetingType
enum class ETargetingType : uint8_t
{
	Targeting_None                 = 0,
	Targeting_Aiming               = 1,
	Targeting_Scoping              = 2,
	Targeting_MAX                  = 3
};


// Enum TslGame.ETslOvercastAction
enum class ETslOvercastAction : uint8_t
{
	Initialized                    = 0,
	Prolonged                      = 1,
	CreateThunder                  = 2,
	ETslOvercastAction_MAX         = 3
};


// Enum TslGame.EServerStatType
enum class EServerStatType : uint8_t
{
	UE                             = 0,
	NET                            = 1,
	EServerStatType_MAX            = 2
};


// Enum TslGame.EQualityType
enum class EQualityType : uint8_t
{
	EMainQuality                   = 0,
	EViewDistanceQuality           = 1,
	EShadowQuality                 = 2,
	EAntiAliasingQuality           = 3,
	ETextureQuality                = 4,
	EVisualEffectQuality           = 5,
	EPostProcessingQuality         = 6,
	EFoliageQuality                = 7,
	EQualityType_MAX               = 8
};


// Enum TslGame.EReadyToPlayState
enum class EReadyToPlayState : uint8_t
{
	AllFinished                    = 0,
	OnPreLoadMap                   = 1,
	OnPostLoadMap                  = 2,
	CheckMapLoadFinished           = 3,
	NotMapFullyLoaded              = 4,
	CheckPreloadingMap             = 5,
	EReadyToPlayState_MAX          = 6
};


// Enum TslGame.EDistanceBasedEvent
enum class EDistanceBasedEvent : uint8_t
{
	Weapon_Gun_Firing              = 0,
	Weapon_Grenade_Bounce          = 1,
	Weapon_Grenade_Explosion       = 2,
	Weapon_Grenade_ExplosionSound  = 3,
	Vehicle_Exhausting             = 4,
	Vehicle_Crash                  = 5,
	Character_FootStep             = 6,
	Character_Landing              = 7,
	MAX                            = 8,
	EDistanceBasedEvent_MAX        = 9
};


// Enum TslGame.EWeaponAttachmentSlotID
enum class EWeaponAttachmentSlotID : uint8_t
{
	None                           = 0,
	Muzzle                         = 1,
	LowerRail                      = 2,
	UpperRail                      = 3,
	Magazine                       = 4,
	Stock                          = 5,
	Angled                         = 6,
	EWeaponAttachmentSlotID_MAX    = 7
};


// Enum TslGame.ERatingRankType
enum class ERatingRankType : uint8_t
{
	None                           = 0,
	Bronze                         = 1,
	Silver                         = 2,
	Gold                           = 3,
	Platinum                       = 4,
	Diamond                        = 5,
	Elite                          = 6,
	Master                         = 7,
	GrandMaster                    = 8,
	ERatingRankType_MAX            = 9
};


// Enum TslGame.EThrownWeaponType
enum class EThrownWeaponType : uint8_t
{
	Thrown_Grenade                 = 0,
	Thrown_Molotov                 = 1,
	Thrown_Melee                   = 2,
	Thrown_Trap                    = 3,
	Thrown_StickyBomb              = 4,
	Thrown_C4                      = 5,
	Thrown_Other                   = 6,
	Thrown_MAX                     = 7
};


// Enum TslGame.EHitDirection
enum class EHitDirection : uint8_t
{
	Hit_Front                      = 0,
	Hit_Back                       = 1,
	Hit_Left                       = 2,
	Hit_Right                      = 3,
	Hit_MAX                        = 4
};


// Enum TslGame.EPowerUpType
enum class EPowerUpType : uint8_t
{
	PowerUp_None                   = 0,
	Powerup_Bandage                = 1,
	PowerUp_FirstAid               = 2,
	Powerup_Medkit                 = 3,
	PowerUp_EnergyDrink            = 4,
	Powerup_Painkillers            = 5,
	PowerUp_Adrenaline             = 6,
	PowerUp_MAX                    = 7,
	EPowerUpType_MAX               = 8
};


// Enum TslGame.ECastAnim
enum class ECastAnim : uint8_t
{
	None                           = 0,
	Bandage                        = 1,
	FirstAid                       = 2,
	Medkit                         = 3,
	EnergyDrink                    = 4,
	Painkiller                     = 5,
	Adrenaline                     = 6,
	Door                           = 7,
	Battery                        = 8,
	ECastAnim_MAX                  = 9
};


// Enum TslGame.ECharacterNegativeEffects
enum class ECharacterNegativeEffects : uint8_t
{
	Blind                          = 0,
	Burning                        = 1,
	Total                          = 2,
	ECharacterNegativeEffects_MAX  = 3
};


// Enum TslGame.EEquipSlotID
enum class EEquipSlotID : uint8_t
{
	Head                           = 0,
	Eyes                           = 1,
	Mask                           = 2,
	Torso                          = 3,
	TorsoArmor                     = 4,
	Outer                          = 5,
	Backpack                       = 6,
	Hands                          = 7,
	Legs                           = 8,
	Feet                           = 9,
	Belt                           = 10,
	WeaponPrimary                  = 11,
	WeaponSecondary                = 12,
	WeaponMelee                    = 13,
	WeaponThrowable                = 14,
	MaxOrNone                      = 15,
	EEquipSlotID_MAX               = 16
};


// Enum TslGame.ESubjectToReport
enum class ESubjectToReport : uint8_t
{
	None                           = 0,
	Killer                         = 1,
	Spectating_Player              = 2,
	Replay_Player                  = 3,
	Team_Member                    = 4,
	OtherTeam_Members              = 5,
	ESubjectToReport_MAX           = 6
};


// Enum TslGame.ESwitcherHideWhen
enum class ESwitcherHideWhen : uint8_t
{
	UsingKeyboardMouse             = 0,
	UsingGamepad                   = 1,
	ESwitcherHideWhen_MAX          = 2
};


// Enum TslGame.EWelcomeState
enum class EWelcomeState : uint8_t
{
	CopyrightAndWarning            = 0,
	PressAKey                      = 1,
	NowLoading                     = 2,
	EWelcomeState_MAX              = 3
};


// Enum TslGame.EPreoccupiedTeamType
enum class EPreoccupiedTeamType : uint8_t
{
	NEUTRAL                        = 0,
	RED                            = 1,
	BLUE                           = 2,
	EPreoccupiedTeamType_MAX       = 3
};


// Enum TslGame.ECaptureState
enum class ECaptureState : uint8_t
{
	ENeutural                      = 0,
	EConfusion                     = 1,
	ECaptured                      = 2,
	ECaptureState_MAX              = 3
};


// Enum TslGame.EPopupStyle
enum class EPopupStyle : uint8_t
{
	Ok_Cancel                      = 0,
	Ok                             = 1,
	Yes_No                         = 2,
	EPopupStyle_MAX                = 3
};


// Enum TslGame.EPartnerLevel
enum class EPartnerLevel : uint8_t
{
	None                           = 0,
	Normal                         = 1,
	Lead                           = 2,
	EPartnerLevel_MAX              = 3
};


// Enum TslGame.EPreviewPlatformIconType
enum class EPreviewPlatformIconType : uint8_t
{
	XboxOne                        = 0,
	PS4                            = 1,
	None                           = 2,
	EPreviewPlatformIconType_MAX   = 3
};


// Enum TslGame.EBlueZoneShape
enum class EBlueZoneShape : uint8_t
{
	None                           = 0,
	Circle                         = 1,
	Rectangle                      = 2,
	CircleOld                      = 3,
	EBlueZoneShape_MAX             = 4
};


// Enum TslGame.ERespawnType
enum class ERespawnType : uint8_t
{
	Airborne                       = 0,
	DeadPoint                      = 1,
	StartPoint                     = 2,
	Selectable                     = 3,
	RandomPoint                    = 4,
	ERespawnType_MAX               = 5
};


// Enum TslGame.EPlatoonTeam
enum class EPlatoonTeam : uint8_t
{
	None                           = 0,
	Blue                           = 1,
	Red                            = 2,
	EPlatoonTeam_MAX               = 3
};


// Enum TslGame.EAutoRecoveryType
enum class EAutoRecoveryType : uint8_t
{
	None                           = 0,
	Human                          = 1,
	Zombie                         = 2,
	HumanAndZombie                 = 3,
	EAutoRecoveryType_MAX          = 4
};


// Enum TslGame.EZombieVirusType
enum class EZombieVirusType : uint8_t
{
	None                           = 0,
	Attacked                       = 1,
	All                            = 2,
	EZombieVirusType_MAX           = 3
};


// Enum TslGame.ERadioMessageInteractionType
enum class ERadioMessageInteractionType : uint8_t
{
	DroppedItem                    = 0,
	Vehicle                        = 1,
	CarepackageOrDeadbox           = 2,
	ERadioMessageInteractionType_MAX = 3
};


// Enum TslGame.ERadioMessageCategory
enum class ERadioMessageCategory : uint8_t
{
	Affirmative                    = 0,
	ThankYou                       = 1,
	NeedMed                        = 2,
	Negative                       = 3,
	Sorry                          = 4,
	NeedAmmo                       = 5,
	EnemySpotted                   = 6,
	ItemSpotted                    = 7,
	Ping                           = 8,
	HelpMe                         = 9,
	WayPoint                       = 10,
	Max                            = 11,
	ERadioMessageCategory_MAX      = 12
};


// Enum TslGame.EEquippedWeaponRTPC
enum class EEquippedWeaponRTPC : uint8_t
{
	None                           = 0,
	HandBomb_Bottle                = 1,
	HandBomb_Metal                 = 2,
	Melee                          = 3,
	Pistol                         = 4,
	SMG                            = 5,
	AR                             = 6,
	SR                             = 7,
	Max                            = 8,
	EEquippedWeaponRTPC_MAX        = 9
};


// Enum TslGame.EForceRefreshDummy
enum class EForceRefreshDummy : uint8_t
{
	Refresh1                       = 0,
	Refresh2                       = 1,
	EForceRefreshDummy_MAX         = 2
};


// Enum TslGame.EViewModeActorCenterPosition
enum class EViewModeActorCenterPosition : uint8_t
{
	None                           = 0,
	Center                         = 1,
	Bottom                         = 2,
	EViewModeActorCenterPosition_MAX = 3
};


// Enum TslGame.EViewModeCategory
enum class EViewModeCategory : uint8_t
{
	None                           = 0,
	Weapon                         = 1,
	Parachute                      = 2,
	Character                      = 3,
	Vehicle                        = 4,
	EViewModeCategory_MAX          = 5
};


// Enum TslGame.ESystemMenuButtonType
enum class ESystemMenuButtonType : uint8_t
{
	RESUME                         = 0,
	SETTINGS                       = 1,
	TEAM_MANAGEMENT                = 2,
	KEY_GUIDE                      = 3,
	RESTART_LOBBY                  = 4,
	LEAVE_MATCH                    = 5,
	EXIT_TO_DESKTOP                = 6,
	GM_COMMAND_INGAME_HELPER       = 7,
	ESystemMenuButtonType_MAX      = 8
};


// Enum TslGame.ERankGuideType
enum class ERankGuideType : uint8_t
{
	ForElementaryRank              = 0,
	ForExpertRank                  = 1,
	ERankGuideType_MAX             = 2
};


// Enum TslGame.EUserRank
enum class EUserRank : uint8_t
{
	ElementaryRank                 = 0,
	IntermediateRank               = 1,
	HighRank                       = 2,
	ExpertRank                     = 3,
	EUserRank_MAX                  = 4
};


// Enum TslGame.EProjectileParticleClass
enum class EProjectileParticleClass : uint8_t
{
	PPC_None                       = 0,
	PPC_Frag                       = 1,
	PPC_Flash                      = 2,
	PPC_Smoke                      = 3,
	PPC_Molotov                    = 4,
	PPC_Other                      = 5,
	PPC_MAX                        = 6
};


// Enum TslGame.EReticleType
enum class EReticleType : uint8_t
{
	RedDot                         = 0,
	HoloSight                      = 1,
	Scope2x                        = 2,
	Scope3x                        = 3,
	Scope4x                        = 4,
	Scope6x                        = 5,
	Scope8x                        = 6,
	EReticleType_MAX               = 7
};


// Enum TslGame.EKeyHintType
enum class EKeyHintType : uint8_t
{
	Menu                           = 0,
	Parachuting                    = 1,
	Character                      = 2,
	Driver                         = 3,
	Rider                          = 4,
	WeaponUse                      = 5,
	WeaponChange                   = 6,
	ADS                            = 7,
	Aim                            = 8,
	ADS_8x15x                      = 9,
	ADS_6x                         = 10,
	ADS_1x2x3x                     = 11,
	ADS_CantedSight                = 12,
	ADS_IronSight                  = 13,
	Throwing                       = 14,
	Heal                           = 15,
	Swimming                       = 16,
	TeamSpectating                 = 17,
	KillerSpectating               = 18,
	WorldMap                       = 19,
	None                           = 20,
	FreefallNew                    = 21,
	ParachuteNew                   = 22,
	SpikeTrap                      = 23,
	MotorGlider                    = 24,
	Other                          = 25,
	EKeyHintType_MAX               = 26
};


// Enum TslGame.EInteractionPlatformType
enum class EInteractionPlatformType : uint8_t
{
	PC_FKey                        = 0,
	Console_X                      = 1,
	Console_B                      = 2,
	Console_XHold                  = 3,
	Console_BHold                  = 4,
	EInteractionPlatformType_MAX   = 5
};


// Enum TslGame.EObserverOutlineType
enum class EObserverOutlineType : uint8_t
{
	SpectatedCharacter             = 0,
	SpectatedCharacterTeam         = 1,
	SpectatedCharacterEnemy        = 2,
	WithoutSpectatedCharacter      = 3,
	WithoutSpectatedTeamCharacter  = 4,
	InteractionFocusingColor       = 5,
	SandboxOutline                 = 6,
	Invincible                     = 7,
	EObserverOutlineType_MAX       = 8
};


// Enum TslGame.EOptionExposeType
enum class EOptionExposeType : uint8_t
{
	All                            = 0,
	PcOnly                         = 1,
	XBoxOnly                       = 2,
	PS4Only                        = 3,
	PcAndXBox                      = 4,
	PcAndPS4                       = 5,
	XBoxAndPS4                     = 6,
	None                           = 7,
	EOptionExposeType_MAX          = 8
};


// Enum TslGame.EWeatherChange
enum class EWeatherChange : uint8_t
{
	NoChange                       = 0,
	Rainy                          = 1,
	Foggy                          = 2,
	EWeatherChange_MAX             = 3
};


// Enum TslGame.EMinimapColorType
enum class EMinimapColorType : uint8_t
{
	DESATURATED                    = 0,
	SATURATED                      = 1,
	EMinimapColorType_MAX          = 2
};


// Enum TslGame.EDamageZoneType
enum class EDamageZoneType : uint8_t
{
	Head                           = 0,
	Torso                          = 1,
	Arm                            = 2,
	Pelvis                         = 3,
	Leg                            = 4,
	EDamageZoneType_MAX            = 5
};


// Enum TslGame.ETslWidgetCreationMethod
enum class ETslWidgetCreationMethod : uint8_t
{
	CreateOnInit                   = 0,
	OnDemand                       = 1,
	OnDemandOnOnlyPC               = 2,
	OnDemandOnOnlyConsole          = 3,
	ETslWidgetCreationMethod_MAX   = 4
};


// Enum TslGame.ERedZoneGenerateType
enum class ERedZoneGenerateType : uint8_t
{
	None                           = 0,
	Uniform_Distribution           = 1,
	Ringtaw                        = 2,
	Outsider                       = 3,
	RingtawOrOutsider              = 4,
	ERedZoneGenerateType_MAX       = 5
};


// Enum TslGame.ETslHudType
enum class ETslHudType : uint8_t
{
	None                           = 0,
	CharacterHud                   = 1,
	SpectatorHud                   = 2,
	ObserverHud                    = 3,
	ReplayHud                      = 4,
	LeagueReplayHud                = 5,
	ETslHudType_MAX                = 6
};


// Enum TslGame.ETargetAnimDynamicsType
enum class ETargetAnimDynamicsType : uint8_t
{
	None                           = 0,
	Hair                           = 1,
	Coat                           = 2,
	ETargetAnimDynamicsType_MAX    = 3
};


// Enum TslGame.EAnimatableCustomizableTypes
enum class EAnimatableCustomizableTypes : uint8_t
{
	Hair                           = 0,
	Outer                          = 1,
	Legs                           = 2,
	Torso                          = 3,
	Head                           = 4,
	Mask                           = 5,
	Backpack                       = 6,
	Eyes                           = 7,
	TorsoArmor                     = 8,
	Hands                          = 9,
	Feet                           = 10,
	Belt                           = 11,
	Face                           = 12,
	EAnimatableCustomizableTypes_MAX = 13
};


// Enum TslGame.EGameEndState
enum class EGameEndState : uint8_t
{
	None                           = 0,
	CereMony                       = 1,
	Cinematic                      = 2,
	MatchFinish                    = 3,
	EGameEndState_MAX              = 4
};


// Enum TslGame.ELobbyBlurChangingStates
enum class ELobbyBlurChangingStates : uint8_t
{
	AlwaysOff                      = 0,
	AlwaysOn                       = 1,
	ELobbyBlurChangingStates_MAX   = 2
};


// Enum TslGame.ELobbyCameraStates
enum class ELobbyCameraStates : uint8_t
{
	XBox_Home                      = 0,
	Main                           = 1,
	Main01                         = 2,
	Menu                           = 3,
	Custom                         = 4,
	Custom01                       = 5,
	EventPass_Milestone            = 6,
	EventPass_Milestone01          = 7,
	EventPass_Missions             = 8,
	ViewMode_Character             = 9,
	ViewMode_Weapon                = 10,
	ViewMode_Parachute             = 11,
	EventPass_Milestone_0_Particle = 12,
	None                           = 13,
	ELobbyCameraStates_MAX         = 14
};


// Enum TslGame.EUiShowType
enum class EUiShowType : uint8_t
{
	AlwaysShow                     = 0,
	TpsOnlyShow                    = 1,
	FpsOnlyShow                    = 2,
	AlwaysHide                     = 3,
	EUiShowType_MAX                = 4
};


// Enum TslGame.ETslXpRewardLogicType
enum class ETslXpRewardLogicType : uint8_t
{
	None                           = 0,
	Public                         = 1,
	ETslXpRewardLogicType_MAX      = 2
};


// Enum TslGame.ETslBpRewardLogicType
enum class ETslBpRewardLogicType : uint8_t
{
	None                           = 0,
	Public                         = 1,
	ScoreBased                     = 2,
	ETslBpRewardLogicType_MAX      = 3
};


// Enum TslGame.EParachuteCutoffState
enum class EParachuteCutoffState : uint8_t
{
	Cutoff_None                    = 0,
	Cutoff_Manual                  = 1,
	Cutoff_Automatic               = 2,
	Cutoff_Ready                   = 3,
	Cutoff_MAX                     = 4
};


// Enum TslGame.EGamepadInputResponseTypes
enum class EGamepadInputResponseTypes : uint8_t
{
	Pressed                        = 0,
	Released                       = 1,
	Tap                            = 2,
	Hold                           = 3,
	DoubleTap                      = 4,
	EGamepadInputResponseTypes_MAX = 5
};


// Enum TslGame.EGamepadInputCombinationTypes
enum class EGamepadInputCombinationTypes : uint8_t
{
	Plus                           = 0,
	Slash                          = 1,
	EGamepadInputCombinationTypes_MAX = 2
};


// Enum TslGame.ERadioMessagePresets
enum class ERadioMessagePresets : uint8_t
{
	Preset1                        = 0,
	Preset2                        = 1,
	ERadioMessagePresets_MAX       = 2
};


// Enum TslGame.EGamepadPresets
enum class EGamepadPresets : uint8_t
{
	ControllerTypeA                = 0,
	ControllerTypeB                = 1,
	ControllerTypeC                = 2,
	Max                            = 3,
	EGamepadPresets_MAX            = 4
};


// Enum TslGame.EKeyGuideShowCases
enum class EKeyGuideShowCases : uint8_t
{
	Reload                         = 0,
	ExitVehicle                    = 1,
	EKeyGuideShowCases_MAX         = 2
};


// Enum TslGame.ETslInputModes
enum class ETslInputModes : uint8_t
{
	Toggle                         = 0,
	Hold                           = 1,
	DoubleTap                      = 2,
	ETslInputModes_MAX             = 3
};


// Enum TslGame.EGameplayClientReplay
enum class EGameplayClientReplay : uint8_t
{
	Replay                         = 0,
	Killcam                        = 1,
	KeyGuide                       = 2,
	EGameplayClientReplay_MAX      = 3
};


// Enum TslGame.EGameplayFunctionalities
enum class EGameplayFunctionalities : uint8_t
{
	FreeLookInterp                 = 0,
	EGameplayFunctionalities_MAX   = 1
};


// Enum TslGame.EInputModeSettingActions
enum class EInputModeSettingActions : uint8_t
{
	Crouch                         = 0,
	Prone                          = 1,
	Walk                           = 2,
	Sprint                         = 3,
	HoldRotation                   = 4,
	HoldBreath                     = 5,
	Peek                           = 6,
	Map                            = 7,
	ADS                            = 8,
	Aim                            = 9,
	HoldAngled                     = 10,
	EInputModeSettingActions_MAX   = 11
};


// Enum TslGame.EKeyBindingSlot
enum class EKeyBindingSlot : uint8_t
{
	FirstKey                       = 0,
	SecondKey                      = 1,
	EKeyBindingSlot_MAX            = 2
};


// Enum TslGame.EReportDetailCauseType
enum class EReportDetailCauseType : uint8_t
{
	AutoAim                        = 0,
	NoRecoil                       = 1,
	EspOrPenetration               = 2,
	Speedhack                      = 3,
	EReportDetailCauseType_MAX     = 4
};


// Enum TslGame.EReportedSessionType
enum class EReportedSessionType : uint8_t
{
	PublicOrCustomGame             = 0,
	Killcam                        = 1,
	Replay                         = 2,
	EReportedSessionType_MAX       = 3
};


// Enum TslGame.EReportCause
enum class EReportCause : uint8_t
{
	Default                        = 0,
	Cheat                          = 1,
	TeamKill                       = 2,
	Teaming                        = 3,
	InappropriateID                = 4,
	VerbalHarassment               = 5,
	Griefing                       = 6,
	EReportCause_MAX               = 7
};


// Enum TslGame.ItemPackageType
enum class EItemPackageType : uint8_t
{
	RootBox                        = 0,
	CarePackage                    = 1,
	DroppedPackage                 = 2,
	DroppedEventPackage            = 3,
	ItemPackageType_MAX            = 4
};


// Enum TslGame.ECarePackageIconType
enum class ECarePackageIconType : uint8_t
{
	Normal                         = 0,
	Flying                         = 1,
	Opened                         = 2,
	ECarePackageIconType_MAX       = 3
};


// Enum TslGame.ECharacterIconType
enum class ECharacterIconType : uint8_t
{
	Normal                         = 0,
	Vehicle                        = 1,
	Parachute                      = 2,
	Die                            = 3,
	Groggy                         = 4,
	Quitter                        = 5,
	Observer                       = 6,
	Aircraft                       = 7,
	ECharacterIconType_MAX         = 8
};


// Enum TslGame.EReportUiType
enum class EReportUiType : uint8_t
{
	Normal                         = 0,
	Respawn                        = 1,
	EReportUiType_MAX              = 2
};


// Enum TslGame.EZombieRuleType
enum class EZombieRuleType : uint8_t
{
	None                           = 0,
	BattleRoyale                   = 1,
	Survival                       = 2,
	Elimination                    = 3,
	EZombieRuleType_MAX            = 4
};


// Enum TslGame.EZombieModePlayerState
enum class EZombieModePlayerState : uint8_t
{
	None                           = 0,
	Human                          = 1,
	ReadyToRevive                  = 2,
	Zombie                         = 3,
	EZombieModePlayerState_MAX     = 4
};


// Enum TslGame.ETeamChangeZombieMode
enum class ETeamChangeZombieMode : uint8_t
{
	None                           = 0,
	LeaveTeam                      = 1,
	JoinTeam                       = 2,
	ETeamChangeZombieMode_MAX      = 3
};


// Enum TslGame.EFollowCameraMode
enum class EFollowCameraMode : uint8_t
{
	CharacterCamera                = 0,
	VehicleCamera                  = 1,
	AircraftCamera                 = 2,
	ParachutingCamera              = 3,
	FallingWithParachuteCamera     = 4,
	EFollowCameraMode_MAX          = 5
};


// Enum TslGame.EObserverCameraMode
enum class EObserverCameraMode : uint8_t
{
	FixedCamera                    = 0,
	FreeCamera                     = 1,
	PlayerCamera                   = 2,
	FollowCamera                   = 3,
	EObserverCameraMode_MAX        = 4
};


// Enum TslGame.EObserverAuthorityType
enum class EObserverAuthorityType : uint8_t
{
	None                           = 0,
	FromBeginning                  = 1,
	AfterDeath                     = 2,
	AfterExtermination             = 3,
	EagleEye                       = 4,
	EObserverAuthorityType_MAX     = 5
};


// Enum TslGame.EGameModeType
enum class EGameModeType : uint8_t
{
	BattleRoyale                   = 0,
	War                            = 1,
	TDM                            = 2,
	Zombie                         = 3,
	Conquest                       = 4,
	Training                       = 5,
	ESports                        = 6,
	None                           = 7,
	EGameModeType_MAX              = 8
};


// Enum TslGame.EValueType
enum class EValueType : uint8_t
{
	Float                          = 0,
	Int                            = 1,
	String                         = 2,
	Bool                           = 3,
	EValueType_MAX                 = 4
};


// Enum TslGame.EPlatoonSupportRequestType
enum class EPlatoonSupportRequestType : uint8_t
{
	NoRequest                      = 0,
	FireSupportRequest             = 1,
	WeaponPackageRequest           = 2,
	HealingPackageRequest          = 3,
	EPlatoonSupportRequestType_MAX = 4
};


// Enum TslGame.ETeamVehicleType
enum class ETeamVehicleType : uint8_t
{
	Team_None                      = 0,
	Team_Vehicle                   = 1,
	Team_MAX                       = 2
};


// Enum TslGame.ENearClippingLevel
enum class ENearClippingLevel : uint8_t
{
	Default                        = 0,
	Low                            = 1,
	Middle                         = 2,
	High                           = 3,
	ENearClippingLevel_MAX         = 4
};


// Enum TslGame.EThingSpotGroupType
enum class EThingSpotGroupType : uint8_t
{
	GroupA                         = 0,
	GroupB                         = 1,
	GroupC                         = 2,
	GroupD                         = 3,
	GroupE                         = 4,
	GroupF                         = 5,
	GroupG                         = 6,
	GroupH                         = 7,
	GroupI                         = 8,
	GroupJ                         = 9,
	GroupK                         = 10,
	GroupL                         = 11,
	GroupM                         = 12,
	GroupN                         = 13,
	EThingSpotGroupType_MAX        = 14
};


// Enum TslGame.EPhysMaterialType
enum class EPhysMaterialType : uint8_t
{
	Unknown                        = 0,
	Asphalt                        = 1,
	Dirt                           = 2,
	Water                          = 3,
	Wood                           = 4,
	Stone                          = 5,
	Metal                          = 6,
	EPhysMaterialType_MAX          = 7
};


// Enum TslGame.EEquipableItemSoundType
enum class EEquipableItemSoundType : uint8_t
{
	None                           = 0,
	Vest                           = 1,
	LongCoat                       = 2,
	HipSack                        = 3,
	Cloth                          = 4,
	BackPack                       = 5,
	MilitaryShoes                  = 6,
	Sneakers                       = 7,
	EEquipableItemSoundType_MAX    = 8
};


// Enum TslGame.EEquipableItemSoundGroup
enum class EEquipableItemSoundGroup : uint8_t
{
	Default                        = 0,
	Shoes                          = 1,
	EEquipableItemSoundGroup_MAX   = 2
};


// Enum TslGame.EColorBlindType
enum class EColorBlindType : uint8_t
{
	Normal                         = 0,
	Deuteranopia                   = 1,
	Protanopia                     = 2,
	Tritanopia                     = 3,
	EColorBlindType_MAX            = 4
};


// Enum TslGame.EFrameRateLimitType
enum class EFrameRateLimitType : uint8_t
{
	Unlimited                      = 0,
	Fixed                          = 1,
	Fixed01                        = 2,
	Customizable                   = 3,
	DisplayBased                   = 4,
	EFrameRateLimitType_MAX        = 5
};


// Enum TslGame.ETslOutGameCloudRequestErrorType
enum class ETslOutGameCloudRequestErrorType : uint8_t
{
	Unknown                        = 0,
	InternalError                  = 1,
	ServerError                    = 2,
	RequestTimedOut                = 3,
	DataCorrupted                  = 4,
	CompressionFailed              = 5,
	DecompressionFailed            = 6,
	ETslOutGameCloudRequestErrorType_MAX = 7
};


// Enum TslGame.ETslOutGameCloudRequestType
enum class ETslOutGameCloudRequestType : uint8_t
{
	Invalid                        = 0,
	SaveToCloud                    = 1,
	LoadFromCloud                  = 2,
	ETslOutGameCloudRequestType_MAX = 3
};


// Enum TslGame.ETslPhysMaterialType
enum class ETslPhysMaterialType : uint8_t
{
	Unknown                        = 0,
	Concrete                       = 1,
	Dirt                           = 2,
	Water                          = 3,
	Metal                          = 4,
	Wood                           = 5,
	Grass                          = 6,
	Glass                          = 7,
	Flesh                          = 8,
	ETslPhysMaterialType_MAX       = 9
};


// Enum TslGame.ETppAimCameraPosition
enum class ETppAimCameraPosition : uint8_t
{
	LatestAimPosition              = 0,
	LastPeekingPosition            = 1,
	ResetToRightShoulderPosition   = 2,
	ResetToLeftShoulderPosition    = 3,
	ETppAimCameraPosition_MAX      = 4
};


// Enum TslGame.EAccessorySlot
enum class EAccessorySlot : uint8_t
{
	Slot_Primary                   = 0,
	Slot_Secondary                 = 1,
	Slot_SideArm                   = 2,
	Slot_Melee                     = 3,
	Slot_Thrown                    = 4,
	Slot_None                      = 5,
	Slot_MAX                       = 6
};


// Enum TslGame.ELobbyCharacterCameraType
enum class ELobbyCharacterCameraType : uint8_t
{
	None                           = 0,
	WholeBodyCamera                = 1,
	TopCamera                      = 2,
	HeadCamera                     = 3,
	BodyCamera                     = 4,
	LegCamera                      = 5,
	FootCamera                     = 6,
	Max                            = 7,
	ELobbyCharacterCameraType_MAX  = 8
};


// Enum TslGame.EContinuousHealItem
enum class EContinuousHealItem : uint8_t
{
	Continuous_On                  = 0,
	Bandaged_Only                  = 1,
	Continuous_Off                 = 2,
	EContinuousHealItem_MAX        = 3
};


// Enum TslGame.EWeaponClass
enum class EWeaponClass : uint8_t
{
	Class_None                     = 0,
	Class_Pistol                   = 1,
	Class_SMG                      = 2,
	Class_Rifle                    = 3,
	Class_Carbine                  = 4,
	Class_Shotgun                  = 5,
	Class_Sniper                   = 6,
	Class_DMR                      = 7,
	Class_LMG                      = 8,
	Class_Melee                    = 9,
	Class_Throwable                = 10,
	Class_Shield                   = 11,
	Class_Crossbow                 = 12,
	Class_Launcher                 = 13,
	EWeaponClass_MAX               = 14
};


// Enum TslGame.EAllowedThrowMode
enum class EAllowedThrowMode : uint8_t
{
	Any                            = 0,
	ThrowHigh                      = 1,
	ThrowLow                       = 2,
	EAllowedThrowMode_MAX          = 3
};


// Enum TslGame.ECharThrowMode
enum class ECharThrowMode : uint8_t
{
	ThrowHigh                      = 0,
	ThrowLow                       = 1,
	ECharThrowMode_MAX             = 2
};


// Enum TslGame.EAttachmentCalculateType
enum class EAttachmentCalculateType : uint8_t
{
	Addition                       = 0,
	Multiply                       = 1,
	EAttachmentCalculateType_MAX   = 2
};


// Enum TslGame.EAutoEquipAttachmentForScopeMode
enum class EAutoEquipAttachmentForScopeMode : uint8_t
{
	Off                            = 0,
	Sight_Only                     = 1,
	ALL                            = 2,
	EAutoEquipAttachmentForScopeMode_MAX = 3
};


// Enum TslGame.EItemCategory
enum class EItemCategory : uint8_t
{
	None                           = 0,
	Equipment                      = 1,
	Weapon                         = 2,
	Attachment                     = 3,
	Ammunition                     = 4,
	Use                            = 5,
	Skin                           = 6,
	Event                          = 7,
	EItemCategory_MAX              = 8
};


// Enum TslGame.EFiringMode
enum class EFiringMode : uint8_t
{
	Normal                         = 0,
	Burst                          = 1,
	FullAuto                       = 2,
	EFiringMode_MAX                = 3
};


// Enum TslGame.EWeaponHand
enum class EWeaponHand : uint8_t
{
	Left                           = 0,
	Right                          = 1,
	Total                          = 2,
	EWeaponHand_MAX                = 3
};


// Enum TslGame.EWeaponArmState
enum class EWeaponArmState : uint8_t
{
	None                           = 0,
	NotArmed                       = 1,
	Arming                         = 2,
	Armed                          = 3,
	UnArming                       = 4,
	EWeaponArmState_MAX            = 5
};


// Enum TslGame.EOutGameMontageState
enum class EOutGameMontageState : uint8_t
{
	Default                        = 0,
	Playing                        = 1,
	Interrupted                    = 2,
	Finished                       = 3,
	EOutGameMontageState_MAX       = 4
};


// Enum TslGame.EItemRequestType
enum class EItemRequestType : uint8_t
{
	None                           = 0,
	Heal                           = 1,
	Ammo                           = 2,
	EItemRequestType_MAX           = 3
};


// Enum TslGame.JukeBoxAnimState
enum class EJukeBoxAnimState : uint8_t
{
	OPEN                           = 0,
	CLOSED                         = 1,
	JukeBoxAnimState_MAX           = 2
};


// Enum TslGame.ELivingThingThreatLevel
enum class ELivingThingThreatLevel : uint8_t
{
	NoChanged                      = 0,
	IncrementThreatLevel           = 1,
	DecrementThreatLevel           = 2,
	Calm                           = 3,
	Fear                           = 4,
	Panic                          = 5,
	Dead                           = 6,
	MAX                            = 7,
	ELivingThingThreatLevel_MAX    = 8
};


// Enum TslGame.ELivingThingCustomEvent
enum class ELivingThingCustomEvent : uint8_t
{
	DeadByBullet                   = 0,
	DeadByExplosion                = 1,
	HittedByCar                    = 2,
	Custom1                        = 3,
	Custom2                        = 4,
	Custom3                        = 5,
	Custom4                        = 6,
	Custom5                        = 7,
	Custom6                        = 8,
	Custom7                        = 9,
	Custom8                        = 10,
	Custom9                        = 11,
	Custom10                       = 12,
	Custom11                       = 13,
	Custom12                       = 14,
	Custom13                       = 15,
	Custom14                       = 16,
	Custom15                       = 17,
	Custom16                       = 18,
	Custom17                       = 19,
	Custom18                       = 20,
	Custom19                       = 21,
	Custom20                       = 22,
	MAX                            = 23,
	ELivingThingCustomEvent_MAX    = 24
};


// Enum TslGame.ELobbyCharacterPosition
enum class ELobbyCharacterPosition : uint8_t
{
	Position1                      = 0,
	Position2                      = 1,
	Position3                      = 2,
	Position4                      = 3,
	ELobbyCharacterPosition_MAX    = 4
};


// Enum TslGame.ELobbyCharacterReadyType
enum class ELobbyCharacterReadyType : uint8_t
{
	Ready                          = 0,
	NotReady                       = 1,
	ReadyToNotReady                = 2,
	NotReadyToReady                = 3,
	ELobbyCharacterReadyType_MAX   = 4
};


// Enum TslGame.EObserverHudAnimType
enum class EObserverHudAnimType : uint8_t
{
	TeamWipeOutAnim                = 0,
	PersonalKillingSpreeAnim       = 1,
	TeamTotalKillingSpreeAnim      = 2,
	EObserverHudAnimType_MAX       = 3
};


// Enum TslGame.EObserverPlayerListType
enum class EObserverPlayerListType : uint8_t
{
	Distance                       = 0,
	Kill                           = 1,
	Survivor                       = 2,
	Score                          = 3,
	Max                            = 4,
	EObserverPlayerListType_MAX    = 5
};


// Enum TslGame.ETslParticleCullType
enum class ETslParticleCullType : uint8_t
{
	None                           = 0,
	Distance                       = 1,
	Frustum                        = 2,
	LastRenderedTime               = 3,
	SameTransform                  = 4,
	NearbyTransform                = 5,
	DistAndFrustumAndNear          = 6,
	All                            = 7,
	ETslParticleCullType_MAX       = 8
};


// Enum TslGame.ETslParticleGroupPriority
enum class ETslParticleGroupPriority : uint8_t
{
	High                           = 0,
	Low                            = 1,
	ETslParticleGroupPriority_MAX  = 2
};


// Enum TslGame.ECustomDamageZoneType
enum class ECustomDamageZoneType : uint8_t
{
	Head                           = 0,
	UpperBody                      = 1,
	LowerBody                      = 2,
	Arms                           = 3,
	Legs                           = 4,
	ECustomDamageZoneType_MAX      = 5
};


// Enum TslGame.ECustomDamageWeaponClass
enum class ECustomDamageWeaponClass : uint8_t
{
	Bullet                         = 0,
	Melee                          = 1,
	ECustomDamageWeaponClass_MAX   = 2
};


// Enum TslGame.EMolotovSimulationType
enum class EMolotovSimulationType : uint8_t
{
	Molotov_SimulationImpact       = 0,
	Molotov_SimulationProjectile   = 1,
	Molotov_SimulationFragment     = 2,
	Molotov_SimulationVolumetric   = 3,
	Molotov_MAX                    = 4
};


// Enum TslGame.ESpikeDeploymentState
enum class ESpikeDeploymentState : uint8_t
{
	PreDeploy                      = 0,
	Deploying                      = 1,
	PostDeploy                     = 2,
	Popped                         = 3,
	Idle                           = 4,
	ESpikeDeploymentState_MAX      = 5
};


// Enum TslGame.EWarheadExplodedState
enum class EWarheadExplodedState : uint8_t
{
	NotExploded                    = 0,
	Exploded                       = 1,
	EWarheadExplodedState_MAX      = 2
};


// Enum TslGame.ETslReferenceObjType
enum class ETslReferenceObjType : uint8_t
{
	GameMode                       = 0,
	Character                      = 1,
	Preload                        = 2,
	ETslReferenceObjType_MAX       = 3
};


// Enum TslGame.EParachuteLandingSurfaceType
enum class EParachuteLandingSurfaceType : uint8_t
{
	Surface_None                   = 0,
	Surface_Vertical               = 1,
	Surface_Horizontal             = 2,
	Surface_MAX                    = 3
};


// Enum TslGame.EReplayTimelineMode
enum class EReplayTimelineMode : uint8_t
{
	ReplayPlay                     = 0,
	ReplayEditor                   = 1,
	ReplayRender                   = 2,
	EReplayTimelineMode_MAX        = 3
};


// Enum TslGame.ETrainHeadingDir
enum class ETrainHeadingDir : uint8_t
{
	XPositive                      = 0,
	XNegative                      = 1,
	YPositive                      = 2,
	YNegative                      = 3,
	ETrainHeadingDir_MAX           = 4
};


// Enum TslGame.EConditionOfDeath
enum class EConditionOfDeath : uint8_t
{
	HeatShot                       = 0,
	DBNO                           = 1,
	DBNOByHeadShot                 = 2,
	None                           = 3,
	EConditionOfDeath_MAX          = 4
};


// Enum TslGame.ETslWheelWidgetMouseCursorDirectionType
enum class ETslWheelWidgetMouseCursorDirectionType : uint8_t
{
	ABSOLUTE_COORD                 = 0,
	AREA_RESTRICTED_COORD          = 1,
	CIRCULAR_RESTRICTED_COORD      = 2,
	ETslWheelWidgetMouseCursorDirectionType_MAX = 3
};


// Enum TslGame.ETslWheelWidgetSelectType
enum class ETslWheelWidgetSelectType : uint8_t
{
	BY_CLICK                       = 0,
	BY_RELEASE                     = 1,
	BY_MAX                         = 2
};


// Enum TslGame.EBluezoneState
enum class EBluezoneState : uint8_t
{
	None                           = 0,
	Wait                           = 1,
	Release                        = 2,
	EBluezoneState_MAX             = 3
};


// Enum TslGame.EMinimapFocus
enum class EMinimapFocus : uint8_t
{
	CharacterFocus                 = 0,
	NextPlayzoneFocus              = 1,
	None                           = 2,
	EMinimapFocus_MAX              = 3
};


// Enum TslGame.EDisplayPlayerInfoType
enum class EDisplayPlayerInfoType : uint8_t
{
	PlayerList                     = 0,
	EngagedEnemies                 = 1,
	NearbyPlayers                  = 2,
	OtherEngagements               = 3,
	ObserverTeamInfoList           = 4,
	EDisplayPlayerInfoType_MAX     = 5
};


// Enum TslGame.EMarkStates
enum class EMarkStates : uint8_t
{
	Normal                         = 0,
	Groggy                         = 1,
	Dead                           = 2,
	Vehicle                        = 3,
	Parachute                      = 4,
	Quitter                        = 5,
	Aircraft                       = 6,
	ItemRequest                    = 7,
	EMarkStates_MAX                = 8
};


// Enum TslGame.EBinaryStepperType
enum class EBinaryStepperType : uint8_t
{
	OFF                            = 0,
	ON                             = 1,
	EBinaryStepperType_MAX         = 2
};


// Enum TslGame.EGuideKeyType
enum class EGuideKeyType : uint8_t
{
	None                           = 0,
	PickUp                         = 1,
	PickUpAndEquip                 = 2,
	PickUpAndPickUpAmount          = 3,
	Unequip                        = 4,
	DetachAll                      = 5,
	DetachAndDetachAll             = 6,
	Drop                           = 7,
	DropAndEquip                   = 8,
	DropAndDropAmount              = 9,
	DropAndDropAll                 = 10,
	Equip                          = 11,
	EquipAndQuickEquip             = 12,
	XQuickEquip                    = 13,
	XHoldQuickEquip                = 14,
	Swap                           = 15,
	Use                            = 16,
	Confirm                        = 17,
	Cancel                         = 18,
	SwitchSlot                     = 19,
	Charm                          = 20,
	CharmAndDetachAll              = 21,
	EGuideKeyType_MAX              = 22
};


// Enum TslGame.EGuideLineType
enum class EGuideLineType : uint8_t
{
	Switch                         = 0,
	Upper                          = 1,
	Lower                          = 2,
	EGuideLineType_MAX             = 3
};


// Enum TslGame.EFlashbangDebuffCurveValueTypes
enum class EFlashbangDebuffCurveValueTypes : uint8_t
{
	Blindness_Duration_Direct      = 0,
	Blindness_Duration_Indirect    = 1,
	Tinnitus_Level                 = 2,
	EFlashbangDebuffCurveValueTypes_MAX = 3
};


// Enum TslGame.ETracerDisplayMode
enum class ETracerDisplayMode : uint8_t
{
	TracerDM_None                  = 0,
	TracerDM_Particle              = 1,
	TracerDM_Mesh                  = 2,
	TracerDM_Billboard             = 3,
	TracerDM_MAX                   = 4
};


// Enum TslGame.ELoadingScreenType
enum class ELoadingScreenType : uint8_t
{
	NONE                           = 0,
	ICE_BRAKE                      = 1,
	RULE_SET                       = 2,
	WEAPON                         = 3,
	ATTACHMENT                     = 4,
	EQUIPMENT                      = 5,
	ITEM                           = 6,
	VEHICLE                        = 7,
	SYSTEM                         = 8,
	DEFAULT                        = 9,
	EXPOSE_WITH_HIGHEST_PRIORITY   = 10,
	ELoadingScreenType_MAX         = 11
};


// Enum TslGame.ECheatType
enum class ECheatType : uint8_t
{
	SpeedHack                      = 0,
	SpeedHack_UE                   = 1,
	IgnoreWall_Hit                 = 2,
	IgnoreWall_Sight               = 3,
	IgnoreVelocity_Hit             = 4,
	ItemPackage                    = 5,
	CarePackageMount               = 6,
	HitLag                         = 7,
	Aimbot                         = 8,
	InvalidImpact                  = 9,
	InvalidImpactZ                 = 10,
	InvalidImpact_Gun_C            = 11,
	InvalidOrigin_Gun              = 12,
	InvalidOrigin_Melee            = 13,
	InvalidOrigin_Punch            = 14,
	InvalidOrigin_Throwable        = 15,
	InvalidOrigin_MeleeThrow       = 16,
	InvalidSimStep_MeleeThrow      = 17,
	InvalidRange                   = 18,
	InvalidRange2                  = 19,
	InvalidSequence                = 20,
	InvalidAmmo                    = 21,
	InvalidReviving                = 22,
	InvalidKick                    = 23,
	InvalidA0                      = 24,
	InvalidB0                      = 25,
	InvalidB1                      = 26,
	InvalidB101                    = 27,
	InvalidH0                      = 28,
	InvalidOrigin_Gun_C            = 29,
	InvalidD0                      = 30,
	InvalidD1                      = 31,
	InvalidS0                      = 32,
	InvalidS1                      = 33,
	InvalidH1                      = 34,
	InvalidH2                      = 35,
	InvalidH3                      = 36,
	InvalidC0                      = 37,
	InvalidC1                      = 38,
	InvalidC2                      = 39,
	InvalidC3                      = 40,
	InvalidC4                      = 41,
	InvalidC5                      = 42,
	InvalidC6                      = 43,
	InvalidC7                      = 44,
	InvalidT0                      = 45,
	InvalidT1                      = 46,
	InvalidT2                      = 47,
	CHKSUM_GUN                     = 48,
	CHKSUM_PUNCH                   = 49,
	CHKSUM_MELEE                   = 50,
	CHKSUM_VEHICLE                 = 51,
	CHKSUM_A0                      = 52,
	CHKSUM_T0                      = 53,
	CHKSUM_S0                      = 54,
	CHKSUM_D0                      = 55,
	CHKSUM_V0                      = 56,
	CHKSUM_W0                      = 57,
	CHKSUM_T1                      = 58,
	CHKSUM_D1                      = 59,
	CHKSUM_CD                      = 60,
	CHKSUM_LC                      = 61,
	CHKSUM_V1                      = 62,
	CHKSUM_P0                      = 63,
	CHKSUM_BP                      = 64,
	CHKSUM_G0                      = 65,
	CHKSUM_G1                      = 66,
	CHKSUM_H2                      = 67,
	CHKSUM_H3                      = 68,
	CHKSUM_UO                      = 69,
	CHKSUM_UF                      = 70,
	VHC_RI                         = 71,
	VHC_SC                         = 72,
	VHC_MG                         = 73,
	VHC_MG_FF                      = 74,
	VHC_MG_FC                      = 75,
	VHC_MG_SW                      = 76,
	VHC_MG_OS                      = 77,
	VHC_MG_BC                      = 78,
	VHC_MG_TC                      = 79,
	VHC_MG_PL                      = 80,
	VHC_MG_HL                      = 81,
	VHC_MGB                        = 82,
	VHC_MGB_FF                     = 83,
	VHC_MGB_FC                     = 84,
	VHC_MGB_OS                     = 85,
	VHC_MGB_BC                     = 86,
	VHC_MGB_TC                     = 87,
	VHC_MGB_PL                     = 88,
	VHC_MGB_HL                     = 89,
	VHC_KILL                       = 90,
	VHC_ED                         = 91,
	CP_RZ                          = 92,
	CP_RZD                         = 93,
	KGB_FP                         = 94,
	KGB_AF                         = 95,
	KGB_AH                         = 96,
	KGB_AH_NA                      = 97,
	ESP1                           = 98,
	ESP2                           = 99,
	ESP3                           = 100,
	SimilarHit                     = 101,
	DoubleKill                     = 102,
	B0Log                          = 103,
	ECheatType_MAX                 = 104
};


// Enum TslGame.ETslControllerType
enum class ETslControllerType : uint8_t
{
	Mouse                          = 0,
	GamePad                        = 1,
	Total                          = 2,
	ETslControllerType_MAX         = 3
};


// Enum TslGame.EVoiceInterfaceType
enum class EVoiceInterfaceType : uint8_t
{
	VIVOX                          = 0,
	XIM                            = 1,
	GVOICE                         = 2,
	EVoiceInterfaceType_MAX        = 3
};


// Enum TslGame.EVoiceTransmissionType
enum class EVoiceTransmissionType : uint8_t
{
	None                           = 0,
	ToAll                          = 1,
	ToChannel                      = 2,
	EVoiceTransmissionType_MAX     = 3
};


// Enum TslGame.EVivoxResponseState
enum class EVivoxResponseState : uint8_t
{
	NotRequested                   = 0,
	Requested                      = 1,
	Fail                           = 2,
	Success                        = 3,
	EVivoxResponseState_MAX        = 4
};


// Enum TslGame.EVoiceChannelType
enum class EVoiceChannelType : uint8_t
{
	None                           = 0,
	All                            = 1,
	GlobalOnly                     = 2,
	TeamOnly                       = 3,
	EVoiceChannelType_MAX          = 4
};


// Enum TslGame.EVoiceChannelJoinState
enum class EVoiceChannelJoinState : uint8_t
{
	NotJoined                      = 0,
	Joining                        = 1,
	Leaving                        = 2,
	Joined                         = 3,
	EVoiceChannelJoinState_MAX     = 4
};


// Enum TslGame.EVoiceLoginState
enum class EVoiceLoginState : uint8_t
{
	NotLoggedin                    = 0,
	Loggingin                      = 1,
	Loggedin                       = 2,
	EVoiceLoginState_MAX           = 3
};


// Enum TslGame.EVoiceConnectionState
enum class EVoiceConnectionState : uint8_t
{
	NotConnected                   = 0,
	Connecting                     = 1,
	Connected                      = 2,
	EVoiceConnectionState_MAX      = 3
};


// Enum TslGame.EWeaponGripLeftHand
enum class EWeaponGripLeftHand : uint8_t
{
	NormalRifle                    = 0,
	Foregrip1                      = 1,
	Foregrip2                      = 2,
	Thompson                       = 3,
	EWeaponGripLeftHand_MAX        = 4
};


// Enum TslGame.EBeginningState
enum class EBeginningState : uint8_t
{
	Invalid                        = 0,
	Normal                         = 1,
	StartIsland                    = 2,
	Airplane                       = 3,
	Skydiving                      = 4,
	Parachuting                    = 5,
	EBeginningState_MAX            = 6
};


// Enum TslGame.ETslWeatherAction
enum class ETslWeatherAction : uint8_t
{
	NotDefined                     = 0,
	Initialized                    = 1,
	Prolonged                      = 2,
	ETslWeatherAction_MAX          = 3
};


// Enum TslGame.EBluezoneType
enum class EBluezoneType : uint8_t
{
	Normal                         = 0,
	Fast                           = 1,
	EBluezoneType_MAX              = 2
};


// Enum TslGame.EVendingMachineType
enum class EVendingMachineType : uint8_t
{
	AMMUNITION                     = 0,
	BOOSTING                       = 1,
	THROWABLE                      = 2,
	WEAPON                         = 3,
	HEALING                        = 4,
	EVendingMachineType_MAX        = 5
};


// Enum TslGame.EPlayerAuthState
enum class EPlayerAuthState : uint8_t
{
	None                           = 0,
	Login                          = 1,
	Logout                         = 2,
	EPlayerAuthState_MAX           = 3
};


// Enum TslGame.EInteractionPhase
enum class EInteractionPhase : uint8_t
{
	First                          = 0,
	Second                         = 1,
	EInteractionPhase_MAX          = 2
};


// Enum TslGame.EEquipableItemLevelType
enum class EEquipableItemLevelType : uint8_t
{
	None                           = 0,
	Level1                         = 1,
	Level2                         = 2,
	Level3                         = 3,
	EEquipableItemLevelType_MAX    = 4
};


// Enum TslGame.EConstraintSlotType
enum class EConstraintSlotType : uint8_t
{
	Block                          = 0,
	Hide                           = 1,
	Max                            = 2,
	EConstraintSlotType_MAX        = 3
};


// Enum TslGame.EDurabilityConsumeType
enum class EDurabilityConsumeType : uint8_t
{
	TotalDamage                    = 0,
	AbsorbDamage                   = 1,
	EDurabilityConsumeType_MAX     = 2
};


// Enum TslGame.TableType
enum class ETableType : uint8_t
{
	Ammo                           = 0,
	Attachment                     = 1,
	Equipment                      = 2,
	Skin                           = 3,
	Weapon                         = 4,
	WeaponThrowable                = 5,
	Castable                       = 6,
	UsedByAction                   = 7,
	Event                          = 8,
	TableType_MAX                  = 9
};


// Enum TslGame.ELobbyItemBundleType
enum class ELobbyItemBundleType : uint8_t
{
	Bundle                         = 0,
	Generator                      = 1,
	ELobbyItemBundleType_MAX       = 2
};


// Enum TslGame.EItemSpawnType
enum class EItemSpawnType : uint8_t
{
	FixedRatioAndAdjustableTotalNumber = 0,
	AdjustableRatioAndFixedTotalNumber = 1,
	AdjustableRatioAndAdjustableTotalNumber = 2,
	EItemSpawnType_MAX             = 3
};


// Enum TslGame.ELocationType
enum class ELocationType : uint8_t
{
	LANDMARK                       = 0,
	EXTRA_LANDMARK                 = 1,
	CITY                           = 2,
	CITY_DETAIL                    = 3,
	TOWN                           = 4,
	COMPOUNDS                      = 5,
	EXTRA                          = 6,
	TEST_SHOW_ALL                  = 7,
	ELocationType_MAX              = 8
};


// Enum TslGame.EClimate
enum class EClimate : uint8_t
{
	Climate_Normal                 = 0,
	Climate_Hot                    = 1,
	Climate_Cold                   = 2,
	Climate_Warm                   = 3,
	Climate_Humid                  = 4,
	Climate_HotAndHumid            = 5,
	Climate_ColdAndHumid           = 6,
	Climate_WarmAndHumid           = 7,
	Climate_Dry                    = 8,
	Climate_HotAndDry              = 9,
	Climate_ColdAndDry             = 10,
	Climate_WarmAndDry             = 11,
	Climate_MAX                    = 12
};


// Enum TslGame.ELobbyLinkState
enum class ELobbyLinkState : uint8_t
{
	Disconnect                     = 0,
	WaitInitialize                 = 1,
	WaitStart                      = 2,
	Gaming                         = 3,
	Finished                       = 4,
	ELobbyLinkState_MAX            = 5
};


// Enum TslGame.ELobbyCharacterAnimationType
enum class ELobbyCharacterAnimationType : uint8_t
{
	Default                        = 0,
	Wardrobe                       = 1,
	Appearance                     = 2,
	ELobbyCharacterAnimationType_MAX = 3
};


// Enum TslGame.EParameterLUTChannel
enum class EParameterLUTChannel : uint8_t
{
	R                              = 0,
	G                              = 1,
	B                              = 2,
	A                              = 3,
	RGBA                           = 4,
	Undefined                      = 5,
	EParameterLUTChannel_MAX       = 6
};


// Enum TslGame.EMaterialParameterType
enum class EMaterialParameterType : uint8_t
{
	Bool                           = 0,
	Scalar                         = 1,
	Vector                         = 2,
	Texture                        = 3,
	Undefined                      = 4,
	EMaterialParameterType_MAX     = 5
};


// Enum TslGame.EBlackZoneState
enum class EBlackZoneState : uint8_t
{
	BZ_WaitingForMatchStart        = 0,
	BZ_SelectNewBlackZone          = 1,
	BZ_BeginStrike                 = 2,
	BZ_FireMisile                  = 3,
	BZ_EndBombing                  = 4,
	BZ_MAX                         = 5
};


// Enum TslGame.ERandomPointSelect
enum class ERandomPointSelect : uint8_t
{
	NavPoint                       = 0,
	NavPointInRadius               = 1,
	ReachableNavPointInRadius      = 2,
	ERandomPointSelect_MAX         = 3
};


// Enum TslGame.ENpcDirection
enum class ENpcDirection : uint8_t
{
	Forward                        = 0,
	Backward                       = 1,
	Left                           = 2,
	Right                          = 3,
	ForwardRight                   = 4,
	BackwardRight                  = 5,
	BackwardLeft                   = 6,
	ForwardLeft                    = 7,
	ENpcDirection_MAX              = 8
};


// Enum TslGame.ENpcWalkingSpeedType
enum class ENpcWalkingSpeedType : uint8_t
{
	Idle                           = 0,
	Walk                           = 1,
	Run                            = 2,
	Sprint                         = 3,
	ENpcWalkingSpeedType_MAX       = 4
};


// Enum TslGame.ENpcCharacterStateType
enum class ENpcCharacterStateType : uint8_t
{
	Default                        = 0,
	Respawn                        = 1,
	Fire1                          = 2,
	Fire2                          = 3,
	Fire3                          = 4,
	Knockback                      = 5,
	Knockdown                      = 6,
	Getup                          = 7,
	ENpcCharacterStateType_MAX     = 8
};


// Enum TslGame.ERandomType
enum class ERandomType : uint8_t
{
	Random                         = 0,
	Shuffle                        = 1,
	Ascending                      = 2,
	Descending                     = 3,
	ERandomType_MAX                = 4
};


// Enum TslGame.ECustomAnimDataType
enum class ECustomAnimDataType : uint8_t
{
	CustomAnimData                 = 0,
	AnimSequence                   = 1,
	ECustomAnimDataType_MAX        = 2
};


// Enum TslGame.ECustomAnimSlotType
enum class ECustomAnimSlotType : uint8_t
{
	FullBody                       = 0,
	UpperBody                      = 1,
	FullBodyInstance               = 2,
	UpperBodyInstance              = 3,
	LowerBody                      = 4,
	ECustomAnimSlotType_MAX        = 5
};


// Enum TslGame.ERetriggerCounter
enum class ERetriggerCounter : uint8_t
{
	First                          = 0,
	Sec                            = 1,
	Third                          = 2,
	Fourth                         = 3,
	ERetriggerCounter_MAX          = 4
};


// Enum TslGame.EPathDebugType
enum class EPathDebugType : uint8_t
{
	None                           = 0,
	Location                       = 1,
	SelectNpc                      = 2,
	EPathDebugType_MAX             = 3
};


// Enum TslGame.EWeaponReloadMethod
enum class EWeaponReloadMethod : uint8_t
{
	Magazine                       = 0,
	OneByOne                       = 1,
	OneByOneAndClip                = 2,
	EWeaponReloadMethod_MAX        = 3
};


// Enum TslGame.EScopeType
enum class EScopeType : uint8_t
{
	Main                           = 0,
	Right                          = 1,
	Total                          = 2,
	None                           = 3,
	EScopeType_MAX                 = 4
};


// Enum TslGame.EWeaponReloadCancelReason
enum class EWeaponReloadCancelReason : uint8_t
{
	Default                        = 0,
	PlayerInterrupted              = 1,
	PlayerMovement                 = 2,
	PlayerInteraction              = 3,
	WeaponSwitch                   = 4,
	PlayerIncapacitated            = 5,
	EWeaponReloadCancelReason_MAX  = 6
};


// Enum TslGame.EWeaponReloadAnimExec
enum class EWeaponReloadAnimExec : uint8_t
{
	Tactical                       = 0,
	Charge                         = 1,
	Single                         = 2,
	Loop                           = 3,
	EWeaponReloadAnimExec_MAX      = 4
};


// Enum TslGame.EWeaponState
enum class EWeaponState : uint8_t
{
	Idle                           = 0,
	Firing                         = 1,
	Reloading                      = 2,
	EWeaponState_MAX               = 3
};


// Enum TslGame.ENoReloadGuideType
enum class ENoReloadGuideType : uint8_t
{
	Alwyas                         = 0,
	WhenCurrentWeapon              = 1,
	ENoReloadGuideType_MAX         = 2
};


// Enum TslGame.EFiremode
enum class EFiremode : uint8_t
{
	FullAuto                       = 0,
	ThreeRoundBurst                = 1,
	TwoRoundBurst                  = 2,
	SemiAuto                       = 3,
	Single                         = 4,
	EFiremode_MAX                  = 5
};


// Enum TslGame.EConsoleHitDirections
enum class EConsoleHitDirections : uint8_t
{
	None                           = 0,
	Front_Right                    = 1,
	Front_Left                     = 2,
	Rear                           = 3,
	EConsoleHitDirections_MAX      = 4
};


// Enum TslGame.ERoundEndPointType
enum class ERoundEndPointType : uint8_t
{
	Empty                          = 0,
	Lost                           = 1,
	Won                            = 2,
	ERoundEndPointType_MAX         = 3
};


// Enum TslGame.TslAudioInterpolation
enum class ETslAudioInterpolation : uint8_t
{
	AudioInterpolation_Log3        = 0,
	AudioInterpolation_Sine        = 1,
	AudioInterpolation_Log1        = 2,
	AudioInterpolation_InvSCurve   = 3,
	AudioInterpolation_Linear      = 4,
	AudioInterpolation_SCurve      = 5,
	AudioInterpolation_Exp1        = 6,
	AudioInterpolation_SineRecip   = 7,
	AudioInterpolation_Exp3        = 8,
	AudioInterpolation_MAX         = 9
};


// Enum TslGame.eVehicleSpawnStatus
enum class EeVehicleSpawnStatus : uint8_t
{
	SpawnNone                      = 0,
	SpawnAlived                    = 1,
	SpawnDestroyed                 = 2,
	eVehicleSpawnStatus_MAX        = 3
};


// Enum TslGame.ESurfaceEffect
enum class ESurfaceEffect : uint8_t
{
	S_None                         = 0,
	S_Concrete_Roll                = 1,
	S_Concrete_Skid                = 2,
	S_Concrete_Spin                = 3,
	S_Dirt_Roll                    = 4,
	S_Dirt_Skid                    = 5,
	S_Dirt_Spin                    = 6,
	S_Water_Roll                   = 7,
	S_Water_Skid                   = 8,
	S_Water_Spin                   = 9,
	S_Metal_Roll                   = 10,
	S_Metal_Skid                   = 11,
	S_Metal_Spin                   = 12,
	S_Wood_Roll                    = 13,
	S_Wood_Skid                    = 14,
	S_Wood_Spin                    = 15,
	S_Rock_Roll                    = 16,
	S_Rock_Skid                    = 17,
	S_Rock_Spin                    = 18,
	S_Grass_Roll                   = 19,
	S_Grass_Skid                   = 20,
	S_Grass_Spin                   = 21,
	S_Sand_Roll                    = 22,
	S_Sand_Skid                    = 23,
	S_Sand_Spin                    = 24,
	S_Concrete_Brake               = 25,
	S_Dirt_Brake                   = 26,
	S_Water_Brake                  = 27,
	S_Metal_Brake                  = 28,
	S_Wood_Brake                   = 29,
	S_Rock_Brake                   = 30,
	S_Grass_Brake                  = 31,
	S_Sand_Brake                   = 32,
	S_Snow_Brake                   = 33,
	S_SnowRock_Brake               = 34,
	S_Ice_Brake                    = 35,
	S_Common_BrakeDisc             = 36,
	S_Concrete_Punctured_Roll      = 37,
	S_Concrete_Punctured_Skid      = 38,
	S_Concrete_Punctured_Spin      = 39,
	S_Concrete_Punctured_Brake     = 40,
	S_Snow_Roll                    = 41,
	S_Snow_Skid                    = 42,
	S_Snow_Spin                    = 43,
	S_SnowRock_Roll                = 44,
	S_SnowRock_Skid                = 45,
	S_SnowRock_Spin                = 46,
	S_Ice_Roll                     = 47,
	S_Ice_Skid                     = 48,
	S_Ice_Spin                     = 49,
	S_Mud_Roll                     = 50,
	S_Mud_Skid                     = 51,
	S_Mud_Spin                     = 52,
	S_Mud_Brake                    = 53,
	S_Common_Neutral               = 54,
	S_MAX                          = 55
};


// Enum TslGame.EMeleeThrowState
enum class EMeleeThrowState : uint8_t
{
	Idle                           = 0,
	Prepare                        = 1,
	Throw                          = 2,
	EMeleeThrowState_MAX           = 3
};


// Enum TslGame.EHitCheckType
enum class EHitCheckType : uint8_t
{
	HitCheck_Once                  = 0,
	HitCheck_Multi                 = 1,
	HitCheck_MAX                   = 2
};


// Enum TslGame.EWeaponDisplayZoomState
enum class EWeaponDisplayZoomState : uint8_t
{
	ZoomState_Default              = 0,
	ZoomState_Charm                = 1,
	ZoomState_MAX                  = 2
};


// Enum TslGame.EWeaponTransitionState
enum class EWeaponTransitionState : uint8_t
{
	Stable                         = 0,
	Arming_Right                   = 1,
	UnArming_Right                 = 2,
	Arming_Left                    = 3,
	UnArming_Left                  = 4,
	EWeaponTransitionState_MAX     = 5
};


// Enum TslGame.EBlendSequenceByBoolStartType
enum class EBlendSequenceByBoolStartType : uint8_t
{
	Restart                        = 0,
	SameTime                       = 1,
	EBlendSequenceByBoolStartType_MAX = 2
};


// Enum TslGame.EPlatoonType
enum class EPlatoonType : uint8_t
{
	PlatoonA                       = 0,
	PlatoonB                       = 1,
	EPlatoonType_MAX               = 2
};


// Enum TslGame.EAnimWeaponType
enum class EAnimWeaponType : uint8_t
{
	None                           = 0,
	Rifle                          = 1,
	Pistol                         = 2,
	Throwable                      = 3,
	Melee                          = 4,
	Shield                         = 5,
	EAnimWeaponType_MAX            = 6
};


// Enum TslGame.ECameraViewBehaviour
enum class ECameraViewBehaviour : uint8_t
{
	FpsAndTps                      = 0,
	FpsOnly                        = 1,
	TpsOnly                        = 2,
	ECameraViewBehaviour_MAX       = 3
};


// Enum TslGame.EPlayerStartType
enum class EPlayerStartType : uint8_t
{
	OnePlace                       = 0,
	SeveralPlace                   = 1,
	EPlayerStartType_MAX           = 2
};


// Enum TslGame.EMatchStartType
enum class EMatchStartType : uint8_t
{
	Normal                         = 0,
	Airborne                       = 1,
	EMatchStartType_MAX            = 2
};


// Enum TslGame.EGender
enum class EGender : uint8_t
{
	Male                           = 0,
	Female                         = 1,
	EGender_MAX                    = 2
};


// Enum TslGame.EKillcamDisplayCode
enum class EKillcamDisplayCode : uint8_t
{
	NotVisible                     = 0,
	OptionDisabled                 = 1,
	Recording                      = 2,
	Playable                       = 3,
	Replay                         = 4,
	FailToLoad                     = 5,
	DemoFailure                    = 6,
	DetectedUnusualMovement        = 7,
	EKillcamDisplayCode_MAX        = 8
};


// Enum TslGame.EWidgetShowType
enum class EWidgetShowType : uint8_t
{
	Show                           = 0,
	Hide                           = 1,
	Toggle                         = 2,
	EWidgetShowType_MAX            = 3
};


// Enum TslGame.EAnimStance
enum class EAnimStance : uint8_t
{
	Stand                          = 0,
	Crouch                         = 1,
	Prone                          = 2,
	Groggy                         = 3,
	EAnimStance_MAX                = 4
};


// Enum TslGame.ESlotOffsetType
enum class ESlotOffsetType : uint8_t
{
	NoOffset                       = 0,
	BagLevel1                      = 1,
	BagLevel2                      = 2,
	BagLevel3                      = 3,
	ESlotOffsetType_MAX            = 4
};


// Enum TslGame.EItemSpotGroupType
enum class EItemSpotGroupType : uint8_t
{
	GroupA                         = 0,
	GroupB                         = 1,
	GroupC                         = 2,
	GroupD                         = 3,
	GroupE                         = 4,
	GroupF                         = 5,
	GroupG                         = 6,
	GroupH                         = 7,
	GroupI                         = 8,
	GroupJ                         = 9,
	EItemSpotGroupType_MAX         = 10
};


// Enum TslGame.EItemSpotType
enum class EItemSpotType : uint8_t
{
	TypeA                          = 0,
	TypeB                          = 1,
	TypeC                          = 2,
	TypeD                          = 3,
	TypeE                          = 4,
	TypeF                          = 5,
	EItemSpotType_MAX              = 6
};


// Enum TslGame.EAttackType
enum class EAttackType : uint8_t
{
	None                           = 0,
	Weapon                         = 1,
	VehicleCrash                   = 2,
	VehicleExplosion               = 3,
	Fall                           = 4,
	BlueZone                       = 5,
	RedZone                        = 6,
	BlackZone                      = 7,
	EAttackType_MAX                = 8
};


// Enum TslGame.EPlayerMoveType
enum class EPlayerMoveType : uint8_t
{
	OnFoot                         = 0,
	OnSwim                         = 1,
	OnVehicle                      = 2,
	OnParachute                    = 3,
	OnFreefall                     = 4,
	EPlayerMoveType_MAX            = 5
};


// Enum TslGame.EVaultRequirementType
enum class EVaultRequirementType : uint8_t
{
	VaultReqType_False             = 0,
	VaultReqType_True              = 1,
	VaultReqType_Any               = 2,
	VaultReqType_MAX               = 3
};


// Enum TslGame.EVaultAnimType
enum class EVaultAnimType : uint8_t
{
	VaultNone                      = 0,
	Vault200_Stationary            = 1,
	Vault200_Mobile                = 2,
	Vault200_Narrow                = 3,
	Vault160_Stationary            = 4,
	Vault160_Mobile                = 5,
	Vault160_Narrow                = 6,
	Vault120_Stationary            = 7,
	Vault120_Mobile                = 8,
	Vault120_Slide                 = 9,
	Vault120_Narrow                = 10,
	Vault90_Stationary             = 11,
	Vault90_Mobile                 = 12,
	Vault90_Slide                  = 13,
	Vault90_Narrow                 = 14,
	Climb200_Stationary            = 15,
	Climb200_Mobile                = 16,
	Climb200_Slide                 = 17,
	Climb200_Narrow                = 18,
	Climb160_Stationary            = 19,
	Climb160_Mobile                = 20,
	Climb160_Slide                 = 21,
	Climb160_Narrow                = 22,
	Climb120_Stationary            = 23,
	Climb120_Mobile                = 24,
	Climb120_Slide                 = 25,
	Climb120_Narrow                = 26,
	Climb90_Stationary             = 27,
	Climb90_Mobile                 = 28,
	Climb90_Slide                  = 29,
	Climb90_Narrow                 = 30,
	Vault90Roll                    = 31,
	Vault120Window                 = 32,
	Vault60_Stationary             = 33,
	Vault60_Mobile                 = 34,
	Vault60_Slide                  = 35,
	Vault60_Narrow                 = 36,
	Climb60_Stationary             = 37,
	Climb60_Mobile                 = 38,
	Climb60_Narrow                 = 39,
	LedgeGrab_Up_Climb             = 40,
	LedgeGrab_Up_Climb_Swing       = 41,
	LedgeGrab_Up_Climb_HalfSwing   = 42,
	LedgeGrab_Up_Vault             = 43,
	LedgeGrab_Up_Vault_Swing       = 44,
	LedgeGrab_Up_Vault_HalfSwing   = 45,
	LedgeGrab_High_Climb           = 46,
	LedgeGrab_High_Climb_Swing     = 47,
	LedgeGrab_High_Climb_HalfSwing = 48,
	LedgeGrab_High_Vault           = 49,
	LedgeGrab_High_Vault_Swing     = 50,
	LedgeGrab_High_Vault_HalfSwing = 51,
	LedgeGrab_Low_Climb            = 52,
	LedgeGrab_Low_Climb_Swing      = 53,
	LedgeGrab_Low_Climb_HalfSwing  = 54,
	LedgeGrab_Low_Vault            = 55,
	LedgeGrab_Low_Vault_Swing      = 56,
	LedgeGrab_Low_Vault_HalfSwing  = 57,
	LedgeGrab_Low_Vault_Narrow     = 58,
	LedgeGrab_Low_Vault_HalfSwing_Narrow = 59,
	LedgeGrab_Low_Vault_Swing_Narrow = 60,
	LedgeGrab_High_Vault_Narrow    = 61,
	LedgeGrab_High_Vault_HalfSwing_Narrow = 62,
	LedgeGrab_High_Vault_Swing_Narrow = 63,
	LedgeGrab_Up_Vault_Narrow      = 64,
	LedgeGrab_Up_Vault_HalfSwing_Narrow = 65,
	LedgeGrab_Up_Vault_Swing_Narrow = 66,
	EVaultAnimType_MAX             = 67
};


// Enum TslGame.EBuffOverlapSolveMethod
enum class EBuffOverlapSolveMethod : uint8_t
{
	IgnoreLater                    = 0,
	Overwrite                      = 1,
	RestartTimer                   = 2,
	Stack                          = 3,
	EBuffOverlapSolveMethod_MAX    = 4
};


// Enum TslGame.EDamageVictimActorType
enum class EDamageVictimActorType : uint8_t
{
	Character                      = 0,
	Vehicle                        = 1,
	Wheel                          = 2,
	DestructibleActor              = 3,
	ExplosiveItem                  = 4,
	EDamageVictimActorType_MAX     = 5
};


// Enum TslGame.ECastableItemType
enum class ECastableItemType : uint8_t
{
	None                           = 0,
	Bandage                        = 1,
	FirstAid                       = 2,
	Medkit                         = 3,
	EnergyDrink                    = 4,
	Painkiller                     = 5,
	Adrenaline                     = 6,
	GasCan                         = 7,
	Battery                        = 8,
	ECastableItemType_MAX          = 9
};


// Enum TslGame.ECastLevel
enum class ECastLevel : uint8_t
{
	None                           = 0,
	NoRestriction                  = 1,
	Restriction                    = 2,
	ECastLevel_MAX                 = 3
};


// Enum TslGame.ECastPriority
enum class ECastPriority : uint8_t
{
	None                           = 0,
	Low                            = 1,
	Normal                         = 2,
	High                           = 3,
	Max                            = 4,
	ECastPriority_MAX              = 5
};


// Enum TslGame.ELandingSoundSwitchState
enum class ELandingSoundSwitchState : uint8_t
{
	None                           = 0,
	Light                          = 1,
	Heavy                          = 2,
	VeryHeavy                      = 3,
	ELandingSoundSwitchState_MAX   = 4
};


// Enum TslGame.EStatTrakState
enum class EStatTrakState : uint8_t
{
	Run                            = 0,
	Locked                         = 1,
	Error                          = 2,
	EStatTrakState_MAX             = 3
};


// Enum TslGame.ESkinApplicationType
enum class ESkinApplicationType : uint8_t
{
	Application_InOrder            = 0,
	Application_Slot               = 1,
	Application_Index              = 2,
	Application_MAX                = 3
};


// Enum TslGame.ESkinMeshType
enum class ESkinMeshType : uint8_t
{
	SkeletalMesh                   = 0,
	AsyncStaticMesh                = 1,
	StaticMesh                     = 2,
	ESkinMeshType_MAX              = 3
};


// Enum TslGame.ESkinCategory
enum class ESkinCategory : uint8_t
{
	Skin_None                      = 0,
	Skin_Equipment                 = 1,
	Skin_Parachute                 = 2,
	Skin_Weapon                    = 3,
	Skin_MeleeWeapon               = 4,
	Skin_Vehicle                   = 5,
	Skin_MAX                       = 6
};


// Enum TslGame.ECastCancelReason
enum class ECastCancelReason : uint8_t
{
	Invalid                        = 0,
	CasterAiming                   = 1,
	CasterArming                   = 2,
	CasterApnea                    = 3,
	CasterSprinting                = 4,
	CasterJumping                  = 5,
	CasterFallingLong              = 6,
	CasterFiring                   = 7,
	CasterGroggy                   = 8,
	CasterGroggyOnZeroTimeCast     = 9,
	CasterHipped                   = 10,
	CasterInvalid                  = 11,
	CasterNotAlive                 = 12,
	CasterPickedUpDroppedItem      = 13,
	CasterPickedUpItemFromPackage  = 14,
	CasterReloading                = 15,
	CasterRolling                  = 16,
	CasterTargeting                = 17,
	CasterUnarmAttacking           = 18,
	CasterVault                    = 19,
	CastObjectInvalid              = 20,
	CastObjectNotExecutable        = 21,
	FailedCasterMovementDistCheckOnClient = 22,
	FailedCasterMovementDistCheckOnServer = 23,
	FailedCasterAndCastObjDistCheckOnClient = 24,
	FailedCasterAndCastObjDistCheckOnServer = 25,
	CharacterBeingRevivedDead      = 26,
	ManualCancel                   = 27,
	NewCastOnClient                = 28,
	NewCastOnServer                = 29,
	VehicleLanding                 = 30,
	VehicleSeatChanged             = 31,
	VehicleMoving                  = 32,
	VehicleUpsideDown              = 33,
	ECastCancelReason_MAX          = 34
};


// Enum TslGame.GamepadHudDataType
enum class EGamepadHudDataType : uint8_t
{
	EFloat                         = 0,
	EBool                          = 1,
	EFString                       = 2,
	GamepadHudDataType_MAX         = 3
};


// Enum TslGame.ESandboxGroypType
enum class ESandboxGroypType : uint8_t
{
	Weapon                         = 0,
	Item                           = 1,
	Vehicle                        = 2,
	ESandboxGroypType_MAX          = 3
};


// Enum TslGame.ESandboxPowerType
enum class ESandboxPowerType : uint8_t
{
	None                           = 0,
	Fly                            = 1,
	InvulnerableEffect             = 2,
	CarePackage                    = 3,
	RedZone                        = 4,
	ESandboxPowerType_MAX          = 5
};


// Enum TslGame.ECharFlagsNormal
enum class ECharFlagsNormal : uint8_t
{
	IsGroggying                    = 0,
	IsActiveRagdollActive          = 1,
	HasShieldEquipped              = 2,
	IsOutsideBluezone              = 3,
	ECharFlagsNormal_MAX           = 4
};


// Enum TslGame.ELandingState
enum class ELandingState : uint8_t
{
	None                           = 0,
	Falling                        = 1,
	HeavyFalling                   = 2,
	ExtremeFalling                 = 3,
	FallingRecovery                = 4,
	PostLandingRecovery            = 5,
	ELandingState_MAX              = 6
};


// Enum TslGame.ECharFlagsSkipOwner
enum class ECharFlagsSkipOwner : uint8_t
{
	WantsToRun                     = 0,
	WantsToSprint                  = 1,
	WantsToSprintingAuto           = 2,
	WantsToRollingLeft             = 3,
	WantsToRollingRight            = 4,
	AimStateActive                 = 5,
	IsThirdPerson                  = 6,
	IsReviving                     = 7,
	IgnoreRotation                 = 8,
	IsWeaponObstructed             = 9,
	IsCoatEquipped                 = 10,
	IsThrowHigh                    = 11,
	WantsToCancelVault             = 12,
	IsScopingRemote                = 13,
	IsAimingRemote                 = 14,
	IsFirstPersonRemote            = 15,
	IsInVehicleRemote              = 16,
	IsPeekLeftRemote               = 17,
	IsPeekRightRemote              = 18,
	IsHoldingAngled                = 19,
	ECharFlagsSkipOwner_MAX        = 20
};


// Enum TslGame.EPunchDamageType
enum class EPunchDamageType : uint8_t
{
	PunchDamage_Light              = 0,
	PunchDamage_Heavy              = 1,
	PunchDamage_MAX                = 2
};


// Enum TslGame.EMovementType
enum class EMovementType : uint8_t
{
	M_StandWalk                    = 0,
	M_StandRun                     = 1,
	M_StandSprint                  = 2,
	M_CrouchWalk                   = 3,
	M_CrouchRun                    = 4,
	M_CrouchSprint                 = 5,
	M_ProneWalk                    = 6,
	M_ProneRun                     = 7,
	M_ProneSprint                  = 8,
	M_StandScope                   = 9,
	M_CrouchScope                  = 10,
	M_ProneScope                   = 11,
	M_StandAim                     = 12,
	M_CrouchAim                    = 13,
	M_ProneAim                     = 14,
	M_Swim                         = 15,
	M_UnderwaterSwim               = 16,
	M_DBNO                         = 17,
	M_MAX                          = 18
};


// Enum TslGame.EMovementDirection
enum class EMovementDirection : uint8_t
{
	F_Direction                    = 0,
	L_Direction                    = 1,
	R_Direction                    = 2,
	B_Direction                    = 3,
	FL_Direction                   = 4,
	FR_Direction                   = 5,
	BL_Direction                   = 6,
	BR_Direction                   = 7,
	EMovementDirection_MAX         = 8
};


// Enum TslGame.EAnimStanceType
enum class EAnimStanceType : uint8_t
{
	AnimType_Stand                 = 0,
	AnimType_Crouch                = 1,
	AnimType_Prone                 = 2,
	AnimType_MAX                   = 3
};


// Enum TslGame.ERaycastDirection
enum class ERaycastDirection : uint8_t
{
	Forward                        = 0,
	Down_45_Degrees                = 1,
	Down                           = 2,
	ERaycastDirection_MAX          = 3
};


// Enum TslGame.ELobbyItemPointSellingType
enum class ELobbyItemPointSellingType : uint8_t
{
	Normal                         = 0,
	WeeklyDouble                   = 1,
	ELobbyItemPointSellingType_MAX = 2
};


// Enum TslGame.ELobbyItemPlatform
enum class ELobbyItemPlatform : uint8_t
{
	PC_Steam                       = 0,
	PC_NonSteam                    = 1,
	Xbox                           = 2,
	ELobbyItemPlatform_MAX         = 3
};


// Enum TslGame.ELobbyItemTier
enum class ELobbyItemTier : uint8_t
{
	Basic                          = 0,
	Common                         = 1,
	Classic                        = 2,
	Special                        = 3,
	Rare                           = 4,
	Elite                          = 5,
	Epic                           = 6,
	Legendary                      = 7,
	Ultimate                       = 8,
	Event                          = 9,
	ELobbyItemTier_MAX             = 10
};


// Enum TslGame.ELobbyItemCategory
enum class ELobbyItemCategory : uint8_t
{
	Belt                           = 0,
	Body                           = 1,
	Eyes                           = 2,
	Feet                           = 3,
	Head                           = 4,
	Jacket                         = 5,
	Legs                           = 6,
	Mask                           = 7,
	Hands                          = 8,
	Box                            = 9,
	Key                            = 10,
	WeaponSkin                     = 11,
	ParachuteSkin                  = 12,
	HelmetSkin                     = 13,
	BackpackSkin                   = 14,
	TorsoArmorSkin                 = 15,
	VehicleSkin                    = 16,
	Multislot                      = 17,
	ELobbyItemCategory_MAX         = 18
};


// Enum TslGame.EAttachParent
enum class EAttachParent : uint8_t
{
	None                           = 0,
	Character                      = 1,
	WeaponGun                      = 2,
	EAttachParent_MAX              = 3
};


// Enum TslGame.EImpactType
enum class EImpactType : uint8_t
{
	Splatter                       = 0,
	Smear                          = 1,
	EImpactType_MAX                = 2
};


// Enum TslGame.ESurviveWeaponPropSlot
enum class ESurviveWeaponPropSlot : uint8_t
{
	SWPS_MainShootWeapon1          = 0,
	SWPS_MainShootWeapon2          = 1,
	SWPS_SubShootWeapon            = 2,
	SWPS_MeleeWeapon               = 3,
	SWPS_HandProp                  = 4,
	SWPS_Max                       = 5
};


// Enum TslGame.EWeatherStatusType
enum class EWeatherStatusType : uint8_t
{
	EWeatherStatusType_None        = 0,
	EWeatherStatusType_SunnyDay    = 1,
	EWeatherStatusType_Night       = 2,
	EWeatherStatusType_Fog         = 3,
	EWeatherStatusType_Rain        = 4,
	EWeatherStatusType_Snow        = 5,
	EWeatherStatusType_Blizzard    = 6,
	EWeatherStatusType_MAX         = 7
};


// Enum TslGame.UTPickerTargetType
enum class EUTPickerTargetType : uint8_t
{
	PTT_FRIEND                     = 0,
	PTT_ENEMY                      = 1,
	PTT_ALL                        = 2,
	PTT_Self                       = 3,
	PTT_MAX                        = 4
};


// Enum TslGame.ExtraPlayerLiveState
enum class ExtraPlayerLiveState : uint8_t
{
	InDefault                      = 0,
	InPlane                        = 1,
	InParachute                    = 2,
	InVehicle                      = 3,
	InDying                        = 4,
	InDied                         = 5,
	Offline                        = 6,
	ExtraPlayerLiveState_MAX       = 7
};


// Enum TslGame.EAIMoveType
enum class EAIMoveType : uint8_t
{
	StraightMove                   = 0,
	CurveMove                      = 1,
	EAIMoveType_MAX                = 2
};


// Enum TslGame.EAIWeaponShootType
enum class EAIWeaponShootType : uint8_t
{
	SingleShot                     = 0,
	Auto                           = 1,
	EAIWeaponShootType_MAX         = 2
};


// Enum TslGame.EAINewFocusPriority
enum class EAINewFocusPriority : uint8_t
{
	Default                        = 0,
	Move                           = 1,
	Gameplay                       = 2,
	EAINewFocusPriority_MAX        = 3
};


// Enum TslGame.EAIMovePose
enum class EAIMovePose : uint8_t
{
	Walk                           = 0,
	Run                            = 1,
	CrouchSprint                   = 2,
	KeepCurrentPose                = 3,
	EAIMovePose_MAX                = 4
};


// Enum TslGame.EAIPoseState
enum class EAIPoseState : uint8_t
{
	Stand                          = 0,
	Crouch                         = 1,
	Prone                          = 2,
	Jump                           = 3,
	Reload                         = 4,
	EAIPoseState_MAX               = 5
};


// Enum TslGame.EAITriggerAttrType
enum class EAITriggerAttrType : uint8_t
{
	None                           = 0,
	Health                         = 1,
	Energy                         = 2,
	EAITriggerAttrType_MAX         = 3
};


// Enum TslGame.EAIAttrCompareType
enum class EAIAttrCompareType : uint8_t
{
	None                           = 0,
	Great                          = 1,
	Less                           = 2,
	EAIAttrCompareType_MAX         = 3
};


// Enum TslGame.EAIEquipSpawnItemType
enum class EAIEquipSpawnItemType : uint8_t
{
	Shoot_Weap                     = 0,
	Backpack                       = 1,
	other                          = 2,
	EAIEquipSpawnItemType_MAX      = 3
};


// Enum TslGame.EModifyBlackboardDataValueType
enum class EModifyBlackboardDataValueType : uint8_t
{
	Int                            = 0,
	Float                          = 1,
	Bool                           = 2,
	String                         = 3,
	Object                         = 4,
	Vector3                        = 5,
	EModifyBlackboardDataValueType_MAX = 6
};


// Enum TslGame.EFlareDeploymentType
enum class EFlareDeploymentType : uint8_t
{
	Deploy_None                    = 0,
	Deploy_InWhite                 = 1,
	Deploy_InBlue                  = 2,
	Deploy_Outside                 = 3,
	Deploy_MAX                     = 4
};


// Enum TslGame.ECustomCarepackageState
enum class ECustomCarepackageState : uint8_t
{
	Transporting                   = 0,
	Falling                        = 1,
	Landing                        = 2,
	ECustomCarepackageState_MAX    = 3
};


// Enum TslGame.EDoorState
enum class EDoorState : uint8_t
{
	Closed                         = 0,
	Closing                        = 1,
	Opened                         = 2,
	Opening                        = 3,
	EDoorState_MAX                 = 4
};


// Enum TslGame.EDestrucibleSurfaceSourceType
enum class EDestrucibleSurfaceSourceType : uint8_t
{
	Unknown                        = 0,
	Projectile                     = 1,
	Grenade                        = 2,
	Warhead                        = 3,
	Slashing                       = 4,
	EDestrucibleSurfaceSourceType_MAX = 5
};


// Enum TslGame.EMasteryItemType
enum class EMasteryItemType : uint8_t
{
	Charm                          = 0,
	Mesh                           = 1,
	EMasteryItemType_MAX           = 2
};


// Enum TslGame.EThrowableState
enum class EThrowableState : uint8_t
{
	Idle                           = 0,
	PinOff                         = 1,
	Cooking                        = 2,
	Throw                          = 3,
	Dropped                        = 4,
	EThrowableState_MAX            = 5
};


// Enum TslGame.EProjectileExplosionStartType
enum class EProjectileExplosionStartType : uint8_t
{
	NotStart                       = 0,
	Impact                         = 1,
	Delay                          = 2,
	ImpactOrDelay                  = 3,
	EProjectileExplosionStartType_MAX = 4
};


// Enum TslGame.EProjectileExplodeState
enum class EProjectileExplodeState : uint8_t
{
	NotExplode                     = 0,
	ImpactExplode                  = 1,
	TimerExplode                   = 2,
	EProjectileExplodeState_MAX    = 3
};


// Enum TslGame.EProjectileExplosionRotationType
enum class EProjectileExplosionRotationType : uint8_t
{
	ProjectileUpVector             = 0,
	WorldUpVector                  = 1,
	ProjectileForwardVector        = 2,
	EProjectileExplosionRotationType_MAX = 3
};


// Enum TslGame.EHornSoundType
enum class EHornSoundType : uint8_t
{
	HornOn                         = 0,
	HornOff                        = 1,
	InstantHorn                    = 2,
	EHornSoundType_MAX             = 3
};


// Enum TslGame.EVehicleAnimType
enum class EVehicleAnimType : uint8_t
{
	DefaultDriver                  = 0,
	DefaultPassenger               = 1,
	BuggyDriver                    = 2,
	BuggyPassenger                 = 3,
	DaciaDriver                    = 4,
	DaciaPassengerFR               = 5,
	DaciaPassengerBL               = 6,
	DaciaPassengerBC               = 7,
	DaciaPassengerBR               = 8,
	UazDriver                      = 9,
	UazPassengerFR                 = 10,
	UazPassengerBL                 = 11,
	UazPassengerBC                 = 12,
	UazPassengerBR                 = 13,
	BoatDriver                     = 14,
	BoatPassengerFR                = 15,
	BoatPassengerBL                = 16,
	BoatPassengerBC                = 17,
	BoatPassengerBR                = 18,
	MotoDriver                     = 19,
	MotoPassenger                  = 20,
	MotoSidecar                    = 21,
	MotoDriverSidecar              = 22,
	MotoPassengerSidecar           = 23,
	AircraftPassenger              = 24,
	JetskiDriver                   = 25,
	JetskiPassenger                = 26,
	PickupTruckDriver              = 27,
	PickupTruckPassengerFR         = 28,
	PickupTruckPassengerBL_Open    = 29,
	PickupTruckPassengerBR_Open    = 30,
	PickupTruckPassengerBL_Closed  = 31,
	PickupTruckPassengerBR_Closed  = 32,
	MinibusDriver                  = 33,
	MinibusPassengerFR             = 34,
	MinibusPassengerML             = 35,
	MinibusPassengerMR             = 36,
	MinibusPassengerBL             = 37,
	MinibusPassengerBR             = 38,
	MiradoDriver                   = 39,
	MiradoFR                       = 40,
	MiradoRL                       = 41,
	MiradoRR                       = 42,
	ScooterPassenger               = 43,
	TukDriver                      = 44,
	RonyDriver                     = 45,
	Snowmobile_Passenger           = 46,
	YetiDriver                     = 47,
	YetiPassenger                  = 48,
	LadaNivaDriver                 = 49,
	BRDM_Driver                    = 50,
	BRDM_Passenger                 = 51,
	Motorglider_Pilot              = 52,
	Motorglider_Passenger          = 53,
	EVehicleAnimType_MAX           = 54
};


// Enum TslGame.ERiderType
enum class ERiderType : uint8_t
{
	Driver                         = 0,
	Passenger                      = 1,
	ERiderType_MAX                 = 2
};


// Enum TslGame.EMapColor
enum class EMapColor : uint8_t
{
	Undefined                      = 0,
	Red                            = 1,
	Green                          = 2,
	Blue                           = 3,
	Yellow                         = 4,
	EMapColor_MAX                  = 5
};


// Enum TslGame.EThingGroupSpawnType
enum class EThingGroupSpawnType : uint8_t
{
	None                           = 0,
	Probability                    = 1,
	TotalCount                     = 2,
	EThingGroupSpawnType_MAX       = 3
};


// Enum TslGame.EVehicleEngineState
enum class EVehicleEngineState : uint8_t
{
	EEngineStateAutoOff            = 0,
	EEngineStateAutoOn             = 1,
	EEngineStateManualOff          = 2,
	EEngineStateManualOn           = 3,
	EVehicleEngineState_MAX        = 4
};


// Enum TslGame.ETirePunctureReason
enum class ETirePunctureReason : uint8_t
{
	Shot                           = 0,
	Environment                    = 1,
	Explosion                      = 2,
	PanzerFaustExplosion           = 3,
	Other                          = 4,
	ETirePunctureReason_MAX        = 5
};


// Enum TslGame.EWheelContactType
enum class EWheelContactType : uint8_t
{
	WCT_Static                     = 0,
	WCT_Roll                       = 1,
	WCT_LatSlip                    = 2,
	WCT_LongSlip                   = 3,
	WCT_MAX                        = 4
};


// Enum TslGame.EAnimShieldState
enum class EAnimShieldState : uint8_t
{
	SS_Hip                         = 0,
	SS_Block                       = 1,
	SS_ADS                         = 2,
	SS_MAX                         = 3
};


// Enum TslGame.EAnimPawnState
enum class EAnimPawnState : uint8_t
{
	PS_OnFoot                      = 0,
	PS_VehicleDriver               = 1,
	PS_VehiclePassenger            = 2,
	PS_Freefall                    = 3,
	PS_Parachute                   = 4,
	PS_Swim                        = 5,
	PS_DBNO                        = 6,
	PS_Reviving                    = 7,
	PS_Flying                      = 8,
	PS_ActiveRagdoll               = 9,
	PS_MAX                         = 10
};


// Enum TslGame.EHoldButtonWidgetType
enum class EHoldButtonWidgetType : uint8_t
{
	EHoldButtonWidgetType_X        = 0,
	EHoldButtonWidgetType_Y        = 1,
	EHoldButtonWidgetType_A        = 2,
	EHoldButtonWidgetType_B        = 3,
	EHoldButtonWidgetType_MAX      = 4
};


// Enum TslGame.EDamageFieldType
enum class EDamageFieldType : uint8_t
{
	Default                        = 0,
	DirectTick                     = 1,
	EDamageFieldType_MAX           = 2
};


// Enum TslGame.EDynamicWeather
enum class EDynamicWeather : uint8_t
{
	NotInitialized                 = 0,
	Initialized                    = 1,
	BlendInStarted                 = 2,
	Saturated                      = 3,
	BlendOutStarted                = 4,
	BlendOutEnded                  = 5,
	Finished                       = 6,
	EDynamicWeather_MAX            = 7
};


// Enum TslGame.EEffectSpreadState
enum class EEffectSpreadState : uint8_t
{
	ESS_InitialTrace               = 0,
	ESS_InitialProcess             = 1,
	ESS_Spreading                  = 2,
	ESS_SpreadDone                 = 3,
	ESS_Ending                     = 4,
	ESS_MAX                        = 5
};


// Enum TslGame.EEmoteAnimType
enum class EEmoteAnimType : uint8_t
{
	EmoteFullBody                  = 0,
	EmoteUpperBody                 = 1,
	EmoteArm                       = 2,
	EEmoteAnimType_MAX             = 3
};


// Enum TslGame.ETslFenceSelector
enum class ETslFenceSelector : uint8_t
{
	None                           = 0,
	Use                            = 1,
	Use01                          = 2,
	Use02                          = 3,
	Use03                          = 4,
	ETslFenceSelector_MAX          = 5
};


// Enum TslGame.EReactionObjectType
enum class EReactionObjectType : uint8_t
{
	Fence                          = 0,
	Hay                            = 1,
	Camera                         = 2,
	EReactionObjectType_MAX        = 3
};


// Enum TslGame.EReactionType
enum class EReactionType : uint8_t
{
	Reaciton_None                  = 0,
	Reaction_Physics               = 1,
	Reaction_Destructible          = 2,
	EReactionType_MAX              = 3
};


// Enum TslGame.EWarModeCarePackageKitType
enum class EWarModeCarePackageKitType : uint8_t
{
	CarepackageKit_Off             = 0,
	CarepackageKit_Basic           = 1,
	CarepackageKit_ARKit           = 2,
	CarepackageKit_SRKit           = 3,
	CarepackageKit_MAX             = 4
};


// Enum TslGame.ETslGameOptionKeyBindingType
enum class ETslGameOptionKeyBindingType : uint8_t
{
	None                           = 0,
	Action                         = 1,
	Axis                           = 2,
	ETslGameOptionKeyBindingType_MAX = 3
};


// Enum TslGame.ETslGameOptionSupplementaryType
enum class ETslGameOptionSupplementaryType : uint8_t
{
	None                           = 0,
	KeyboardLayout                 = 1,
	PreviewImage                   = 2,
	PreviewCrosshair               = 3,
	VolumeUnitMeter                = 4,
	ETslGameOptionSupplementaryType_MAX = 5
};


// Enum TslGame.ENaviGamepadInputType
enum class ENaviGamepadInputType : uint8_t
{
	DPad_Pressed                   = 0,
	DPad_Released                  = 1,
	Axis                           = 2,
	Axis_Hold                      = 3,
	ENaviGamepadInputType_MAX      = 4
};


// Enum TslGame.ETslGMCommandInGameHelperButtonType
enum class ETslGMCommandInGameHelperButtonType : uint8_t
{
	NO_PARAM                       = 0,
	ONE_PARAM                      = 1,
	ETslGMCommandInGameHelperButtonType_MAX = 2
};


// Enum TslGame.EVendingMachineState
enum class EVendingMachineState : uint8_t
{
	ACTIVATED                      = 0,
	DEACTIVATED_TEMPORARILY_BY_PICK_DELAY = 1,
	DEACTIVATED_TEMPORARILY_BY_DAMAGE = 2,
	DEACTIVATED_TEMPORARILY_BY_JACKPOT = 3,
	DEACTIVATED_PERMANANTLY_BY_EXCEEDED_MAX_PICK_COUNT = 4,
	EVendingMachineState_MAX       = 5
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct TslGame.DeadPlayerRespawnInfo
// 0x0008
struct FDeadPlayerRespawnInfo
{
	class ATslWarPlayerState*                          PlayerState;                                              // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.TslWeaponAnimInfo
// 0x0020
struct FTslWeaponAnimInfo
{
	unsigned char                                      bIsArmed : 1;                                             // 0x0000(0x0001) (BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bIsGun : 1;                                               // 0x0000(0x0001) (BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bIsHipped : 1;                                            // 0x0000(0x0001) (BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	EWeaponClass                                       WeaponClass;                                              // 0x0004(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EWeaponClass                                       LobbyAnimationClass;                                      // 0x0005(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EThrownWeaponType                                  ThrownWeaponClass;                                        // 0x0006(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EAnimWeaponType                                    AnimWeaponType;                                           // 0x0007(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               GripBlendspace;                                           // 0x0008(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UBlendSpaceBase*                             LHGripBlendspace;                                         // 0x0010(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	int                                                GripTypeIndex;                                            // 0x0018(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.MatchStateTimestamp
// 0x0010
struct FMatchStateTimestamp
{
	struct FName                                       Name;                                                     // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              Timestamp;                                                // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.PlatoonSupportRequestManifestItem
// 0x0008
struct FPlatoonSupportRequestManifestItem
{
	bool                                               bEnable;                                                  // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              CooldownTime;                                             // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.PlatoonSupportRequestManifest
// 0x0018
struct FPlatoonSupportRequestManifest
{
	struct FPlatoonSupportRequestManifestItem          FireSupport;                                              // 0x0000(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FPlatoonSupportRequestManifestItem          WeaponPackage;                                            // 0x0008(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FPlatoonSupportRequestManifestItem          HealingPackage;                                           // 0x0010(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.TslPlayerMatchResultInfo
// 0x0048
struct FTslPlayerMatchResultInfo
{
	struct FString                                     PlayerName;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     FullPlayerName;                                           // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ClanName;                                                 // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                NumKills;                                                 // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Ranking;                                                  // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TeamId;                                                   // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NumStartTeamMember;                                       // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsZombie;                                                // 0x0040(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EOutGamePlatformProvider                           PlayerPlatform;                                           // 0x0041(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0042(0x0006) MISSED OFFSET
};

// ScriptStruct TslGame.RepItemLimits
// 0x0010
struct FRepItemLimits
{
	struct FName                                       ItemID;                                                   // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	int                                                Limits;                                                   // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.CustomWidgetSetting
// 0x0018
struct FCustomWidgetSetting
{
	bool                                               bInitialized;                                             // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	TArray<struct FString>                             Disabled;                                                 // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct TslGame.JukeBoxState
// 0x0003
struct FJukeBoxState
{
	bool                                               bPowerOn;                                                 // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsBroken;                                                // 0x0001(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsOpened;                                                // 0x0002(0x0001) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.TslActionInputCallbackConfig
// 0x0018
struct FTslActionInputCallbackConfig
{
	struct FName                                       ActionName;                                               // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       CallbackName;                                             // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bConsume;                                                 // 0x0010(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EInputEvent>                           InputEvent;                                               // 0x0011(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0012(0x0006) MISSED OFFSET
};

// ScriptStruct TslGame.TslAxisInputCallbackConfig
// 0x0020
struct FTslAxisInputCallbackConfig
{
	struct FName                                       AxisName;                                                 // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Scale;                                                    // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	struct FName                                       CallbackName;                                             // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bConsume;                                                 // 0x0018(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
};

// ScriptStruct TslGame.UmgWidgetBinder
// 0x0018
struct FUmgWidgetBinder
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	struct FName                                       Name;                                                     // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UUserWidget*                                 Parent;                                                   // 0x0010(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
};

// ScriptStruct TslGame.UmgWidgetBinder_Animation
// 0x0008 (0x0020 - 0x0018)
struct FUmgWidgetBinder_Animation : public FUmgWidgetBinder
{
	class UWidgetAnimation*                            CachedAnimation;                                          // 0x0018(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
};

// ScriptStruct TslGame.UmgWidgetBinder_Panel
// 0x0008 (0x0020 - 0x0018)
struct FUmgWidgetBinder_Panel : public FUmgWidgetBinder
{
	class UPanelWidget*                                CachedPanel;                                              // 0x0018(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
};

// ScriptStruct TslGame.UmgWidgetBinder_CanvasPanel
// 0x0008 (0x0028 - 0x0020)
struct FUmgWidgetBinder_CanvasPanel : public FUmgWidgetBinder_Panel
{
	class UCanvasPanel*                                CachedCanvasPanel;                                        // 0x0020(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
};

// ScriptStruct TslGame.UmgWidgetBinder_Gerneral
// 0x0008 (0x0020 - 0x0018)
struct FUmgWidgetBinder_Gerneral : public FUmgWidgetBinder
{
	class UWidget*                                     CachedWidget;                                             // 0x0018(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
};

// ScriptStruct TslGame.TslKeyHintData
// 0x0010
struct FTslKeyHintData
{
	EKeyHintType                                       KeyHintType;                                              // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                Priority;                                                 // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTslKeyHintChecker*                          KeyHintChecker;                                           // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.WeatherLevelInfo
// 0x0020
struct FWeatherLevelInfo
{
	struct FString                                     WeatherId;                                                // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	int                                                Weight;                                                   // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
	struct FName                                       WeatherLevel;                                             // 0x0018(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.LivingThingEvent
// 0x0018
struct FLivingThingEvent
{
	float                                              ServerTimeSeconds;                                        // 0x0000(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      EventID;                                                  // 0x0004(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	TArray<unsigned char>                              Params;                                                   // 0x0008(0x0010) (BlueprintVisible, ZeroConstructor)
};

// ScriptStruct TslGame.LivingThingStaticRepInfo
// 0x0018
struct FLivingThingStaticRepInfo
{
	int                                                NetGUID;                                                  // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              DestroyTimeSeconds;                                       // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	TArray<struct FLivingThingEvent>                   EventArray;                                               // 0x0008(0x0010) (ZeroConstructor)
};

// ScriptStruct TslGame.LivingThingVolumeInfo
// 0x0028
struct FLivingThingVolumeInfo
{
	class ATslLivingThingVolume*                       LivingThingVolume;                                        // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	int                                                StartNetGUID;                                             // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              SpawnTimeSeconds;                                         // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                GeneratedSpawnInfoIndex;                                  // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
	TArray<struct FLivingThingStaticRepInfo>           LivingThingStaticRepInfos;                                // 0x0018(0x0010) (ZeroConstructor)
};

// ScriptStruct TslGame.LivingThingInfo
// 0x0040
struct FLivingThingInfo
{
	int                                                NetGUID;                                                  // 0x0000(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SpawnTimeSeconds;                                         // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DestroyTimeSeconds;                                       // 0x0008(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     SpawnLocation;                                            // 0x000C(0x000C) (BlueprintVisible, IsPlainOldData)
	struct FRotator                                    SpawnRotation;                                            // 0x0018(0x000C) (BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
	class UClass*                                      ActorClass;                                               // 0x0028(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FLivingThingEvent>                   EventArray;                                               // 0x0030(0x0010) (BlueprintVisible, ZeroConstructor)
};

// ScriptStruct TslGame.LivingThingMassiveSpawnInfo
// 0x0050
struct FLivingThingMassiveSpawnInfo
{
	int                                                StartNetGUID;                                             // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SpawnTimeSeconds;                                         // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FVector>                             LivingThingLocations;                                     // 0x0008(0x0010) (Edit, ZeroConstructor)
	int                                                RandomRotationSeed;                                       // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	TArray<float>                                      LivingThingRotationYaw;                                   // 0x0020(0x0010) (Edit, ZeroConstructor)
	TArray<unsigned char>                              LivingThingClassIndecies;                                 // 0x0030(0x0010) (Edit, ZeroConstructor)
	TArray<class UClass*>                              LivingThingClasses;                                       // 0x0040(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct TslGame.LivingThingSpawnRatio
// 0x0010
struct FLivingThingSpawnRatio
{
	class UClass*                                      Class;                                                    // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Ratio;                                                    // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bOnlySpawnOnLandscape;                                    // 0x000C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
};

// ScriptStruct TslGame.TslInputKey
// 0x0020
struct FTslInputKey
{
	struct FKey                                        Key;                                                      // 0x0000(0x0018) (Edit, BlueprintVisible)
	unsigned char                                      bShift : 1;                                               // 0x0018(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bCtrl : 1;                                                // 0x0018(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bAlt : 1;                                                 // 0x0018(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
};

// ScriptStruct TslGame.CustomActionKeyData
// 0x0018
struct FCustomActionKeyData
{
	struct FName                                       ActionName;                                               // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<struct FTslInputKey>                        Keys;                                                     // 0x0008(0x0010) (ZeroConstructor)
};

// ScriptStruct TslGame.CustomAxisKeyData
// 0x0020
struct FCustomAxisKeyData
{
	struct FName                                       AxisName;                                                 // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              Scale;                                                    // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	TArray<struct FTslInputKey>                        Keys;                                                     // 0x0010(0x0010) (ZeroConstructor)
};

// ScriptStruct TslGame.CustomMouseSensitiveData
// 0x0010
struct FCustomMouseSensitiveData
{
	struct FName                                       MouseSensitiveName;                                       // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              MouseSensitivity;                                         // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LastConvertedMouseSensitivity;                            // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.CustomGamePadSensitiveData
// 0x0010
struct FCustomGamePadSensitiveData
{
	struct FName                                       GamePadSensitiveName;                                     // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              GamePadSensitivity;                                       // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LastConvertedGamePadSensitivity;                          // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.CustomSensitiveData
// 0x0010
struct FCustomSensitiveData
{
	struct FName                                       SensitiveName;                                            // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              Sensitivity;                                              // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LastConvertedSensitivity;                                 // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.CustomSensitiveDataArray
// 0x0010
struct FCustomSensitiveDataArray
{
	TArray<struct FCustomSensitiveData>                Array;                                                    // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct TslGame.CustomInputSettings
// 0x00D8
struct FCustomInputSettings
{
	TArray<struct FCustomActionKeyData>                ActionKeyList;                                            // 0x0000(0x0010) (ZeroConstructor, Config)
	TArray<struct FCustomAxisKeyData>                  AxisKeyList;                                              // 0x0010(0x0010) (ZeroConstructor, Config)
	bool                                               bIsUsingPerScopeMouseSensitivity;                         // 0x0020(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bIsUsingPerScopeGamepadSensitivity;                       // 0x0021(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0022(0x0006) MISSED OFFSET
	TArray<struct FCustomMouseSensitiveData>           MouseSensitiveList;                                       // 0x0028(0x0010) (ZeroConstructor, Config)
	TArray<struct FCustomGamePadSensitiveData>         GamePadSensitiveList;                                     // 0x0038(0x0010) (ZeroConstructor, Config)
	TMap<ETslControllerType, struct FCustomSensitiveDataArray> SensitiveMap;                                             // 0x0048(0x0050) (ZeroConstructor, Config)
	float                                              MouseVerticalSensitivityMultiplierAdjusted;               // 0x0098(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bInvertMouse;                                             // 0x009C(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bInvertGamePadY;                                          // 0x009D(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bInvertGamePadX;                                          // 0x009E(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x009F(0x0001) MISSED OFFSET
	float                                              GamePadDeadZone;                                          // 0x00A0(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              GamepadVerticalSensitivityMultiplier;                     // 0x00A4(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              StartRunningSensitivity;                                  // 0x00A8(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              GamePadDeadZone_Left;                                     // 0x00AC(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bEnableAimAccPad;                                         // 0x00B0(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData02[0x27];                                      // 0x00B1(0x0027) MISSED OFFSET
};

// ScriptStruct TslGame.TslPersistantData
// 0x01A0
struct FTslPersistantData
{
	struct FCustomInputSettings                        CustomInputSettings;                                      // 0x0000(0x00D8) (Config)
	bool                                               bUseForceFeedback;                                        // 0x00D8(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	EGamepadPresets                                    GamepadPresetType;                                        // 0x00D9(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x00DA(0x0002) MISSED OFFSET
	float                                              ForceFeedbackMultiplier;                                  // 0x00DC(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              FpsCameraFov;                                             // 0x00E0(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              Gamma;                                                    // 0x00E4(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bIsMasterSoundMute;                                       // 0x00E8(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bIsEffectSoundMute;                                       // 0x00E9(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bIsUISoundMute;                                           // 0x00EA(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bIsBGMSoundMute;                                          // 0x00EB(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bIsEnabledHrtfRemoteWeaponSound;                          // 0x00EC(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x00ED(0x0003) MISSED OFFSET
	struct FString                                     CultureName;                                              // 0x00F0(0x0010) (ZeroConstructor, Config)
	bool                                               bIconKillfeedEnabled;                                     // 0x0100(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0101(0x0003) MISSED OFFSET
	int                                                ColorBlindType;                                           // 0x0104(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	struct FString                                     CrosshairColorString;                                     // 0x0108(0x0010) (ZeroConstructor, Config)
	struct FColor                                      CustomCrosshairColor;                                     // 0x0118(0x0004) (Config, IsPlainOldData)
	bool                                               bUseKeyHint;                                              // 0x011C(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bShowNetworkInfo;                                         // 0x011D(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	ETppAimCameraPosition                              TppAimCamPosRecoveryType;                                 // 0x011E(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData03[0x1];                                       // 0x011F(0x0001) MISSED OFFSET
	float                                              ForwardRunningSensitivity;                                // 0x0120(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              MasterSoundVolume;                                        // 0x0124(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              EffectSoundVolume;                                        // 0x0128(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              UISoundVolume;                                            // 0x012C(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              BGMSoundVolume;                                           // 0x0130(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	EFiringMode                                        HGsFiringMode;                                            // 0x0134(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	EFiringMode                                        SMGsFiringMode;                                           // 0x0135(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	EFiringMode                                        ARsFiringMode;                                            // 0x0136(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	EFiringMode                                        DMRsFiringMode;                                           // 0x0137(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	EFiringMode                                        SecondarySMGsFiringMode;                                  // 0x0138(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	EFiringMode                                        SecondaryARsFiringMode;                                   // 0x0139(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bUseRes4K;                                                // 0x013A(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bAutoReloadOnOutOfAmmoFire;                               // 0x013B(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bShowCompassShade;                                        // 0x013C(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x013D(0x0003) MISSED OFFSET
	int                                                GamepadPresets;                                           // 0x0140(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               AutoEquipAttachment;                                      // 0x0144(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	EAutoEquipAttachmentForScopeMode                   AutoEquipAttachmentForScope;                              // 0x0145(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               AutoReplaceAttachment;                                    // 0x0146(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bEnableUniversalGamma;                                    // 0x0147(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	TMap<struct FString, float>                        GammasForMap;                                             // 0x0148(0x0050) (ZeroConstructor, Config)
	bool                                               bAutoWeaponSkinReplacement;                               // 0x0198(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bEnableRadioMessage;                                      // 0x0199(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bEnableCrossNetworkPlay;                                  // 0x019A(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	EContinuousHealItem                                ContinuousType;                                           // 0x019B(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	ERadioMessagePresets                               RadioMessagePreset;                                       // 0x019C(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bEnableRadioMessageQuickPing;                             // 0x019D(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bUseKillCam;                                              // 0x019E(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData05[0x1];                                       // 0x019F(0x0001) MISSED OFFSET
};

// ScriptStruct TslGame.TslMenuItemStyle
// 0x01B0 (0x01B8 - 0x0008)
struct FTslMenuItemStyle : public FSlateWidgetStyle
{
	struct FSlateBrush                                 BackgroundBrush;                                          // 0x0008(0x0090) (Edit)
	struct FSlateBrush                                 LeftArrowImage;                                           // 0x0098(0x0090) (Edit)
	struct FSlateBrush                                 RightArrowImage;                                          // 0x0128(0x0090) (Edit)
};

// ScriptStruct TslGame.TslMenuSoundsStyle
// 0x0030 (0x0038 - 0x0008)
struct FTslMenuSoundsStyle : public FSlateWidgetStyle
{
	struct FSlateSound                                 StartGameSound;                                           // 0x0008(0x0018) (Edit)
	struct FSlateSound                                 ExitGameSound;                                            // 0x0020(0x0018) (Edit)
};

// ScriptStruct TslGame.TslMenuStyle
// 0x0210 (0x0218 - 0x0008)
struct FTslMenuStyle : public FSlateWidgetStyle
{
	struct FSlateBrush                                 HeaderBackgroundBrush;                                    // 0x0008(0x0090) (Edit)
	struct FSlateBrush                                 LeftBackgroundBrush;                                      // 0x0098(0x0090) (Edit)
	struct FSlateBrush                                 RightBackgroundBrush;                                     // 0x0128(0x0090) (Edit)
	struct FSlateSound                                 MenuEnterSound;                                           // 0x01B8(0x0018) (Edit)
	struct FSlateSound                                 MenuBackSound;                                            // 0x01D0(0x0018) (Edit)
	struct FSlateSound                                 OptionChangeSound;                                        // 0x01E8(0x0018) (Edit)
	struct FSlateSound                                 MenuItemChangeSound;                                      // 0x0200(0x0018) (Edit)
};

// ScriptStruct TslGame.PrintStringParams
// 0x0018
struct FPrintStringParams
{
	struct FString                                     String;                                                   // 0x0000(0x0010) (ZeroConstructor)
	float                                              Duration;                                                 // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FColor                                      Color;                                                    // 0x0014(0x0004) (IsPlainOldData)
};

// ScriptStruct TslGame.Print3DStringParams
// 0x0010 (0x0028 - 0x0018)
struct FPrint3DStringParams : public FPrintStringParams
{
	struct FVector                                     TextLocation;                                             // 0x0018(0x000C) (IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.DrawSphereParams
// 0x001C
struct FDrawSphereParams
{
	struct FVector                                     Origin;                                                   // 0x0000(0x000C) (IsPlainOldData)
	float                                              Radius;                                                   // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FColor                                      Color;                                                    // 0x0010(0x0004) (IsPlainOldData)
	float                                              DrawTime;                                                 // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Width;                                                    // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.DrawLineParams
// 0x0024
struct FDrawLineParams
{
	struct FVector                                     Start;                                                    // 0x0000(0x000C) (IsPlainOldData)
	struct FVector                                     End;                                                      // 0x000C(0x000C) (IsPlainOldData)
	struct FColor                                      Color;                                                    // 0x0018(0x0004) (IsPlainOldData)
	float                                              DrawTime;                                                 // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Width;                                                    // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.DrawCapsuleParams
// 0x002C
struct FDrawCapsuleParams
{
	struct FVector                                     Origin;                                                   // 0x0000(0x000C) (IsPlainOldData)
	struct FRotator                                    Rotation;                                                 // 0x000C(0x000C) (IsPlainOldData)
	float                                              Radius;                                                   // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              HalfHeight;                                               // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FColor                                      Color;                                                    // 0x0020(0x0004) (IsPlainOldData)
	float                                              DrawTime;                                                 // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Width;                                                    // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.CustomAnimData
// 0x0088
struct FCustomAnimData
{
	TArray<class UAnimSequenceBase*>                   AnimSeqList;                                              // 0x0000(0x0010) (Edit, ZeroConstructor)
	struct FAlphaBlend                                 BlendIn;                                                  // 0x0010(0x0038) (Edit)
	struct FAlphaBlend                                 BlendOut;                                                 // 0x0048(0x0038) (Edit)
	float                                              PlayRate;                                                 // 0x0080(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	ECustomAnimSlotType                                SlotType;                                                 // 0x0084(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bPlayLowerBodyOnStand;                                    // 0x0085(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bAdjustPlayRate;                                          // 0x0086(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bLooping;                                                 // 0x0087(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.NpcMeleeAttackInfo
// 0x0040
struct FNpcMeleeAttackInfo
{
	struct FVector                                     RelativeLocation;                                         // 0x0000(0x000C) (Edit, IsPlainOldData)
	float                                              Radius;                                                   // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class UClass*                                      DamageTypeClass;                                          // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DamageCheckStartSeconds;                                  // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DamageAmount;                                             // 0x001C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FireDuration;                                             // 0x0020(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              OverrideMovingSpeed;                                      // 0x0024(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              OverrideMovingSpeedDuration;                              // 0x0028(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	class UCurveFloat*                                 OverrideMovingSpeedScaleCurve;                            // 0x0030(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	ENpcWalkingSpeedType                               MovingAttackType;                                         // 0x0038(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bIgnoreDamageAnim;                                        // 0x0039(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bSkipPhysicsRotation;                                     // 0x003A(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x5];                                       // 0x003B(0x0005) MISSED OFFSET
};

// ScriptStruct TslGame.NpcCustomAnimInfo
// 0x0090
struct FNpcCustomAnimInfo
{
	struct FCustomAnimData                             CustomAnimData;                                           // 0x0000(0x0088) (Transient)
	float                                              AnimDuration;                                             // 0x0088(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                AnimIndex;                                                // 0x008C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct TslGame.NPCDrawMovingInfo
// 0x001C
struct FNPCDrawMovingInfo
{
	struct FVector                                     ActorLocation;                                            // 0x0000(0x000C) (Transient, IsPlainOldData)
	struct FVector                                     MovingDir;                                                // 0x000C(0x000C) (Transient, IsPlainOldData)
	float                                              Speed;                                                    // 0x0018(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct TslGame.PoseSnapshotInfo
// 0x0010
struct FPoseSnapshotInfo
{
	struct FName                                       SnapshotName;                                             // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              BlendOutTime;                                             // 0x0008(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bActiveOnRendered;                                        // 0x000C(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
};

// ScriptStruct TslGame.NpcDamageProperties
// 0x0010
struct FNpcDamageProperties
{
	float                                              ImpulsePowerRatio;                                        // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              KnockbackSpeed;                                           // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              KnockbackDuration;                                        // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MultiplySpeedRatio;                                       // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.NpcRagdollProperties
// 0x0010
struct FNpcRagdollProperties
{
	float                                              LinearSpeedRatio;                                         // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              LinearZSpeedRatio;                                        // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ImpulsePowerRatio;                                        // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bTermBodyOnRagdoll;                                       // 0x000C(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
};

// ScriptStruct TslGame.NpcDamageZoneDesc
// 0x0118
struct FNpcDamageZoneDesc
{
	float                                              GlobalMultiplier;                                         // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TMap<struct FName, float>                          BonesMultipliers;                                         // 0x0008(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
	TMap<EWeaponClass, struct FNpcDamageProperties>    DamageProperties;                                         // 0x0058(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
	TMap<EWeaponClass, struct FNpcRagdollProperties>   RagdollProperties;                                        // 0x00A8(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              RagdollLinearSpeed;                                       // 0x00F8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RagdollLinearZSpeed;                                      // 0x00FC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RagdollImpulsePower;                                      // 0x0100(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RagdollImpulseDuration;                                   // 0x0104(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DamageImpulsePower;                                       // 0x0108(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DamageImpulseDuration;                                    // 0x010C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ImpulseWeight;                                            // 0x0110(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EDamageReason                                      DamageReason;                                             // 0x0114(0x0001) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               bUsingMovingSpeedOnRagdoll;                               // 0x0115(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0116(0x0002) MISSED OFFSET
};

// ScriptStruct TslGame.MatchPreparerClass
// 0x0010
struct FMatchPreparerClass
{
	EMatchStartType                                    Type;                                                     // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class UClass*                                      Class;                                                    // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.ModeStringParameter
// 0x0020
struct FModeStringParameter
{
	struct FString                                     Key;                                                      // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FString                                     Value;                                                    // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct TslGame.CustomGameUpdateCharacterInfo
// 0x000C
struct FCustomGameUpdateCharacterInfo
{
	float                                              ReviveCastingTime;                                        // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MultiplierGroggyDamagePerSecond;                          // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MultiplierPunchDamage;                                    // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.LimitCustomStringParameter
// 0x0018
struct FLimitCustomStringParameter
{
	struct FString                                     CustomStringParameter;                                    // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	float                                              MinLimit;                                                 // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MaxLimit;                                                 // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.RedZoneCustomOption
// 0x001C
struct FRedZoneCustomOption
{
	bool                                               bIsActive;                                                // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              MultiplierRedZoneExplosionDensity;                        // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MultiplierRedZoneStartTime;                               // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MultiplierRedZoneEndTime;                                 // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MultiplierRedZoneExplosionDelay;                          // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MultiplierRedZoneDuration;                                // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MultiplierRedZoneArea;                                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.BlackZoneCustomOption
// 0x0040
struct FBlackZoneCustomOption
{
	bool                                               bIsActive;                                                // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              PlayerNearBuildingMaxDamage;                              // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PlayerNearBuildingMaxDistance;                            // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              StrikeInnerRadius;                                        // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              StrikeMidRadius;                                          // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              StrikeOuterRadius;                                        // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              StartDelay;                                               // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              StandbyDelay;                                             // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RequestedStandbyDelay;                                    // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              BombingDelay;                                             // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MaxMidCount;                                              // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MaxFarCount;                                              // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MinimumBuildingsToDestroy;                                // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   BombingInterval;                                          // 0x0034(0x0008) (Edit, BlueprintVisible, IsPlainOldData)
	bool                                               bUseBlackZoneCurves;                                      // 0x003C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x003D(0x0003) MISSED OFFSET
};

// ScriptStruct TslGame.BlueZoneCustomOption
// 0x0024
struct FBlueZoneCustomOption
{
	int                                                PhaseNum;                                                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              StartDelay;                                               // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              WarningDuration;                                          // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ReleaseDuration;                                          // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PoisonGasDamagePerSecond;                                 // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RadiusRate;                                               // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SpreadRatio;                                              // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LandRatio;                                                // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                CircleAlgorithm;                                          // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.PlayerStartsUserCount
// 0x0010
struct FPlayerStartsUserCount
{
	int                                                PlayerCount;                                              // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	class ATslPlayerStart*                             PlayerStart;                                              // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.RankingInfo
// 0x0018
struct FRankingInfo
{
	int                                                TeamId;                                                   // 0x0000(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                Ranking;                                                  // 0x0004(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                IncreaseRanking;                                          // 0x0008(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                Score;                                                    // 0x000C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                Order;                                                    // 0x0010(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsTeamElimination;                                       // 0x0014(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsConnection;                                            // 0x0015(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0016(0x0002) MISSED OFFSET
};

// ScriptStruct TslGame.PointInfo
// 0x0008
struct FPointInfo
{
	int                                                TeamCount;                                                // 0x0000(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                RoundPoint;                                               // 0x0004(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct TslGame.Teams
// 0x0018
struct FTeams
{
	int                                                TeamNum;                                                  // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TArray<class ATeam*>                               Members;                                                  // 0x0008(0x0010) (ZeroConstructor)
};

// ScriptStruct TslGame.WuLogPlayerRating
// 0x0018
struct FWuLogPlayerRating
{
	struct FString                                     AccountId;                                                // 0x0000(0x0010) (ZeroConstructor)
	int                                                Rating;                                                   // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.WuLogMatchRating
// 0x0010 (0x0070 - 0x0060)
struct FWuLogMatchRating : public FLogBase
{
	TArray<struct FWuLogPlayerRating>                  PlayerRatings;                                            // 0x0060(0x0010) (ZeroConstructor)
};

// ScriptStruct TslGame.NpcItemSet
// 0x0020
struct FNpcItemSet
{
	TArray<class UClass*>                              ItemBpArray;                                              // 0x0000(0x0010) (Edit, ZeroConstructor)
	TArray<struct FName>                               ItemIDs;                                                  // 0x0010(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct TslGame.NpcInfo
// 0x0030
struct FNpcInfo
{
	class UClass*                                      Pawn;                                                     // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UClass*                                      Controller;                                               // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UBehaviorTree*                               BehaviorTree;                                             // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FNpcItemSet>                         ItemSetArray;                                             // 0x0018(0x0010) (Edit, ZeroConstructor)
	bool                                               bRandomItemSet;                                           // 0x0028(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
};

// ScriptStruct TslGame.AISpawnParameterInfo
// 0x002C
struct FAISpawnParameterInfo
{
	int                                                NpcType;                                                  // 0x0000(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     Location;                                                 // 0x0004(0x000C) (Transient, IsPlainOldData)
	struct FRotator                                    Rotation;                                                 // 0x0010(0x000C) (Transient, IsPlainOldData)
	int                                                Count;                                                    // 0x001C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	TWeakObjectPtr<class UObject>                      Instigator;                                               // 0x0020(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bRadnomNavSpawn;                                          // 0x0028(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0029(0x0003) MISSED OFFSET
};

// ScriptStruct TslGame.UmgWidgetBinder_WidgetSwitcher
// 0x0008 (0x0028 - 0x0020)
struct FUmgWidgetBinder_WidgetSwitcher : public FUmgWidgetBinder_Panel
{
	class UWidgetSwitcher*                             CachedWidgetSwitcher;                                     // 0x0020(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
};

// ScriptStruct TslGame.UmgWidgetBinder_SizeBox
// 0x0008 (0x0028 - 0x0020)
struct FUmgWidgetBinder_SizeBox : public FUmgWidgetBinder_Panel
{
	class USizeBox*                                    CachedSizeBox;                                            // 0x0020(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
};

// ScriptStruct TslGame.ObserverHudAnimData
// 0x0050
struct FObserverHudAnimData
{
	EObserverHudAnimType                               AnimType;                                                 // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                EliminatorTeamNum;                                        // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                EliminatedTeamNum;                                        // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	struct FString                                     KillingSpreePlayerName;                                   // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     KillingSpreeClanName;                                     // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     KillingSpreeTeamName;                                     // 0x0030(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                KillingSpreeTeamNum;                                      // 0x0040(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                KillingSpreeKillCount;                                    // 0x0044(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	EOutGamePlatformProvider                           KillingSpreePlayerPlatform;                               // 0x0048(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0049(0x0007) MISSED OFFSET
};

// ScriptStruct TslGame.UmgWidgetBinder_Border
// 0x0010 (0x0030 - 0x0020)
struct FUmgWidgetBinder_Border : public FUmgWidgetBinder_Panel
{
	class UBorder*                                     CachedBorder;                                             // 0x0020(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UMaterialInstanceDynamic*                    CachedMaterial;                                           // 0x0028(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct TslGame.OptionContentDesc
// 0x0068
struct FOptionContentDesc
{
	struct FName                                       OptionName;                                               // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FText                                       DisplayName;                                              // 0x0008(0x0018) (Edit)
	struct FText                                       DescText;                                                 // 0x0020(0x0018) (Edit)
	EOptionExposeType                                  ExposeType;                                               // 0x0038(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bIsStepper;                                               // 0x0039(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x003A(0x0006) MISSED OFFSET
	TArray<struct FText>                               StepperContents;                                          // 0x0040(0x0010) (Edit, ZeroConstructor)
	int                                                StepperDefaultIndex;                                      // 0x0050(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bIsSlider;                                                // 0x0054(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0055(0x0003) MISSED OFFSET
	float                                              SliderMin;                                                // 0x0058(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SliderMax;                                                // 0x005C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SliderDefaultValue;                                       // 0x0060(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bIsSeparator;                                             // 0x0064(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bIsPalette;                                               // 0x0065(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x0066(0x0002) MISSED OFFSET
};

// ScriptStruct TslGame.ParticleParameter
// 0x0018
struct FParticleParameter
{
	struct FName                                       Name;                                                     // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     Value;                                                    // 0x0008(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	bool                                               bEnableRTPC;                                              // 0x0014(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
};

// ScriptStruct TslGame.TslActorPool
// 0x0010
struct FTslActorPool
{
	TArray<class AActor*>                              ActorPoolList;                                            // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct TslGame.TslParticleGroupInfo
// 0x0090
struct FTslParticleGroupInfo
{
	struct FName                                       GroupName;                                                // 0x0000(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	ETslParticleGroupPriority                          GroupPriority;                                            // 0x0008(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	int                                                MaxObjectCount;                                           // 0x000C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	ETslParticleCullType                               CullType;                                                 // 0x0010(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	float                                              MaxDistance;                                              // 0x0014(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxRenderDuration;                                        // 0x0018(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MaxSameTransformCount;                                    // 0x001C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MaxNearbyTransformCount;                                  // 0x0020(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6C];                                      // 0x0024(0x006C) MISSED OFFSET
};

// ScriptStruct TslGame.MapMarker
// 0x0010
struct FMapMarker
{
	bool                                               Show;                                                     // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FVector2D                                   MarkerPosition;                                           // 0x0004(0x0008) (BlueprintVisible, IsPlainOldData)
	EMarkerType                                        MarkerType;                                               // 0x000C(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
};

// ScriptStruct TslGame.PlatoonInfo
// 0x0030
struct FPlatoonInfo
{
	class ATslPlayerState*                             Commander;                                                // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FMapMarker                                  MapMarker;                                                // 0x0008(0x0010)
	class ATslPlatoonFireSupportController*            FireSupportController;                                    // 0x0018(0x0008) (ZeroConstructor, IsPlainOldData)
	class UTslPlatoonCarePackageRequestHandler*        WeaponPackageRequestHandler;                              // 0x0020(0x0008) (ZeroConstructor, IsPlainOldData)
	class UTslPlatoonCarePackageRequestHandler*        HealingPackageRequestHandler;                             // 0x0028(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.TslPlatoonSupportCommonData
// 0x0020
struct FTslPlatoonSupportCommonData
{
	EPlatoonSupportRequestType                         Type;                                                     // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FStringClassReference                       HandlerClassRef;                                          // 0x0008(0x0010) (Edit, DisableEditOnInstance)
	bool                                               bInstantReady;                                            // 0x0018(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
};

// ScriptStruct TslGame.WuStringBoolPair
// 0x0018
struct FWuStringBoolPair
{
	struct FString                                     First;                                                    // 0x0000(0x0010) (ZeroConstructor)
	bool                                               second;                                                   // 0x0010(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0011(0x0007) MISSED OFFSET
};

// ScriptStruct TslGame.WuStringFloatPair
// 0x0018
struct FWuStringFloatPair
{
	struct FString                                     First;                                                    // 0x0000(0x0010) (ZeroConstructor)
	float                                              second;                                                   // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.WuStringStringPair
// 0x0020
struct FWuStringStringPair
{
	struct FString                                     First;                                                    // 0x0000(0x0010) (ZeroConstructor)
	struct FString                                     second;                                                   // 0x0010(0x0010) (ZeroConstructor)
};

// ScriptStruct TslGame.WuCharacterCustomizationOptions
// 0x0050
struct FWuCharacterCustomizationOptions
{
	TArray<struct FWuStringBoolPair>                   BoolOptions;                                              // 0x0000(0x0010) (ZeroConstructor)
	TArray<struct FWuStringFloatPair>                  FloatOptions;                                             // 0x0010(0x0010) (ZeroConstructor)
	TArray<struct FWuStringStringPair>                 StringOptions;                                            // 0x0020(0x0010) (ZeroConstructor)
	TArray<struct FString>                             ItemIDs;                                                  // 0x0030(0x0010) (ZeroConstructor)
	struct FString                                     Emotes;                                                   // 0x0040(0x0010) (ZeroConstructor)
};

// ScriptStruct TslGame.PlayerDamageZoneDesc
// 0x00B0
struct FPlayerDamageZoneDesc
{
	float                                              GlobalMultiplier;                                         // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TMap<struct FName, float>                          BonesMultipliers;                                         // 0x0008(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
	TMap<EWeaponClass, float>                          WeaponClassMultipliers;                                   // 0x0058(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              PunchMultiplier;                                          // 0x00A8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EEquipSlotID                                       ArmorSlot;                                                // 0x00AC(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EDamageReason                                      DamageReason;                                             // 0x00AD(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x00AE(0x0002) MISSED OFFSET
};

// ScriptStruct TslGame.TslPlayerStatistics
// 0x0004
struct FTslPlayerStatistics
{
	int                                                NumKills;                                                 // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.ReplicatedCastableItem
// 0x0010
struct FReplicatedCastableItem
{
	struct FName                                       ItemID;                                                   // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	ECastableItemType                                  ItemType;                                                 // 0x0008(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	int                                                ItemCount;                                                // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.TslPlayerStatisticsForOwner
// 0x0010
struct FTslPlayerStatisticsForOwner
{
	float                                              TotalMovedDistanceMeter;                                  // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              TotalGivenDamages;                                        // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LongestDistanceKill;                                      // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                HeadShots;                                                // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.MapWayPoint
// 0x0018
struct FMapWayPoint
{
	bool                                               bSpawnWayPoint;                                           // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bShowWayPoint_PS;                                         // 0x0001(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0002(0x0002) MISSED OFFSET
	int                                                MaxWayPointNum_PS;                                        // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FVector2D>                           WayPointPosArr_PS;                                        // 0x0008(0x0010) (BlueprintVisible, ZeroConstructor)
};

// ScriptStruct TslGame.ReplicatedThrowableItem
// 0x0010
struct FReplicatedThrowableItem
{
	class UClass*                                      ThrowableWeaponClass;                                     // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	int                                                ItemCount;                                                // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.ReplicatedEquipableItem
// 0x0018
struct FReplicatedEquipableItem
{
	struct FName                                       ItemID;                                                   // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              Durability;                                               // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Space;                                                    // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              MaxSpace;                                                 // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.EmoteBitArray
// 0x0020
struct FEmoteBitArray
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct TslGame.OptionSyncData
// 0x0005
struct FOptionSyncData
{
	bool                                               bAutoEquipAttachment;                                     // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bAutoEquipAttachmentFromInventory;                        // 0x0001(0x0001) (ZeroConstructor, IsPlainOldData)
	EAutoEquipAttachmentForScopeMode                   AutoEquipAttachmentForScope;                              // 0x0002(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bAutoReplaceAttachment;                                   // 0x0003(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bAutoWeaponSkinReplacement;                               // 0x0004(0x0001) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.PlayerHitInfo
// 0x000C
struct FPlayerHitInfo
{
	int                                                Hits;                                                     // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Damages;                                                  // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Kills;                                                    // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.PlayerAttackInfo
// 0x0058
struct FPlayerAttackInfo
{
	int                                                Shots;                                                    // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TMap<EDamageReason, struct FPlayerHitInfo>         HitInfoMap;                                               // 0x0008(0x0050) (ZeroConstructor)
};

// ScriptStruct TslGame.TslPlayerStatisticsNotReplicated
// 0x0118
struct FTslPlayerStatisticsNotReplicated
{
	float                                              MovedDistanceOnFeetMeter;                                 // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              MovedDistanceOnSwimMeter;                                 // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              MovedDistanceOnVehicleMeter;                              // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              MovedDistanceOnParchuteMeter;                             // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              MovedDistanceOnFreefallMeter;                             // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                NumAssistToRevive;                                        // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                NumGunShots;                                              // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                NumGunShotHits;                                           // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	TMap<struct FString, struct FPlayerAttackInfo>     AttacksGivenInfos;                                        // 0x0020(0x0050) (ZeroConstructor)
	TMap<struct FString, struct FPlayerAttackInfo>     AttacksTakenInfos;                                        // 0x0070(0x0050) (ZeroConstructor)
	float                                              DamageDealtOnEnemy;                                       // 0x00C0(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00C4(0x0004) MISSED OFFSET
	TMap<struct FString, int>                          WeaponFireCounts;                                         // 0x00C8(0x0050) (ZeroConstructor)
};

// ScriptStruct TslGame.TslPlayTime
// 0x0010
struct FTslPlayTime
{
	float                                              SurvivalTimeStart;                                        // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              TeamSpectatingTimeStart;                                  // 0x0004(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              SurvivalTimeAccumulated;                                  // 0x0008(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              TeamSpectatingTimeAccumulated;                            // 0x000C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.TslPerUserBpRewardRuleData
// 0x000C
struct FTslPerUserBpRewardRuleData
{
	float                                              AntiAddictionSystemFactor;                                // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              BpBoost;                                                  // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              bIsBpGrinder;                                             // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.TslPerUserXpRewardRuleData
// 0x0014
struct FTslPerUserXpRewardRuleData
{
	bool                                               bIsMaxLevel;                                              // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              CurrDailyXp;                                              // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              MaxDailyXp;                                               // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              XpMultiplier;                                             // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              bIsXpGrinder;                                             // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.TslBpRewardDetail_Public
// 0x0014
struct FTslBpRewardDetail_Public
{
	float                                              ByPlayTime;                                               // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              ByRanking;                                                // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              ByKills;                                                  // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              ByDamageDealt;                                            // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              BoostAmount;                                              // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.TslXpRewardDetail_Public
// 0x0010
struct FTslXpRewardDetail_Public
{
	float                                              BySurvivalTime;                                           // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              ByTeamSpectatingTime;                                     // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              BoostAmount;                                              // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              ExcessAmount;                                             // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.StatTrakData
// 0x0004
struct FStatTrakData
{
	int                                                NumKills;                                                 // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct TslGame.StatTrakDataPair
// 0x0018
struct FStatTrakDataPair
{
	struct FString                                     Key;                                                      // 0x0000(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient)
	struct FStatTrakData                               BeginStatTrakData;                                        // 0x0010(0x0004) (BlueprintVisible, BlueprintReadOnly, Transient)
	struct FStatTrakData                               CountStatTrakData;                                        // 0x0014(0x0004) (BlueprintVisible, BlueprintReadOnly, Transient)
};

// ScriptStruct TslGame.StatTrakManager
// 0x0020
struct FStatTrakManager
{
	TArray<struct FStatTrakDataPair>                   StatTrakDataPairs;                                        // 0x0000(0x0010) (ZeroConstructor)
	struct FScriptMulticastDelegate                    OnStatTrakDataUpdated;                                    // 0x0010(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
};

// ScriptStruct TslGame.WuStringIntPair
// 0x0018
struct FWuStringIntPair
{
	struct FString                                     First;                                                    // 0x0000(0x0010) (ZeroConstructor)
	int                                                second;                                                   // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.WuMissionProgressUpdateData
// 0x0010
struct FWuMissionProgressUpdateData
{
	TArray<struct FWuStringIntPair>                    Updates;                                                  // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct TslGame.PersonalStat
// 0x0038
struct FPersonalStat
{
	TArray<int>                                        Kills;                                                    // 0x0000(0x0010) (ZeroConstructor)
	int                                                Death;                                                    // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Assist;                                                   // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                RoundWin;                                                 // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                RoundLoss;                                                // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                MatchWin;                                                 // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                MatchLoss;                                                // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LastUpdateTime;                                           // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x002C(0x000C) MISSED OFFSET
};

// ScriptStruct TslGame.TslWidgetConfig
// 0x0030
struct FTslWidgetConfig
{
	struct FStringAssetReference                       WidgetClassReference;                                     // 0x0000(0x0010) (Edit, BlueprintVisible)
	bool                                               bDefaultShow;                                             // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseMouse;                                                // 0x0011(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bCloseByEscape;                                           // 0x0012(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bRemovedByHiding;                                         // 0x0013(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ZOrder;                                                   // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUsePcOnly;                                               // 0x0018(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseConsoleOnly;                                          // 0x0019(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bCharacterHudUi;                                          // 0x001A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bSpectatorHudUi;                                          // 0x001B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bObserverHudUi;                                           // 0x001C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bReplayHudUi;                                             // 0x001D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bLeagueReplayHudUi;                                       // 0x001E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	ETslWidgetCreationMethod                           WidgetCreationMethod;                                     // 0x001F(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FString>                             HideWidgetList;                                           // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct TslGame.HudUiConfig
// 0x0040
struct FHudUiConfig
{
	struct FString                                     WidgetName;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FTslWidgetConfig                            WidgetConfig;                                             // 0x0010(0x0030) (Edit, BlueprintVisible)
};

// ScriptStruct TslGame.GameModeAliasAndReferencePair
// 0x0018
struct FGameModeAliasAndReferencePair
{
	struct FName                                       GameModeAlias;                                            // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FStringAssetReference                       Reference;                                                // 0x0008(0x0010) (Edit, BlueprintVisible)
};

// ScriptStruct TslGame.ModeUIConfig
// 0x0020
struct FModeUIConfig
{
	struct FString                                     WidgetName;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FGameModeAliasAndReferencePair>      AlternativeWidgets;                                       // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct TslGame.TslLobbySceneTravelData
// 0x0008 (0x0010 - 0x0008)
struct FTslLobbySceneTravelData : public FTableRowBase
{
	class UClass*                                      LobbySceneTravelClass;                                    // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.TslBaseLobbySceneData
// 0x0030 (0x0038 - 0x0008)
struct FTslBaseLobbySceneData : public FTableRowBase
{
	struct FName                                       SceneCameraTag;                                           // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       SceneLevelName;                                           // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	ELobbyCharacterAnimationType                       LobbyCharacterAnimationType;                              // 0x0018(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bHideMainLobbyCharacter;                                  // 0x0019(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bHideOtherLobbyCharacter;                                 // 0x001A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bHideWeaponMasteryObjects;                                // 0x001B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bHideSurvivalMasteryObjects;                              // 0x001C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	ELobbyBlurChangingStates                           LobbyBlurChangingStates;                                  // 0x001D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bShowUmgBlur;                                             // 0x001E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bHideDefaultParticle;                                     // 0x001F(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TArray<struct FName>                               ShowParticleTags;                                         // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	bool                                               bCachePreviousSceneName;                                  // 0x0030(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bUseOutgameVisibilityValue;                               // 0x0031(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bCanTargetObjectRotation;                                 // 0x0032(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bNeedToSpawnOnGround;                                     // 0x0033(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.TslLobbySceneData
// 0x0010 (0x0048 - 0x0038)
struct FTslLobbySceneData : public FTslBaseLobbySceneData
{
	TArray<struct FName>                               LobbyCharacterPivotTags;                                  // 0x0038(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct TslGame.TargetObjectRatationRange
// 0x0010
struct FTargetObjectRatationRange
{
	struct FFloatInterval                              PitchRange;                                               // 0x0000(0x0008) (Edit, BlueprintVisible)
	struct FFloatInterval                              RollRange;                                                // 0x0008(0x0008) (Edit, BlueprintVisible)
};

// ScriptStruct TslGame.TslLobbyViewModeSceneData
// 0x0128 (0x0160 - 0x0038)
struct FTslLobbyViewModeSceneData : public FTslBaseLobbySceneData
{
	TMap<EViewModeCategory, struct FName>              ViewModePivots;                                           // 0x0038(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	TMap<ELobbyCharacterCameraType, struct FName>      LobbyCharacterCameras;                                    // 0x0088(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<EViewModeCategory>                          DisableScaleList;                                         // 0x00D8(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<EViewModeCategory>                          DisableYAxisList;                                         // 0x00E8(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<EViewModeCategory>                          DisableRotationRollbackList;                              // 0x00F8(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TMap<EViewModeCategory, struct FTargetObjectRatationRange> TargetObjectRatationRanges;                               // 0x0108(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	struct FVector2D                                   LoadingSpinnerOffset;                                     // 0x0158(0x0008) (Edit, BlueprintVisible, IsPlainOldData)
};

// ScriptStruct TslGame.TslGameOptionTargetInputMethodInfo
// 0x0002
struct FTslGameOptionTargetInputMethodInfo
{
	bool                                               bKeyboardMouse;                                           // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bGamepad;                                                 // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.TslGameOptionDescriptor
// 0x0028
struct FTslGameOptionDescriptor
{
	int                                                Index;                                                    // 0x0000(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FText                                       DisplayNameText;                                          // 0x0008(0x0018) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTslGameOptionTargetInputMethodInfo         TargetInputMethod;                                        // 0x0020(0x0002) (Edit, BlueprintVisible, DisableEditOnInstance)
	unsigned char                                      UnknownData01[0x6];                                       // 0x0022(0x0006) MISSED OFFSET
};

// ScriptStruct TslGame.TslGameOptionTabDesc
// 0x0008 (0x0030 - 0x0028)
struct FTslGameOptionTabDesc : public FTslGameOptionDescriptor
{
	struct FName                                       TabName;                                                  // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.TslGameOptionTargetHudInfo
// 0x0002
struct FTslGameOptionTargetHudInfo
{
	bool                                               bVisibleInLobby;                                          // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bVisibleInGame;                                           // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.TslGameOptionCategoryDesc
// 0x0018 (0x0040 - 0x0028)
struct FTslGameOptionCategoryDesc : public FTslGameOptionDescriptor
{
	struct FName                                       TabName;                                                  // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       CategoryName;                                             // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FTslGameOptionTargetHudInfo                 TargetHud;                                                // 0x0038(0x0002) (Edit, BlueprintVisible, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x6];                                       // 0x003A(0x0006) MISSED OFFSET
};

// ScriptStruct TslGame.TslGameOptionDuplicateProhibitedKeyBinderData
// 0x0018
struct FTslGameOptionDuplicateProhibitedKeyBinderData
{
	struct FName                                       DuplicateProhibitedTabName;                               // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       DuplicateProhibitedCategoryName;                          // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       DuplicateProhibitedItemName;                              // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.TslGameOptionKeyBindingDesc
// 0x0038
struct FTslGameOptionKeyBindingDesc
{
	ETslGameOptionKeyBindingType                       Type;                                                     // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FName                                       InputName;                                                // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              InputAxisScale;                                           // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
	TArray<struct FKey>                                ForbiddenKeys;                                            // 0x0018(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FTslGameOptionDuplicateProhibitedKeyBinderData> DuplicateProhibitionData;                                 // 0x0028(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct TslGame.TslGameOptionItemDesc
// 0x00A0 (0x00C8 - 0x0028)
struct FTslGameOptionItemDesc : public FTslGameOptionDescriptor
{
	struct FName                                       TabName;                                                  // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       CategoryName;                                             // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       ItemName;                                                 // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FTslGameOptionTargetHudInfo                 TargetHud;                                                // 0x0040(0x0002) (Edit, BlueprintVisible, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0042(0x0006) MISSED OFFSET
	class UClass*                                      ItemWidgetClass;                                          // 0x0048(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      ItemFunctionImplementationClass;                          // 0x0050(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	ETslGameOptionSupplementaryType                    SupplementaryWidgetType;                                  // 0x0058(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0059(0x0007) MISSED OFFSET
	struct FText                                       DescriptionText;                                          // 0x0060(0x0018) (Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                               bIsCloudOption;                                           // 0x0078(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseIndentation;                                          // 0x0079(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6];                                       // 0x007A(0x0006) MISSED OFFSET
	struct FTslGameOptionKeyBindingDesc                KeyBindingDesc;                                           // 0x0080(0x0038) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FString                                     AdditionalInitParameter;                                  // 0x00B8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct TslGame.TslGameOptionCategoryInfo
// 0x0050
struct FTslGameOptionCategoryInfo
{
	struct FTslGameOptionCategoryDesc                  CategoryDesc;                                             // 0x0000(0x0040) (BlueprintVisible, BlueprintReadOnly)
	TArray<struct FTslGameOptionItemDesc>              Items;                                                    // 0x0040(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct TslGame.TslGameOptionTabInfo
// 0x0040
struct FTslGameOptionTabInfo
{
	struct FTslGameOptionTabDesc                       TabDesc;                                                  // 0x0000(0x0030) (BlueprintVisible, BlueprintReadOnly)
	TArray<struct FTslGameOptionCategoryInfo>          Categories;                                               // 0x0030(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct TslGame.TslGameOptionHierarchy
// 0x0010
struct FTslGameOptionHierarchy
{
	TArray<struct FTslGameOptionTabInfo>               Hierarchy;                                                // 0x0000(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct TslGame.ScreenResolution
// 0x0008
struct FScreenResolution
{
	int                                                Width;                                                    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Height;                                                   // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.ExplosionTracer
// 0x0040
struct FExplosionTracer
{
	bool                                               bEnabled;                                                 // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	TArray<struct FVector2D>                           StandingTraceTargets;                                     // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FVector2D>                           CrouchTraceTargets;                                       // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FVector>                             ProneTraceTargets;                                        // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                              ProxyTraceMaxLenght;                                      // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ProxyTraceMinLenght;                                      // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.ProjectileData
// 0x00C0
struct FProjectileData
{
	float                                              ProjectileLife;                                           // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                ExplosionDamage;                                          // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ExplosionRadius;                                          // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	class UCurveFloat*                                 DamageCurve;                                              // 0x0010(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UCurveFloat*                                 DistanceCurveCurveVertical;                               // 0x0018(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinImpactVelocityForSound;                                // 0x0020(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TimeBetweenImpactSound;                                   // 0x0024(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      DamageType;                                               // 0x0028(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                VerticalSurfaceImpactLimit;                               // 0x0030(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AbsPitchLimitForVerticalSurface;                          // 0x0034(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WaterHit_VelocityScalar;                                  // 0x0038(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WaterHit_GravityScalar;                                   // 0x003C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      DestroyAtExplosion : 1;                                   // 0x0040(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bIgnoreVerticalSurfaces : 1;                              // 0x0040(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bExplodeOnDamage : 1;                                     // 0x0040(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0041(0x0007) MISSED OFFSET
	TArray<EDamageTypeCategory>                        ExplodeFromDamageTypes;                                   // 0x0048(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<EDamageTypeCategory>                        DestroyFromDamageTypes;                                   // 0x0058(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	bool                                               bDamageCheckThroughWalls;                                 // 0x0068(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bAttachToHitActor;                                        // 0x0069(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x006A(0x0002) MISSED OFFSET
	float                                              ExplosionUpVectorOffset;                                  // 0x006C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<TEnumAsByte<EPhysicalSurface>>              AttachToPhysicalMaterials;                                // 0x0070(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	bool                                               ApplyHorizontalVerticalDamageSeperately;                  // 0x0080(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bShouldCheckMovementBase;                                 // 0x0081(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDebugDestroyedWall;                                      // 0x0082(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x1];                                       // 0x0083(0x0001) MISSED OFFSET
	float                                              AttachedRepDistance;                                      // 0x0084(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AttachedRepDistanceConsole;                               // 0x0088(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x008C(0x0004) MISSED OFFSET
	class UTexture*                                    DamageCauserIcon;                                         // 0x0090(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DamageIconRatio;                                          // 0x0098(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x4];                                       // 0x009C(0x0004) MISSED OFFSET
	struct FText                                       DamageCauserItemName;                                     // 0x00A0(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	EWeaponClass                                       DamageCauserClass;                                        // 0x00B8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bExplodeOnBreachable;                                     // 0x00B9(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bCanDestroyBuildings;                                     // 0x00BA(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x5];                                       // 0x00BB(0x0005) MISSED OFFSET
};

// ScriptStruct TslGame.SegmentPoint
// 0x0018
struct FSegmentPoint
{
	struct FVector                                     Location;                                                 // 0x0000(0x000C) (IsPlainOldData)
	struct FVector                                     Normal;                                                   // 0x000C(0x000C) (IsPlainOldData)
};

// ScriptStruct TslGame.SimpleCollisionEvent
// 0x0010
struct FSimpleCollisionEvent
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct TslGame.ProjectileConfig
// 0x00F0
struct FProjectileConfig
{
	bool                                               bExplodeOnImpact;                                         // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                ExplosionDamage;                                          // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ExplosionRadius;                                          // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	class UCurveFloat*                                 DamageCurve;                                              // 0x0010(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      DamageType;                                               // 0x0018(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      ExplosionTemplate;                                        // 0x0020(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      ExplosionTemplateInAir;                                   // 0x0028(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      ExplosionTemplateWater;                                   // 0x0030(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                ExplosionDamageVehicleArmorPenetration;                   // 0x0038(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
	class UClass*                                      DamageTypeVehicleArmorPenetration;                        // 0x0040(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UCurveFloat*                                 PenetrationDamageCurve;                                   // 0x0048(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PenetrationExplosionRadius;                               // 0x0050(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PenetrationExplosionDamage;                               // 0x0054(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      ExplosionTemplatePenetration;                             // 0x0058(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture*                                    DamageCauserIcon;                                         // 0x0060(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DamageIconRatio;                                          // 0x0068(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x006C(0x0004) MISSED OFFSET
	struct FText                                       DamageCauserItemName;                                     // 0x0070(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	EWeaponClass                                       DamageCauserClass;                                        // 0x0088(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0089(0x0003) MISSED OFFSET
	float                                              ConeShapeDamageMultiplier;                                // 0x008C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bExplodeOnDamage : 1;                                     // 0x0090(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData05[0x3];                                       // 0x0091(0x0003) MISSED OFFSET
	float                                              RotationSpeed;                                            // 0x0094(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FExplosionTracer                            ExplosionTracer;                                          // 0x0098(0x0040) (Edit, DisableEditOnInstance)
	bool                                               bShouldPenetrate;                                         // 0x00D8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x3];                                       // 0x00D9(0x0003) MISSED OFFSET
	float                                              PenetrationDepth;                                         // 0x00DC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PostExplodeLifetime;                                      // 0x00E0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TrailPostExplodeLifetime;                                 // 0x00E4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bCanDestroyBuildings;                                     // 0x00E8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData07[0x7];                                       // 0x00E9(0x0007) MISSED OFFSET
};

// ScriptStruct TslGame.TslRadioChannelInfo
// 0x0010
struct FTslRadioChannelInfo
{
	class UAkAudioEvent*                               AudioEvent;                                               // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TotPlayTime;                                              // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.TslRailNode
// 0x0028
struct FTslRailNode
{
	struct FName                                       SplineName;                                               // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 MoveCurve;                                                // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bInverseMove;                                             // 0x0010(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x17];                                      // 0x0011(0x0017) MISSED OFFSET
};

// ScriptStruct TslGame.DoorBreakingState
// 0x0001
struct FDoorBreakingState
{
	unsigned char                                      bIsBrokenTop : 1;                                         // 0x0000(0x0001)
	unsigned char                                      bIsBrokenCenter : 1;                                      // 0x0000(0x0001)
	unsigned char                                      bIsBrokenBottom : 1;                                      // 0x0000(0x0001)
};

// ScriptStruct TslGame.SandboxMasterEffect
// 0x0020
struct FSandboxMasterEffect
{
	class UParticleSystem*                             ps;                                                       // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       SocketName;                                               // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    RelativeRotation;                                         // 0x0010(0x000C) (Edit, IsPlainOldData)
	bool                                               bEnableRelVelEffect;                                      // 0x001C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x001D(0x0003) MISSED OFFSET
};

// ScriptStruct TslGame.SandboxMasterEffectGroup
// 0x0018
struct FSandboxMasterEffectGroup
{
	ESandboxPowerType                                  EffectType;                                               // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0000(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	unsigned char                                      UnknownData01[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TArray<struct FSandboxMasterEffect>                EffectArray;                                              // 0x0008(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct TslGame.ParachuteInputData
// 0x0020
struct FParachuteInputData
{
	float                                              InForward;                                                // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              InRight;                                                  // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              CurrentForward;                                           // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              CurrentRight;                                             // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsFast;                                                  // 0x0010(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	float                                              CurrentPitch;                                             // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              CurrentYaw;                                               // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              CurrentRoll;                                              // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.SimulationStep
// 0x0048
struct FSimulationStep
{
	uint16_t                                           SimStep;                                                  // 0x0000(0x0002) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0002(0x0002) MISSED OFFSET
	struct FVector                                     Position;                                                 // 0x0004(0x000C) (IsPlainOldData)
	struct FRotator                                    Rotation;                                                 // 0x0010(0x000C) (IsPlainOldData)
	struct FVector                                     Velocity;                                                 // 0x001C(0x000C) (IsPlainOldData)
	struct FParachuteInputData                         InputData;                                                // 0x0028(0x0020)
};

// ScriptStruct TslGame.SkinParam
// 0x0010
struct FSkinParam
{
	ESkinCategory                                      SkinCategory;                                             // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FName                                       SkinName;                                                 // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.ReplicatedSkinParam
// 0x0020
struct FReplicatedSkinParam
{
	struct FName                                       SkinItemID;                                               // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FSkinParam                                  SkinParam;                                                // 0x0008(0x0010) (BlueprintVisible, BlueprintReadOnly, Transient)
	int                                                SkinOwnerPlayerId;                                        // 0x0018(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.SkydiveRotationSettings
// 0x0018
struct FSkydiveRotationSettings
{
	float                                              RotationTargetAlphaAmplitude;                             // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RotationTargetAlphaSpeed;                                 // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RotationTargetAlphaPower;                                 // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseExponentialInterpolation;                             // 0x000C(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseExponentialRotationClamp;                             // 0x000D(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x000E(0x0002) MISSED OFFSET
	float                                              RotationSpeedExponential;                                 // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RotationSpeedConstant;                                    // 0x0014(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.SkydiveDragSettings
// 0x0014
struct FSkydiveDragSettings
{
	float                                              DragScale;                                                // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SpeedMinMap;                                              // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SpeedMaxMap;                                              // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForwardInputMinScalar;                                    // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForwardInputMaxScalar;                                    // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.SkydiveLateralSettings
// 0x0020
struct FSkydiveLateralSettings
{
	float                                              LateralAccelScale;                                        // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   AccelInputInMap;                                          // 0x0004(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   AccelInputOutMap;                                         // 0x000C(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxLatVelocity;                                           // 0x0014(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   SpeedScalarOutMap;                                        // 0x0018(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.FreefallVelocitySettings
// 0x000C
struct FFreefallVelocitySettings
{
	float                                              SpeedMin;                                                 // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SpeedMax;                                                 // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SpeedDefault;                                             // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.SkydiveVelocitySettings
// 0x0030
struct FSkydiveVelocitySettings
{
	struct FVector2D                                   MinMaxDiveAngle;                                          // 0x0000(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   SpeedScaleOutMap;                                         // 0x0008(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   InputMapScalar;                                           // 0x0010(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	float                                              VelocityTransferScalar;                                   // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   PitchScalarInMap;                                         // 0x001C(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   PitchScalarOutMap;                                        // 0x0024(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	float                                              MinDiveAngleLateralInputScalar;                           // 0x002C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.SkydiveInputSettings
// 0x0028
struct FSkydiveInputSettings
{
	float                                              InputAccelSpeed;                                          // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              InputBrakeSpeed;                                          // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              InputLateralSpeed;                                        // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              InputPitchSpeed;                                          // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              InputVelocitySpeed;                                       // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               InputAccelInterpLinear;                                   // 0x0014(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               InputBrakeInterpLinear;                                   // 0x0015(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               InputLateralInterpLinear;                                 // 0x0016(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               InputPitchInterpLinear;                                   // 0x0017(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParaSlowInputForward;                                     // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParaSlowInputRightScalar;                                 // 0x001C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParaSlowSideInputInterp;                                  // 0x0020(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParaFastSideInputInterp;                                  // 0x0024(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.SkydiveCameraBlendSettings
// 0x0010
struct FSkydiveCameraBlendSettings
{
	float                                              BlendInTime;                                              // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EViewTargetBlendFunction>              BlendFunction;                                            // 0x0004(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	float                                              BlendExponent;                                            // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bLockOutgoing;                                            // 0x000C(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
};

// ScriptStruct TslGame.ParachuteGeneralSettings
// 0x00C0
struct FParachuteGeneralSettings
{
	float                                              TraceSphereRadius;                                        // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     TraceSphereOffset;                                        // 0x0004(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	float                                              GroundTraceStart;                                         // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              GroundTraceEnd;                                           // 0x0014(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              GroundTraceDampingMin;                                    // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              GroundTraceDampingMax;                                    // 0x001C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              LiftScalarInterpSpeed;                                    // 0x0020(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceInterpSpeed;                                         // 0x0024(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              LerpDTScalar;                                             // 0x0028(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParachuteForwardVelocityTransferTimeout;                  // 0x002C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParachuteForwardVelocityTransferTimeoutDTScalar;          // 0x0030(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParachuteInputBlockTime;                                  // 0x0034(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     CapsuleOffset;                                            // 0x0038(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0044(0x0004) MISSED OFFSET
	class USkeletalMesh*                               ParachuteSK;                                              // 0x0048(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      ParachuteAnimInstance;                                    // 0x0050(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    ParachuteRelativeRotation;                                // 0x0058(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0064(0x0004) MISSED OFFSET
	class UPhysicsAsset*                               PhysicsAssetRef;                                          // 0x0068(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TMap<ESkydiveState, struct FSkydiveCameraBlendSettings> CameraStateBlendMap;                                      // 0x0070(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct TslGame.ParachuteControlSettings
// 0x0030
struct FParachuteControlSettings
{
	float                                              YawSpeed;                                                 // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxForwardPitch;                                          // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxBackwardPitch;                                         // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RollSpeedMin;                                             // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RollSpeedMax;                                             // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RollAngleMin;                                             // 0x0014(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RollAngleMax;                                             // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RollInterpSpeed;                                          // 0x001C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RollTendencyRiseSpeed;                                    // 0x0020(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RollTendencyFallSpeed;                                    // 0x0024(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PitchTendencyRiseSpeed;                                   // 0x0028(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PitchTendencyFallSpeed;                                   // 0x002C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.ParachuteVelocitySettings
// 0x007C
struct FParachuteVelocitySettings
{
	float                                              ForceForwardScale;                                        // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceForwardYawScalar;                                    // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceForwardStaticSpeed;                                  // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              VelocityLERPSpeedMin;                                     // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              VelocityLERPSpeedMax;                                     // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              VelocityLERPValueMin;                                     // 0x0014(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              VelocityLERPValueMax;                                     // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DampingPitchMin;                                          // 0x001C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DampingPitchMax;                                          // 0x0020(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DampingValueMin;                                          // 0x0024(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DampingValueMax;                                          // 0x0028(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DampingYawScalar;                                         // 0x002C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   DampingDiveMapIn;                                         // 0x0030(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   DampingDiveMapOut;                                        // 0x0038(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceDownAngleMin;                                        // 0x0040(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceDownAngleMax;                                        // 0x0044(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FinalVelocitySpeedMin;                                    // 0x0048(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FinalVelocitySpeedMax;                                    // 0x004C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FinalVelocityDampingMin;                                  // 0x0050(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FinalVelocityDampingMax;                                  // 0x0054(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceGravityMax;                                          // 0x0058(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceGravitySpeedMin;                                     // 0x005C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceGravitySpeedMax;                                     // 0x0060(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceGravityValueMin;                                     // 0x0064(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceGravityValueMax;                                     // 0x0068(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   BrakeDampingInMap;                                        // 0x006C(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   BrakeDampingOutMap;                                       // 0x0074(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.ParachuteDeploySettings
// 0x0010
struct FParachuteDeploySettings
{
	bool                                               bUseAutoDeploy;                                           // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              AutoDeployAltitude;                                       // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseAbsoluteAutoDeployAltitude;                           // 0x0008(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	float                                              StartDeployAltitude;                                      // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.ParachuteCutoffSettings
// 0x0050
struct FParachuteCutoffSettings
{
	float                                              ManualCutoffAltitude;                                     // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AutoCutoffDistance;                                       // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AutoCutoffSpeedDistanceScalar;                            // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseManualCutInputDampening;                              // 0x000C(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
	float                                              ManualCutInputScale;                                      // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseAutoCutInputDampening;                                // 0x0014(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
	float                                              AutoCutInputScale;                                        // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     CutoffSpeedScalar;                                        // 0x001C(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	float                                              ManualCutoffCheckTime;                                    // 0x0028(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AutoCutoffVelocityDistance;                               // 0x002C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CutoffReadyDuration;                                      // 0x0030(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseAutoCutoffVelocityTransfer;                           // 0x0034(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0035(0x0003) MISSED OFFSET
	struct FVector                                     AutoCutoffVelocityScalar;                                 // 0x0038(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseCutoffBeforeImpact;                                   // 0x0044(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0045(0x0003) MISSED OFFSET
	float                                              AutoCutoffAnimTime;                                       // 0x0048(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MeshRotationResetStep;                                    // 0x004C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.ExtCollisionShape
// 0x0014
struct FExtCollisionShape
{
	bool                                               bIsSphere;                                                // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              Radius;                                                   // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     Extent;                                                   // 0x0008(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.ParachuteOverlapSettings
// 0x0020
struct FParachuteOverlapSettings
{
	struct FVector                                     LocalOffset;                                              // 0x0000(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FExtCollisionShape                          CollisionShape;                                           // 0x000C(0x0014) (Edit, DisableEditOnInstance)
};

// ScriptStruct TslGame.AnimUpdateRateSettings
// 0x0078
struct FAnimUpdateRateSettings
{
	bool                                               bUseLookAheadMode;                                        // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bShouldUseLodMap;                                         // 0x0001(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0002(0x0006) MISSED OFFSET
	TMap<int, int>                                     LODToFrameSkipMap;                                        // 0x0008(0x0050) (Edit, ZeroConstructor, DisableEditOnInstance)
	int                                                BaseNonRenderedUpdateRate;                                // 0x0058(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x005C(0x0004) MISSED OFFSET
	TArray<float>                                      BaseVisibleDistanceFactorThesholds;                       // 0x0060(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	int                                                MaxEvalRateForInterpolation;                              // 0x0070(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0074(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.ParachuteLandingData
// 0x0030
struct FParachuteLandingData
{
	EParachuteLandingSurfaceType                       LandingSurfaceType;                                       // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              LandingSpeedLimit;                                        // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                LocalLandingMontage;                                      // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                RemoteLandingMontage;                                     // 0x0010(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseRotationLock;                                         // 0x0018(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0019(0x0003) MISSED OFFSET
	float                                              RotationLockTime;                                         // 0x001C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                ParachuteCollapseMontage;                                 // 0x0020(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       LandingName;                                              // 0x0028(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.ParachuteLandSettings
// 0x0018
struct FParachuteLandSettings
{
	TArray<struct FParachuteLandingData>               LandingTypeArray;                                         // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UAnimMontage*                                ManualDetachMontage;                                      // 0x0010(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.SkydiveNetInterpSettings
// 0x0028
struct FSkydiveNetInterpSettings
{
	float                                              FreefallLocationInterpSpeedExp;                           // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParachuteLocationInterpSpeedExp;                          // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParachuteRotationInterpSpeedExp;                          // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   HeightInterpSpeedInMap;                                   // 0x000C(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   HeightInterpSpeedOutMap;                                  // 0x0014(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	float                                              LowAltitudeRepRate;                                       // 0x001C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RemoteFreefallMeshInterpSpeed;                            // 0x0020(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxAllowedLandingPositionDelta;                           // 0x0024(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.SkydiveEffects
// 0x0058
struct FSkydiveEffects
{
	class UParticleSystem*                             FreefallEffect;                                           // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UParticleSystem*                             ParachuteEffect;                                          // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   EffectSpeedMapIn;                                         // 0x0010(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   EffectSpeedMapOut;                                        // 0x0018(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   EffectAltitudeMapIn;                                      // 0x0020(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   EffectAltitudeMapOut;                                     // 0x0028(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   EffectDeployMapIn;                                        // 0x0030(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   EffectDeployMapOut;                                       // 0x0038(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      FreefallCameraShakeClass;                                 // 0x0040(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      ParachuteCameraShakeClass;                                // 0x0048(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UCurveVector*                                SkydiveCameraShakeCurve;                                  // 0x0050(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.SkydiveAudioSettings
// 0x0078
struct FSkydiveAudioSettings
{
	float                                              AudioVol;                                                 // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	class UAkAudioEvent*                               FreefallLoop;                                             // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               ParachuteLoop;                                            // 0x0010(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               ParachuteOpen;                                            // 0x0018(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       VelocityRTPCName;                                         // 0x0020(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       VelocityDeltaRTPCName;                                    // 0x0028(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       AccelRTPCName;                                            // 0x0030(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       BrakeRTPCName;                                            // 0x0038(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       PitchRTPCName;                                            // 0x0040(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       TurnRTPCName;                                             // 0x0048(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       AltitudeRTPCName;                                         // 0x0050(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              VelocityInterpSpeed;                                      // 0x0058(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              VelocityDeltaInterpSpeed;                                 // 0x005C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AccelInterpSpeed;                                         // 0x0060(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BrakeInterpSpeed;                                         // 0x0064(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PitchInterpSpeed;                                         // 0x0068(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TurnInterpSpeed;                                          // 0x006C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AltitudeInterpSpeed;                                      // 0x0070(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0074(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.SkydiveDamageSettings
// 0x0048
struct FSkydiveDamageSettings
{
	bool                                               bApplyLandingDamage;                                      // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FVector2D                                   NormalInMap;                                              // 0x0004(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   NormalOutMap;                                             // 0x000C(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   VelocityDotScaleInMap;                                    // 0x0014(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   VelocityDotScaleOutMap;                                   // 0x001C(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   VelocityDamageInMap;                                      // 0x0024(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   VelocityDamageOutMap;                                     // 0x002C(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
	class UClass*                                      DamageType;                                               // 0x0038(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FallDamageBlockTime;                                      // 0x0040(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0044(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.NpcSpawnParam
// 0x0008
struct FNpcSpawnParam
{
	int                                                NpcType;                                                  // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                SpawnNum;                                                 // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.NpcTimeSpawnParam
// 0x0020
struct FNpcTimeSpawnParam
{
	float                                              StartDelay;                                               // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxRadius;                                                // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FNpcSpawnParam>                      NpcSpawnParamArray;                                       // 0x0008(0x0010) (Edit, ZeroConstructor)
	int                                                NpcCount;                                                 // 0x0018(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.SavedObPos
// 0x0018
struct FSavedObPos
{
	struct FVector                                     Loc;                                                      // 0x0000(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	struct FRotator                                    Rot;                                                      // 0x000C(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
};

// ScriptStruct TslGame.BinaryData
// 0x0010
struct FBinaryData
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct TslGame.SandboxMasterPSC
// 0x0010
struct FSandboxMasterPSC
{
	ESandboxPowerType                                  Type;                                                     // 0x0000(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0000(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	bool                                               bEnableRelVelEffect;                                      // 0x0004(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	class UParticleSystemComponent*                    PSC;                                                      // 0x0008(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
};

// ScriptStruct TslGame.ItemOffsetData
// 0x0078
struct FItemOffsetData
{
	struct FVector                                     SlotOffset_Primary_Location;                              // 0x0000(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     SlotOffset_Secondary_Location;                            // 0x000C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     SlotOffset_SideArm_Location;                              // 0x0018(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     SlotOffset_Melee_Location;                                // 0x0024(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     SlotOffset_Thrown_Location;                               // 0x0030(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    SlotOffset_Primary_Rotation;                              // 0x003C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    SlotOffset_Secondary_Rotation;                            // 0x0048(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    SlotOffset_SideArm_Rotation;                              // 0x0054(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    SlotOffset_Melee_Rotation;                                // 0x0060(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    SlotOffset_Thrown_Rotation;                               // 0x006C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.BreathValue
// 0x0008
struct FBreathValue
{
	float                                              BreathApnea;                                              // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              BreathAds;                                                // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct TslGame.CharacterBreath
// 0x00B8
struct FCharacterBreath
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
	class UClass*                                      RestorationBuff;                                          // 0x0010(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      RestorationAdsBuff;                                       // 0x0018(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      ApneaDebuff;                                              // 0x0020(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      HoldBreathDebuff;                                         // 0x0028(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      SprintDebuff;                                             // 0x0030(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0038(0x0010) MISSED OFFSET
	struct FBreathValue                                MaxBreath;                                                // 0x0048(0x0008) (Edit, DisableEditOnInstance)
	struct FVector                                     BreathPointOffsetAtStand;                                 // 0x0050(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     BreathPointOffsetAtCrouch;                                // 0x005C(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     BreathPointOffsetAtProne;                                 // 0x0068(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     BreathPointOffsetAtGroggy;                                // 0x0074(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FBreathValue                                MinimumBreathStartHoldingBreath;                          // 0x0080(0x0008) (Edit, DisableEditOnInstance)
	float                                              MinimumBreathStartSprinting;                              // 0x0088(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2C];                                      // 0x008C(0x002C) MISSED OFFSET
};

// ScriptStruct TslGame.ReticleBrightSceneVisibility
// 0x000C
struct FReticleBrightSceneVisibility
{
	float                                              LuminanceMultiplier;                                      // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              OpacityMultiplier;                                        // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              OpacityMultiplierLowResolution;                           // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct TslGame.WeaponPPSettings
// 0x00A8
struct FWeaponPPSettings
{
	float                                              BlurLevel;                                                // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ScopeRadiusNear;                                          // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ScopeRadiusFar;                                           // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   ReticleRect;                                              // 0x000C(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	float                                              ReticleAngularSize;                                       // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FLinearColor                                ReticleTint;                                              // 0x0018(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	float                                              ReticleGamma;                                             // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	class UTexture*                                    ReticleTexture;                                           // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bReticleExtendTextureBorder;                              // 0x0038(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0039(0x0007) MISSED OFFSET
	class UReticleSettings*                            ReticleSettings;                                          // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ScopeLensDistortion;                                      // 0x0048(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ScopeLensCA;                                              // 0x004C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FLinearColor                                ScopeLensTint;                                            // 0x0050(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	float                                              ScopeOuterBrightness;                                     // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DepthBlurPower;                                           // 0x0064(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DepthBlurWhitePoint;                                      // 0x0068(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DepthBlurBlackPoint;                                      // 0x006C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   RelativeOffsetMap;                                        // 0x0070(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	float                                              ParallaxMovementScale;                                    // 0x0078(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParallaxRadiusScale;                                      // 0x007C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BloomIntensity;                                           // 0x0080(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              NearClipStaticOffset;                                     // 0x0084(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              NearClipMinClamp;                                         // 0x0088(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     WeaponCycleCameraOffset;                                  // 0x008C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FReticleBrightSceneVisibility               BrightSceneVisibility;                                    // 0x0098(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      UnknownData02[0x4];                                       // 0x00A4(0x0004) MISSED OFFSET
};

// ScriptStruct TslGame.TslKillCauserData
// 0x0030
struct FTslKillCauserData
{
	class ATslPlayerState*                             KillCauserPlayerState;                                    // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UClass*                                      DamageCauserClass;                                        // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FReplicatedSkinParam                        ReplicatedSkinParam;                                      // 0x0010(0x0020) (Transient)
};

// ScriptStruct TslGame.TakeHitInfo
// 0x0058
struct FTakeHitInfo
{
	float                                              ActualDamage;                                             // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	class UClass*                                      DamageType;                                               // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class ATslPlayerState>              PlayerInstigator;                                         // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FVector_NetQuantize                         DamageOrigin;                                             // 0x0018(0x000C)
	struct FVector_NetQuantize                         RelHitLocation;                                           // 0x0024(0x000C)
	struct FName                                       BoneName;                                                 // 0x0030(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              DamageMaxRadius;                                          // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      ShotDirPitch;                                             // 0x003C(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      ShotDirYaw;                                               // 0x003D(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      bPointDamage : 1;                                         // 0x003E(0x0001)
	unsigned char                                      bRadialDamage : 1;                                        // 0x003E(0x0001)
	unsigned char                                      bKilled : 1;                                              // 0x003E(0x0001)
	unsigned char                                      EnsureReplicationByte;                                    // 0x003F(0x0001) (ZeroConstructor, IsPlainOldData)
