#pragma once

// PUBG (7.1.6.5) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "PUBG_Engine_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

<<<<<<< HEAD
// Class Engine.AISystemBase
// 0x0020 (0x0048 - 0x0028)
class UAISystemBase : public UObject
{
public:
	struct FStringClassReference                       AISystemClassName;                                        // 0x0028(0x0010) (Config, GlobalConfig, NoClear)
	struct FName                                       AISystemModuleName;                                       // 0x0038(0x0008) (ZeroConstructor, Config, GlobalConfig, NoClear, IsPlainOldData)
	bool                                               bInstantiateAISystemOnClient;                             // 0x0040(0x0001) (ZeroConstructor, Config, GlobalConfig, NoClear, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0041(0x0007) MISSED OFFSET
=======
// Class Engine.Actor
// 0x03D8 (0x0400 - 0x0028)
class AActor : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) UNKNOWN PROPERTY: EncryptedObjectProperty Engine.Actor.RootComponent
	unsigned char                                      UnknownData01[0x10];                                      // 0x0030(0x0010) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnActorHit;                                               // 0x0040(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              NetUpdateFrequency;                                       // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02 : 3;                                        // 0x0054(0x0001)
	unsigned char                                      bActorEnableCollision : 1;                                // 0x0054(0x0001)
	unsigned char                                      UnknownData03 : 4;                                        // 0x0054(0x0001)
	unsigned char                                      UnknownData04 : 1;                                        // 0x0055(0x0001)
	unsigned char                                      bReplayRewindable : 1;                                    // 0x0055(0x0001)
	unsigned char                                      bReplicates : 1;                                          // 0x0055(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      UnknownData05[0x2];                                       // 0x0056(0x0002) MISSED OFFSET
	struct FName                                       NetDriverName;                                            // 0x0058(0x0008) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ENetRole>                              RemoteRole;                                               // 0x0060(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData06[0x7];                                       // 0x0061(0x0007) MISSED OFFSET
	unsigned char                                      UnknownData07[0x8];                                       // 0x0061(0x0008) UNKNOWN PROPERTY: EncryptedObjectProperty Engine.Actor.Owner
	struct FRepMovement                                ReplicatedMovement;                                       // 0x0070(0x0034) (Edit, Net, DisableEditOnInstance)
	unsigned char                                      UnknownData08[0x4];                                       // 0x00A4(0x0004) MISSED OFFSET
	struct FRepAttachment                              AttachmentReplication;                                    // 0x00A8(0x0040) (Net, Transient)
	class UInputComponent*                             InputComponent;                                           // 0x00E8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnInputTouchLeave;                                        // 0x00F0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	int                                                InputPriority;                                            // 0x0100(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData09[0x4];                                       // 0x0104(0x0004) MISSED OFFSET
	TArray<class AActor*>                              Children;                                                 // 0x0108(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData10[0x4];                                       // 0x0118(0x0004) MISSED OFFSET
	float                                              MinNetUpdateFrequency;                                    // 0x011C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnTakePointDamage;                                        // 0x0120(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      bAutoDestroyWhenFinished : 1;                             // 0x0130(0x0001) (BlueprintVisible)
	unsigned char                                      bCanBeDamaged : 1;                                        // 0x0130(0x0001) (Edit, BlueprintVisible, Net, SaveGame)
	unsigned char                                      bActorIsBeingDestroyed : 1;                               // 0x0130(0x0001) (Transient, DuplicateTransient)
	unsigned char                                      bCollideWhenPlacing : 1;                                  // 0x0130(0x0001)
	unsigned char                                      bFindCameraComponentWhenViewTarget : 1;                   // 0x0130(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bRelevantForNetworkReplays : 1;                           // 0x0130(0x0001)
	unsigned char                                      bGenerateOverlapEventsDuringLevelStreaming : 1;           // 0x0130(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bIgnoreDestroyActorFromBlueprint : 1;                     // 0x0130(0x0001) (Transient)
	unsigned char                                      bCanBeInCluster : 1;                                      // 0x0131(0x0001) (Edit)
	unsigned char                                      UnknownData11[0x6];                                       // 0x0132(0x0006) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnTakeAnyDamage;                                          // 0x0138(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              CustomTimeDilation;                                       // 0x0148(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData12[0x4];                                       // 0x014C(0x0004) MISSED OFFSET
	TArray<class UActorComponent*>                     InstanceComponents;                                       // 0x0150(0x0010) (ExportObject, ZeroConstructor)
	TArray<class UActorComponent*>                     BlueprintCreatedComponents;                               // 0x0160(0x0010) (ExportObject, ZeroConstructor)
	unsigned char                                      bAllowReceiveTickEventOnDedicatedServer : 1;              // 0x0170(0x0001)
	unsigned char                                      UnknownData13 : 3;                                        // 0x0170(0x0001)
	unsigned char                                      bActorSeamlessTraveled : 1;                               // 0x0170(0x0001)
	unsigned char                                      bIgnoresOriginShifting : 1;                               // 0x0170(0x0001) (Edit)
	unsigned char                                      bEnableAutoLODGeneration : 1;                             // 0x0170(0x0001) (Edit)
	unsigned char                                      UnknownData14[0x3];                                       // 0x0171(0x0003) MISSED OFFSET
	float                                              ForceReplicateInterleavingFreq;                           // 0x0174(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EInputConsumeOptions>                  InputConsumeOption;                                       // 0x0178(0x0001) (ZeroConstructor, Deprecated, IsPlainOldData)
	unsigned char                                      UnknownData15[0x3];                                       // 0x0179(0x0003) MISSED OFFSET
	TWeakObjectPtr<class UChildActorComponent>         ParentComponent;                                          // 0x017C(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData16[0x54];                                      // 0x0184(0x0054) MISSED OFFSET
	uint64_t                                           HiddenEditorViews;                                        // 0x01D8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	ESpawnActorCollisionHandlingMethod                 SpawnCollisionHandlingMethod;                             // 0x01E0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData17[0x7];                                       // 0x01E1(0x0007) MISSED OFFSET
	float                                              NetCullDistanceSquared;                                   // 0x01E8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData18[0x54];                                      // 0x01EC(0x0054) MISSED OFFSET
	TWeakObjectPtr<class AActor>                       ParentComponentActor;                                     // 0x0240(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	int                                                NetTag;                                                   // 0x0248(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      bHidden : 1;                                              // 0x024C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net)
	unsigned char                                      bNetTemporary : 1;                                        // 0x024C(0x0001)
	unsigned char                                      bNetStartup : 1;                                          // 0x024C(0x0001)
	unsigned char                                      bOnlyRelevantToOwner : 1;                                 // 0x024C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      bAlwaysRelevant : 1;                                      // 0x024C(0x0001) (Edit, BlueprintVisible, DisableEditOnInstance)
	unsigned char                                      bReplicateMovement : 1;                                   // 0x024C(0x0001) (Edit, Net, DisableEditOnInstance)
	unsigned char                                      bIsSetSpectatedDelay : 1;                                 // 0x024C(0x0001) (Net)
	unsigned char                                      bTearOff : 1;                                             // 0x024C(0x0001) (Net)
	unsigned char                                      bExchangedRoles : 1;                                      // 0x024D(0x0001) (Transient)
	unsigned char                                      UnknownData19 : 1;                                        // 0x024D(0x0001)
	unsigned char                                      bNetLoadOnClient : 1;                                     // 0x024D(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bNetUseOwnerRelevancy : 1;                                // 0x024D(0x0001) (Edit, BlueprintVisible, DisableEditOnInstance)
	unsigned char                                      bBlockInput : 1;                                          // 0x024D(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData20 : 1;                                        // 0x024D(0x0001)
	unsigned char                                      bAllowTickBeforeBeginPlay : 1;                            // 0x024D(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData21[0x2];                                       // 0x024E(0x0002) MISSED OFFSET
	TArray<class AMatineeActor*>                       ControllingMatineeActors;                                 // 0x0250(0x0010) (ZeroConstructor, Transient)
	TEnumAsByte<EAutoReceiveInput>                     AutoReceiveInput;                                         // 0x0260(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData22[0x7];                                       // 0x0261(0x0007) MISSED OFFSET
	TArray<struct FName>                               Layers;                                                   // 0x0268(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData23[0x10];                                      // 0x0278(0x0010) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnEndCursorOver;                                          // 0x0288(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnReleased;                                               // 0x0298(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              InitialLifeSpan;                                          // 0x02A8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData24[0x4];                                       // 0x02AC(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnInputTouchEnd;                                          // 0x02B0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class APawn*                                       Instigator;                                               // 0x02C0(0x0008) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnActorBeginOverlap;                                      // 0x02C8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnActorEndOverlap;                                        // 0x02D8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FGuid                                       DestructibleId;                                           // 0x02E8(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	bool                                               bIsDestroyedVersion;                                      // 0x02F8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               RemoveFromLevelLOD;                                       // 0x02F9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData25[0x6];                                       // 0x02FA(0x0006) MISSED OFFSET
	struct FActorTickFunction                          PrimaryActorTick;                                         // 0x0300(0x0058) (Edit, DisableEditOnInstance)
	struct FScriptMulticastDelegate                    OnInputTouchEnter;                                        // 0x0358(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnClicked;                                                // 0x0368(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TArray<struct FName>                               Tags;                                                     // 0x0378(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData26[0x10];                                      // 0x0388(0x0010) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnBeginCursorOver;                                        // 0x0398(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData27[0x8];                                       // 0x03A8(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnInputTouchBegin;                                        // 0x03B0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TEnumAsByte<ENetRole>                              Role;                                                     // 0x03C0(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData28[0x7];                                       // 0x03C1(0x0007) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnDestroyed;                                              // 0x03C8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnEndPlay;                                                // 0x03D8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData29[0x8];                                       // 0x03E8(0x0008) MISSED OFFSET
	float                                              NetPriority;                                              // 0x03F0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData30[0xC];                                       // 0x03F4(0x000C) MISSED OFFSET
>>>>>>> 365df962e7a70abd9703cbaa62487bbf1539bbf3

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
<<<<<<< HEAD
			ptr = UObject::FindClass(_xor_("Class Engine.AISystemBase"));
=======
			ptr = UObject::FindClass(_xor_("Class Engine.Actor"));
>>>>>>> 365df962e7a70abd9703cbaa62487bbf1539bbf3

		return ptr;
	}

<<<<<<< HEAD
};


// Class Engine.ActorComponent
// 0x01C8 (0x01F0 - 0x0028)
class UActorComponent : public UObject
{
public:
	unsigned char                                      UnknownData00[0xE8];                                      // 0x0028(0x00E8) MISSED OFFSET
	struct FActorComponentTickFunction                 PrimaryComponentTick;                                     // 0x0110(0x0058) (Edit, DisableEditOnInstance)
	TArray<struct FName>                               ComponentTags;                                            // 0x0168(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAssetUserData*>                      AssetUserData;                                            // 0x0178(0x0010) (ExportObject, ZeroConstructor)
	unsigned char                                      UnknownData01 : 3;                                        // 0x0188(0x0001)
	unsigned char                                      bReplicates : 1;                                          // 0x0188(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance)
	unsigned char                                      bNetAddressable : 1;                                      // 0x0188(0x0001)
	unsigned char                                      bNetRemappable : 1;                                       // 0x0188(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData02[0x1];                                       // 0x0189(0x0001) MISSED OFFSET
	unsigned char                                      UnknownData03 : 2;                                        // 0x018A(0x0001)
	unsigned char                                      bCreatedByConstructionScript : 1;                         // 0x018A(0x0001) (Deprecated)
	unsigned char                                      bInstanceComponent : 1;                                   // 0x018A(0x0001) (Deprecated)
	unsigned char                                      bAutoActivate : 1;                                        // 0x018A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bIsActive : 1;                                            // 0x018A(0x0001) (Net, Transient)
	unsigned char                                      bEditableWhenInherited : 1;                               // 0x018A(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData04[0x1];                                       // 0x018B(0x0001) MISSED OFFSET
	struct FGuid                                       DestructibleId;                                           // 0x018C(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	bool                                               bIsDestroyedVersion;                                      // 0x019C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x019D(0x0003) MISSED OFFSET
	unsigned char                                      bCanEverAffectNavigation : 1;                             // 0x01A0(0x0001) (Edit)
	unsigned char                                      UnknownData06 : 2;                                        // 0x01A0(0x0001)
	unsigned char                                      bIsEditorOnly : 1;                                        // 0x01A0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData07[0x4];                                       // 0x01A1(0x0004) MISSED OFFSET
	EComponentCreationMethod                           CreationMethod;                                           // 0x01A5(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0xA];                                       // 0x01A6(0x000A) MISSED OFFSET
	TArray<struct FSimpleMemberReference>              UCSModifiedProperties;                                    // 0x01B0(0x0010) (ZeroConstructor)
	struct FScriptMulticastDelegate                    OnComponentActivated;                                     // 0x01C0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnComponentDeactivated;                                   // 0x01D0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData09[0x9];                                       // 0x01E0(0x0009) MISSED OFFSET
	unsigned char                                      bReplayRewindable : 1;                                    // 0x01E9(0x0001)
	unsigned char                                      UnknownData10[0x6];                                       // 0x01EA(0x0006) MISSED OFFSET
=======

	bool WasRecentlyRendered(float Tolerance);
	void UserConstructionScript();
	void TearOff();
	void SnapRootComponentTo(class AActor* InParentActor, const struct FName& InSocketName);
	void SetTickGroup(TEnumAsByte<ETickingGroup> NewTickGroup);
	void SetTickableWhenPaused(bool bTickableWhenPaused);
	void SetReplicates(bool bInReplicates);
	void SetReplicateMovement(bool bInReplicateMovement);
	void SetOwner(class AActor* NewOwner);
	void SetLifeSpan(float InLifespan);
	void SetActorTickInterval(float TickInterval);
	void SetActorTickEnabled(bool bEnabled);
	void SetActorScale3D(const struct FVector& NewScale3D);
	void SetActorRelativeScale3D(const struct FVector& NewRelativeScale);
	void SetActorHiddenInGame(bool bNewHidden);
	void SetActorEnableCollision(bool bNewActorEnableCollision);
	void RemoveTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void RemoveTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveRadialDamage(float DamageReceived, class UDamageType* DamageType, const struct FVector& Origin, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser);
	void ReceivePointDamage(float Damage, class UDamageType* DamageType, const struct FVector& HitLocation, const struct FVector& HitNormal, class UPrimitiveComponent* HitComponent, const struct FName& BoneName, const struct FVector& ShotFromDirection, class AController* InstigatedBy, class AActor* DamageCauser, const struct FHitResult& HitInfo);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void ReceiveAnyDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void ReceiveActorOnReleased(const struct FKey& ButtonReleased);
	void ReceiveActorOnInputTouchLeave(TEnumAsByte<ETouchIndex> FingerIndex);
	void ReceiveActorOnInputTouchEnter(TEnumAsByte<ETouchIndex> FingerIndex);
	void ReceiveActorOnInputTouchEnd(TEnumAsByte<ETouchIndex> FingerIndex);
	void ReceiveActorOnInputTouchBegin(TEnumAsByte<ETouchIndex> FingerIndex);
	void ReceiveActorOnClicked(const struct FKey& ButtonPressed);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveActorEndCursorOver();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorBeginCursorOver();
	void OnRep_Role();
	void OnRep_ReplicateMovement();
	void OnRep_ReplicatedMovement();
	void OnRep_Owner();
	void OnRep_Instigator();
	void OnRep_AttachmentReplication();
	void MakeNoise(float Loudness, class APawn* NoiseInstigator, const struct FVector& NoiseLocation, float MaxRange, const struct FName& Tag);
	class UMaterialInstanceDynamic* MakeMIDForMaterial(class UMaterialInterface* Parent);
	bool K2_TeleportTo(const struct FVector& DestLocation, const struct FRotator& DestRotation);
	bool K2_SetActorTransform(const struct FTransform& NewTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	bool K2_SetActorRotation(const struct FRotator& NewRotation, bool bTeleportPhysics);
	void K2_SetActorRelativeTransform(const struct FTransform& NewRelativeTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_SetActorRelativeRotation(const struct FRotator& NewRelativeRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_SetActorRelativeLocation(const struct FVector& NewRelativeLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	bool K2_SetActorLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	bool K2_SetActorLocation(const struct FVector& NewLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_OnReset();
	void K2_OnEndViewTarget(class APlayerController* PC);
	void K2_OnBecomeViewTarget(class APlayerController* PC);
	class USceneComponent* K2_GetRootComponent();
	struct FRotator K2_GetActorRotation();
	struct FVector K2_GetActorLocation();
	void K2_DetachFromActor(EDetachmentRule LocationRule, EDetachmentRule RotationRule, EDetachmentRule ScaleRule);
	void K2_DestroyComponent(class UActorComponent* Component);
	void K2_DestroyActor();
	void K2_AttachToComponent(class USceneComponent* Parent, const struct FName& SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
	void K2_AttachToActor(class AActor* ParentActor, const struct FName& SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
	void K2_AttachRootComponentToActor(class AActor* InParentActor, const struct FName& InSocketName, TEnumAsByte<EAttachLocation> AttachLocationType, bool bWeldSimulatedBodies);
	void K2_AttachRootComponentTo(class USceneComponent* InParent, const struct FName& InSocketName, TEnumAsByte<EAttachLocation> AttachLocationType, bool bWeldSimulatedBodies);
	void K2_AddActorWorldTransform(const struct FTransform& DeltaTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddActorWorldRotation(const struct FRotator& DeltaRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddActorWorldOffset(const struct FVector& DeltaLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddActorLocalTransform(const struct FTransform& NewTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddActorLocalRotation(const struct FRotator& DeltaRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddActorLocalOffset(const struct FVector& DeltaLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	bool IsOverlappingActor(class AActor* Other);
	bool IsChildActor();
	bool IsActorTickEnabled();
	bool IsActorBeingDestroyed();
	bool HasAuthority();
	float GetVerticalDistanceTo(class AActor* OtherActor);
	struct FVector GetVelocity();
	struct FTransform GetTransform();
	bool GetTickableWhenPaused();
	float GetSquaredDistanceTo(class AActor* OtherActor);
	TEnumAsByte<ENetRole> GetRemoteRole();
	class UChildActorComponent* GetParentComponent();
	class AActor* GetParentActor();
	class AActor* GetOwner();
	void GetOverlappingComponents(TArray<class UPrimitiveComponent*>* OverlappingComponents);
	void GetOverlappingActors(class UClass* ClassFilter, TArray<class AActor*>* OverlappingActors);
	float GetLifeSpan();
	class AController* GetInstigatorController();
	class APawn* GetInstigator();
	struct FVector GetInputVectorAxisValue(const struct FKey& InputAxisKey);
	float GetInputAxisValue(const struct FName& InputAxisName);
	float GetInputAxisKeyValue(const struct FKey& InputAxisKey);
	float GetHorizontalDotProductTo(class AActor* OtherActor);
	float GetHorizontalDistanceTo(class AActor* OtherActor);
	float GetGameTimeSinceCreation();
	float GetDotProductTo(class AActor* OtherActor);
	float GetDistanceTo(class AActor* OtherActor);
	TArray<class UActorComponent*> GetComponentsByTag(class UClass* ComponentClass, const struct FName& Tag);
	TArray<class UActorComponent*> GetComponentsByClass(class UClass* ComponentClass);
	class UActorComponent* GetComponentByClass(class UClass* ComponentClass);
	struct FName GetAttachParentSocketName();
	class AActor* GetAttachParentActor();
	void GetAttachedActors(TArray<class AActor*>* OutActors);
	void GetAllChildActors(bool bIncludeDescendants, TArray<class AActor*>* ChildActors);
	struct FVector GetActorUpVector();
	float GetActorTimeDilation();
	float GetActorTickInterval();
	struct FVector GetActorScale3D();
	struct FVector GetActorRightVector();
	struct FVector GetActorRelativeScale3D();
	struct FVector GetActorForwardVector();
	void GetActorEyesViewPoint(struct FVector* OutLocation, struct FRotator* OutRotation);
	bool GetActorEnableCollision();
	void GetActorBounds(bool bOnlyCollidingComponents, struct FVector* Origin, struct FVector* BoxExtent);
	void ForceNetUpdate();
	void FlushNetDormancy();
	void EnableInput(class APlayerController* PlayerController);
	void DisableInput(class APlayerController* PlayerController);
	void DetachRootComponentFromParent(bool bMaintainWorldPosition);
	void AddTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void AddTickPrerequisiteActor(class AActor* PrerequisiteActor);
	class UActorComponent* AddComponent(const struct FName& TemplateName, bool bManualAttachment, const struct FTransform& RelativeTransform, class UObject* ComponentTemplateContext);
	bool ActorHasTag(const struct FName& Tag);
};


// Class Engine.StaticMeshActor
// 0x0010 (0x0410 - 0x0400)
class AStaticMeshActor : public AActor
{
public:
	class UStaticMeshComponent*                        StaticMeshComponent;                                      // 0x0400(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	bool                                               bStaticMeshReplicateMovement;                             // 0x0408(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	ENavDataGatheringMode                              NavigationGeometryGatheringMode;                          // 0x0409(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x040A(0x0006) MISSED OFFSET
>>>>>>> 365df962e7a70abd9703cbaa62487bbf1539bbf3

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
<<<<<<< HEAD
			ptr = UObject::FindClass(_xor_("Class Engine.ActorComponent"));
=======
			ptr = UObject::FindClass(_xor_("Class Engine.StaticMeshActor"));
>>>>>>> 365df962e7a70abd9703cbaa62487bbf1539bbf3

		return ptr;
	}

<<<<<<< HEAD

	void ToggleActive();
	void SetTickGroup(TEnumAsByte<ETickingGroup>* NewTickGroup);
	void SetTickableWhenPaused(bool* bTickableWhenPaused);
	void SetIsReplicated(bool* ShouldReplicate);
	void SetComponentTickInterval(float* TickInterval);
	void SetComponentTickEnabled(bool* bEnabled);
	void SetAutoActivate(bool* bNewAutoActivate);
	void SetActive(bool* bNewActive, bool* bReset);
	void RemoveTickPrerequisiteComponent(class UActorComponent** PrerequisiteComponent);
	void RemoveTickPrerequisiteActor(class AActor** PrerequisiteActor);
	void ReceiveTick(float* DeltaSeconds);
	void ReceiveEndPlay(TEnumAsByte<EEndPlayReason>* EndPlayReason);
	void ReceiveBeginPlay();
	void OnRep_IsActive();
	void K2_DestroyComponent(class UObject** Object);
	bool IsComponentTickEnabled();
	bool IsBeingDestroyed();
	bool IsActive();
	class AActor* GetOwner();
	float GetComponentTickInterval();
	void Deactivate();
	bool ComponentHasTag(struct FName* Tag);
	void AddTickPrerequisiteComponent(class UActorComponent** PrerequisiteComponent);
	void AddTickPrerequisiteActor(class AActor** PrerequisiteActor);
	void Activate(bool* bReset);
};


// Class Engine.DataAsset
// 0x0008 (0x0030 - 0x0028)
class UDataAsset : public UObject
{
public:
	class UClass*                                      NativeClass;                                              // 0x0028(0x0008) (ZeroConstructor, IsPlainOldData)
=======
};


// Class Engine.BlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UBlueprintFunctionLibrary : public UObject
{
public:
>>>>>>> 365df962e7a70abd9703cbaa62487bbf1539bbf3

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
<<<<<<< HEAD
			ptr = UObject::FindClass(_xor_("Class Engine.DataAsset"));
=======
			ptr = UObject::FindClass(_xor_("Class Engine.BlueprintFunctionLibrary"));
>>>>>>> 365df962e7a70abd9703cbaa62487bbf1539bbf3

		return ptr;
	}

<<<<<<< HEAD
};


// Class Engine.BlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UBlueprintFunctionLibrary : public UObject
=======

	struct FStringAssetReference STATIC_MakeStringAssetReference(const struct FString& AssetLongPathname);
};


// Class Engine.BlueprintAsyncActionBase
// 0x0000 (0x0028 - 0x0028)
class UBlueprintAsyncActionBase : public UObject
>>>>>>> 365df962e7a70abd9703cbaa62487bbf1539bbf3
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
<<<<<<< HEAD
			ptr = UObject::FindClass(_xor_("Class Engine.BlueprintFunctionLibrary"));
=======
			ptr = UObject::FindClass(_xor_("Class Engine.BlueprintAsyncActionBase"));
>>>>>>> 365df962e7a70abd9703cbaa62487bbf1539bbf3

		return ptr;
	}


<<<<<<< HEAD
	struct FStringAssetReference STATIC_MakeStringAssetReference(struct FString* AssetLongPathname);
};


// Class Engine.SceneComponent
// 0x02B0 (0x04A0 - 0x01F0)
class USceneComponent : public UActorComponent
{
public:
	struct FVector                                     ComponentVelocity;                                        // 0x01F0(0x000C) (IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x01FC(0x0010) MISSED OFFSET
	unsigned char                                      UnknownData01 : 1;                                        // 0x020C(0x0001)
	unsigned char                                      bReplicatesAttachmentReference : 1;                       // 0x020C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance)
	unsigned char                                      bReplicatesAttachment : 1;                                // 0x020C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance)
	unsigned char                                      bWorldToComponentUpdated : 1;                             // 0x020C(0x0001) (Transient)
	unsigned char                                      UnknownData02 : 1;                                        // 0x020C(0x0001)
	unsigned char                                      bAbsoluteLocation : 1;                                    // 0x020C(0x0001) (Edit, BlueprintVisible, Net)
	unsigned char                                      bAbsoluteRotation : 1;                                    // 0x020C(0x0001) (Edit, BlueprintVisible, Net)
	unsigned char                                      bAbsoluteScale : 1;                                       // 0x020C(0x0001) (Edit, BlueprintVisible, Net)
	unsigned char                                      bVisible : 1;                                             // 0x020D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net)
	unsigned char                                      bHiddenInGame : 1;                                        // 0x020D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bShouldUpdatePhysicsVolume : 1;                           // 0x020D(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bBoundsChangeTriggersStreamingDataRebuild : 1;            // 0x020D(0x0001)
	unsigned char                                      bUseAttachParentBound : 1;                                // 0x020D(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bEnableInsensitiveUpdate : 1;                             // 0x020D(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData03 : 2;                                        // 0x020D(0x0001)
	unsigned char                                      UnknownData04 : 2;                                        // 0x020E(0x0001)
	unsigned char                                      bAbsoluteTranslation : 1;                                 // 0x020E(0x0001) (Deprecated)
	unsigned char                                      UnknownData05[0x1];                                       // 0x020F(0x0001) MISSED OFFSET
	TWeakObjectPtr<class APhysicsVolume>               PhysicsVolume;                                            // 0x0210(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FRotator                                    RelativeRotation;                                         // 0x0218(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net, IsPlainOldData)
	unsigned char                                      UnknownData06[0x1C];                                      // 0x0224(0x001C) MISSED OFFSET
	unsigned char                                      UnknownData07[0x50];                                      // 0x0224(0x0050) UNKNOWN PROPERTY: SetProperty Engine.SceneComponent.ClientAttachedChildren
	unsigned char                                      UnknownData08[0x20];                                      // 0x0290(0x0020) MISSED OFFSET
	struct FVector                                     RelativeLocation;                                         // 0x02B0(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net, IsPlainOldData)
	struct FVector                                     RelativeScale3D;                                          // 0x02BC(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net, IsPlainOldData)
	unsigned char                                      UnknownData09[0x28];                                      // 0x02C8(0x0028) MISSED OFFSET
	TEnumAsByte<EComponentMobility>                    Mobility;                                                 // 0x02F0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData10[0x3F];                                      // 0x02F1(0x003F) MISSED OFFSET
	struct FVector                                     RelativeTranslation;                                      // 0x0330(0x000C) (Deprecated, IsPlainOldData)
	unsigned char                                      UnknownData11[0x4];                                       // 0x033C(0x0004) MISSED OFFSET
	TArray<class USceneComponent*>                     AttachChildren;                                           // 0x0340(0x0010) (ExportObject, Net, ZeroConstructor, Transient)
	unsigned char                                      UnknownData12[0x8];                                       // 0x0350(0x0008) MISSED OFFSET
	struct FName                                       AttachSocketName;                                         // 0x0358(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EDetailMode>                           DetailMode;                                               // 0x0360(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData13[0xF];                                       // 0x0361(0x000F) MISSED OFFSET
	class USceneComponent*                             AttachParent;                                             // 0x0370(0x0008) (ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FScriptMulticastDelegate                    PhysicsVolumeChangedDelegate;                             // 0x0378(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    AttachmentChangedDelegate;                                // 0x0388(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData14[0x108];                                     // 0x0398(0x0108) MISSED OFFSET
=======
	void Activate();
};


// Class Engine.BlueprintGeneratedClass
// 0x0108 (0x03B8 - 0x02B0)
class UBlueprintGeneratedClass : public UClass
{
public:
	int                                                NumReplicatedProperties;                                  // 0x02B0(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x02B4(0x0004) MISSED OFFSET
	TArray<class UDynamicBlueprintBinding*>            DynamicBindingObjects;                                    // 0x02B8(0x0010) (ZeroConstructor)
	TArray<class UActorComponent*>                     ComponentTemplates;                                       // 0x02C8(0x0010) (ExportObject, ZeroConstructor)
	TArray<class UTimelineTemplate*>                   Timelines;                                                // 0x02D8(0x0010) (ZeroConstructor)
	class USimpleConstructionScript*                   SimpleConstructionScript;                                 // 0x02E8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UInheritableComponentHandler*                InheritableComponentHandler;                              // 0x02F0(0x0008) (ZeroConstructor, IsPlainOldData)
	class UStructProperty*                             UberGraphFramePointerProperty;                            // 0x02F8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UFunction*                                   UberGraphFunction;                                        // 0x0300(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<struct FEventGraphFastCallPair>             FastCallPairs;                                            // 0x0308(0x0010) (ZeroConstructor, Deprecated)
	bool                                               bHasInstrumentation;                                      // 0x0318(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0319(0x0007) MISSED OFFSET
	TMap<struct FName, struct FBlueprintCookedComponentInstancingData> CookedComponentInstancingData;                            // 0x0320(0x0050) (ZeroConstructor)
	bool                                               bHasNativizedParent;                                      // 0x0370(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x47];                                      // 0x0371(0x0047) MISSED OFFSET
>>>>>>> 365df962e7a70abd9703cbaa62487bbf1539bbf3

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
<<<<<<< HEAD
			ptr = UObject::FindClass(_xor_("Class Engine.SceneComponent"));
=======
			ptr = UObject::FindClass(_xor_("Class Engine.BlueprintGeneratedClass"));
>>>>>>> 365df962e7a70abd9703cbaa62487bbf1539bbf3

		return ptr;
	}

<<<<<<< HEAD

	void ToggleVisibility(bool* bPropagateToChildren);
	bool SnapTo(class USceneComponent** InParent, struct FName* InSocketName);
	void SetWorldScale3D(struct FVector* NewScale);
	void SetVisibility(bool* bNewVisibility, bool* bPropagateToChildren);
	void SetRelativeScale3D(struct FVector* NewScale3D);
	void SetIsAttachmentReplicated(bool* ShouldReplicate);
	void SetIsAttachmentReferenceReplicated(bool* ShouldReplicate);
	void SetHiddenInGame(bool* NewHidden, bool* bPropagateToChildren);
	void SetAbsolute(bool* bNewAbsoluteLocation, bool* bNewAbsoluteRotation, bool* bNewAbsoluteScale);
	void ResetRelativeTransform();
	void OnRep_Visibility(bool* OldValue);
	void OnRep_Transform();
	void OnRep_AttachSocketName();
	void OnRep_AttachParent();
	void OnRep_AttachChildren();
	void K2_SetWorldTransform(struct FTransform* NewTransform, bool* bSweep, bool* bTeleport, struct FHitResult* SweepHitResult);
	void K2_SetWorldRotation(struct FRotator* NewRotation, bool* bSweep, bool* bTeleport, struct FHitResult* SweepHitResult);
	void K2_SetWorldLocationAndRotation(struct FVector* NewLocation, struct FRotator* NewRotation, bool* bSweep, bool* bTeleport, struct FHitResult* SweepHitResult);
	void K2_SetWorldLocation(struct FVector* NewLocation, bool* bSweep, bool* bTeleport, struct FHitResult* SweepHitResult);
	void K2_SetRelativeTransform(struct FTransform* NewTransform, bool* bSweep, bool* bTeleport, struct FHitResult* SweepHitResult);
	void K2_SetRelativeRotation(struct FRotator* NewRotation, bool* bSweep, bool* bTeleport, struct FHitResult* SweepHitResult);
	void K2_SetRelativeLocationAndRotation(struct FVector* NewLocation, struct FRotator* NewRotation, bool* bSweep, bool* bTeleport, struct FHitResult* SweepHitResult);
	void K2_SetRelativeLocation(struct FVector* NewLocation, bool* bSweep, bool* bTeleport, struct FHitResult* SweepHitResult);
	struct FTransform K2_GetComponentToWorld();
	struct FVector K2_GetComponentScale();
	struct FRotator K2_GetComponentRotation();
	struct FVector K2_GetComponentLocation();
	void K2_DetachFromComponent(EDetachmentRule* LocationRule, EDetachmentRule* RotationRule, EDetachmentRule* ScaleRule, bool* bCallModify);
	bool K2_AttachToComponent(class USceneComponent** Parent, struct FName* SocketName, EAttachmentRule* LocationRule, EAttachmentRule* RotationRule, EAttachmentRule* ScaleRule, bool* bWeldSimulatedBodies);
	bool K2_AttachTo(class USceneComponent** InParent, struct FName* InSocketName, TEnumAsByte<EAttachLocation>* AttachType, bool* bWeldSimulatedBodies);
	void K2_AddWorldTransform(struct FTransform* DeltaTransform, bool* bSweep, bool* bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddWorldRotation(struct FRotator* DeltaRotation, bool* bSweep, bool* bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddWorldOffset(struct FVector* DeltaLocation, bool* bSweep, bool* bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddRelativeRotation(struct FRotator* DeltaRotation, bool* bSweep, bool* bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddRelativeLocation(struct FVector* DeltaLocation, bool* bSweep, bool* bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddLocalTransform(struct FTransform* DeltaTransform, bool* bSweep, bool* bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddLocalRotation(struct FRotator* DeltaRotation, bool* bSweep, bool* bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddLocalOffset(struct FVector* DeltaLocation, bool* bSweep, bool* bTeleport, struct FHitResult* SweepHitResult);
	bool IsVisible();
	bool IsSimulatingPhysics(struct FName* BoneName);
	bool IsAnySimulatingPhysics();
	struct FVector GetUpVector();
	struct FTransform GetSocketTransform(struct FName* InSocketName, TEnumAsByte<ERelativeTransformSpace>* TransformSpace);
	struct FRotator GetSocketRotation(struct FName* InSocketName);
	struct FQuat GetSocketQuaternion(struct FName* InSocketName);
	struct FVector GetSocketLocation(struct FName* InSocketName);
	struct FVector GetRightVector();
	struct FTransform GetRelativeTransform();
	class APhysicsVolume* GetPhysicsVolume();
	void GetParentComponents(TArray<class USceneComponent*>* Parents);
	int GetNumChildrenComponents();
	struct FVector GetForwardVector();
	struct FVector GetComponentVelocity();
	void GetChildrenComponents(bool* bIncludeAllDescendants, TArray<class USceneComponent*>* Children);
	class USceneComponent* GetChildComponent(int* ChildIndex);
	struct FName GetAttachSocketName();
	class USceneComponent* GetAttachParent();
	TArray<struct FName> GetAllSocketNames();
	bool DoesSocketExist(struct FName* InSocketName);
	void DetachFromParent(bool* bMaintainWorldPosition, bool* bCallModify);
};


// Class Engine.PrimitiveComponent
// 0x0510 (0x09B0 - 0x04A0)
class UPrimitiveComponent : public USceneComponent
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x04A0(0x0008) MISSED OFFSET
	float                                              MinDrawDistance;                                          // 0x04A8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LDMaxDrawDistance;                                        // 0x04AC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CachedMaxDrawDistance;                                    // 0x04B0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	TEnumAsByte<ESceneDepthPriorityGroup>              DepthPriorityGroup;                                       // 0x04B4(0x0001) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ESceneDepthPriorityGroup>              ViewOwnerDepthPriorityGroup;                              // 0x04B5(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x04B6(0x0002) MISSED OFFSET
	unsigned char                                      UnknownData02 : 3;                                        // 0x04B8(0x0001)
	unsigned char                                      bAlwaysCreatePhysicsState : 1;                            // 0x04B8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bGenerateOverlapEvents : 1;                               // 0x04B8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bMultiBodyOverlap : 1;                                    // 0x04B8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bCheckAsyncSceneOnMove : 1;                               // 0x04B8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bTraceComplexOnMove : 1;                                  // 0x04B8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bDisableForceFromCharacter : 1;                           // 0x04B9(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bReturnMaterialOnMove : 1;                                // 0x04B9(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bUseViewOwnerDepthPriorityGroup : 1;                      // 0x04B9(0x0001)
	unsigned char                                      bAllowCullDistanceVolume : 1;                             // 0x04B9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bImportantMesh : 1;                                       // 0x04B9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bOverrideCullingDistances : 1;                            // 0x04B9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData03[0x2];                                       // 0x04BA(0x0002) MISSED OFFSET
	float                                              HLODScreenSize;                                           // 0x04BC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bHasMotionBlurVelocityMeshes : 1;                         // 0x04C0(0x0001)
	unsigned char                                      bVisibleInReflectionCaptures : 1;                         // 0x04C0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bRenderInMainPass : 1;                                    // 0x04C0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bRenderInMono : 1;                                        // 0x04C0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bReceivesDecals : 1;                                      // 0x04C0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bReceivesDecalsEx : 1;                                    // 0x04C0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bOwnerNoSee : 1;                                          // 0x04C0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bOnlyOwnerSee : 1;                                        // 0x04C0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bTreatAsBackgroundForOcclusion : 1;                       // 0x04C1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bUseAsOccluder : 1;                                       // 0x04C1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bForceAsOccluder : 1;                                     // 0x04C1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bForceOcclusionQuerying : 1;                              // 0x04C1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bForceDisableOcclusionQuerying : 1;                       // 0x04C1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bSelectable : 1;                                          // 0x04C1(0x0001)
	unsigned char                                      bForceMipStreaming : 1;                                   // 0x04C1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bHasPerInstanceHitProxies : 1;                            // 0x04C1(0x0001)
	unsigned char                                      UnknownData04[0x2];                                       // 0x04C2(0x0002) MISSED OFFSET
	TEnumAsByte<EIndoorOutdoorMask>                    IndoorOutdoorMask;                                        // 0x04C4(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x04C5(0x0003) MISSED OFFSET
	unsigned char                                      CastShadow : 1;                                           // 0x04C8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bAffectDynamicIndirectLighting : 1;                       // 0x04C8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bAffectDistanceFieldLighting : 1;                         // 0x04C8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastDynamicShadow : 1;                                   // 0x04C8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastStaticShadow : 1;                                    // 0x04C8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastVolumetricTranslucentShadow : 1;                     // 0x04C8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bSelfShadowOnly : 1;                                      // 0x04C8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastFarShadow : 1;                                       // 0x04C8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastInsetShadow : 1;                                     // 0x04C9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastCinematicShadow : 1;                                 // 0x04C9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastHiddenShadow : 1;                                    // 0x04C9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastShadowAsTwoSided : 1;                                // 0x04C9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bLightAsIfStatic : 1;                                     // 0x04C9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bLightAttachmentsAsGroup : 1;                             // 0x04C9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
