#pragma once

// PUBG (7.2.8.10) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "PUBG_Engine_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class Engine.Actor
// 0x03B8 (0x03E8 - 0x0030)
class AActor : public UObject
{
public:
	float                                              NetUpdateFrequency;                                       // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x14];                                      // 0x0034(0x0014) MISSED OFFSET
	unsigned char                                      bHidden : 1;                                              // 0x0048(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net)
	unsigned char                                      bNetTemporary : 1;                                        // 0x0048(0x0001)
	unsigned char                                      bNetStartup : 1;                                          // 0x0048(0x0001)
	unsigned char                                      bOnlyRelevantToOwner : 1;                                 // 0x0048(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      bAlwaysRelevant : 1;                                      // 0x0048(0x0001) (Edit, BlueprintVisible, DisableEditOnInstance)
	unsigned char                                      bReplicateMovement : 1;                                   // 0x0048(0x0001) (Edit, Net, DisableEditOnInstance)
	unsigned char                                      bIsSetSpectatedDelay : 1;                                 // 0x0048(0x0001) (Net)
	unsigned char                                      bTearOff : 1;                                             // 0x0048(0x0001) (Net)
	unsigned char                                      bExchangedRoles : 1;                                      // 0x0049(0x0001) (Transient)
	unsigned char                                      UnknownData01 : 1;                                        // 0x0049(0x0001)
	unsigned char                                      bNetLoadOnClient : 1;                                     // 0x0049(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bNetUseOwnerRelevancy : 1;                                // 0x0049(0x0001) (Edit, BlueprintVisible, DisableEditOnInstance)
	unsigned char                                      bBlockInput : 1;                                          // 0x0049(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData02 : 1;                                        // 0x0049(0x0001)
	unsigned char                                      bAllowTickBeforeBeginPlay : 1;                            // 0x0049(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData03 : 1;                                        // 0x0049(0x0001)
	unsigned char                                      UnknownData04 : 2;                                        // 0x004A(0x0001)
	unsigned char                                      bActorEnableCollision : 1;                                // 0x004A(0x0001)
	unsigned char                                      UnknownData05 : 5;                                        // 0x004A(0x0001)
	unsigned char                                      bReplayRewindable : 1;                                    // 0x004B(0x0001)
	unsigned char                                      bReplicates : 1;                                          // 0x004B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      UnknownData06[0x4];                                       // 0x004C(0x0004) MISSED OFFSET
	struct FName                                       NetDriverName;                                            // 0x0050(0x0008) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ENetRole>                              RemoteRole;                                               // 0x0058(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData07[0x7];                                       // 0x0059(0x0007) MISSED OFFSET
	unsigned char                                      UnknownData08[0x8];                                       // 0x0059(0x0008) UNKNOWN PROPERTY: EncryptedObjectProperty Engine.Actor.Owner
	struct FRepMovement                                ReplicatedMovement;                                       // 0x0068(0x0034) (Edit, Net, DisableEditOnInstance)
	unsigned char                                      UnknownData09[0x4];                                       // 0x009C(0x0004) MISSED OFFSET
	struct FRepAttachment                              AttachmentReplication;                                    // 0x00A0(0x0040) (Net, Transient)
	unsigned char                                      UnknownData10[0x8];                                       // 0x00E0(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnEndCursorOver;                                          // 0x00E8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	int                                                NetTag;                                                   // 0x00F8(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              CustomTimeDilation;                                       // 0x00FC(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnActorEndOverlap;                                        // 0x0100(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnTakePointDamage;                                        // 0x0110(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnActorHit;                                               // 0x0120(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      bAutoDestroyWhenFinished : 1;                             // 0x0130(0x0001) (BlueprintVisible)
	unsigned char                                      bCanBeDamaged : 1;                                        // 0x0130(0x0001) (Edit, BlueprintVisible, Net, SaveGame)
	unsigned char                                      bActorIsBeingDestroyed : 1;                               // 0x0130(0x0001) (Transient, DuplicateTransient)
	unsigned char                                      bCollideWhenPlacing : 1;                                  // 0x0130(0x0001)
	unsigned char                                      bFindCameraComponentWhenViewTarget : 1;                   // 0x0130(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bRelevantForNetworkReplays : 1;                           // 0x0130(0x0001)
	unsigned char                                      bGenerateOverlapEventsDuringLevelStreaming : 1;           // 0x0130(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bIgnoreDestroyActorFromBlueprint : 1;                     // 0x0130(0x0001) (Transient)
	unsigned char                                      bCanBeInCluster : 1;                                      // 0x0131(0x0001) (Edit)
	unsigned char                                      UnknownData11[0x2];                                       // 0x0132(0x0002) MISSED OFFSET
	TWeakObjectPtr<class UChildActorComponent>         ParentComponent;                                          // 0x0134(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData12[0x4];                                       // 0x013C(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnInputTouchEnd;                                          // 0x0140(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData13[0x4];                                       // 0x0150(0x0004) MISSED OFFSET
	ESpawnActorCollisionHandlingMethod                 SpawnCollisionHandlingMethod;                             // 0x0154(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EAutoReceiveInput>                     AutoReceiveInput;                                         // 0x0155(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData14[0x2];                                       // 0x0156(0x0002) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnActorBeginOverlap;                                      // 0x0158(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      bAllowReceiveTickEventOnDedicatedServer : 1;              // 0x0168(0x0001)
	unsigned char                                      UnknownData15 : 3;                                        // 0x0168(0x0001)
	unsigned char                                      bActorSeamlessTraveled : 1;                               // 0x0168(0x0001)
	unsigned char                                      bIgnoresOriginShifting : 1;                               // 0x0168(0x0001) (Edit)
	unsigned char                                      bEnableAutoLODGeneration : 1;                             // 0x0168(0x0001) (Edit)
	unsigned char                                      UnknownData16[0x3];                                       // 0x0169(0x0003) MISSED OFFSET
	struct FGuid                                       DestructibleId;                                           // 0x016C(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	bool                                               bIsDestroyedVersion;                                      // 0x017C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               RemoveFromLevelLOD;                                       // 0x017D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData17[0x2];                                       // 0x017E(0x0002) MISSED OFFSET
	struct FActorTickFunction                          PrimaryActorTick;                                         // 0x0180(0x0058) (Edit, DisableEditOnInstance)
	TArray<class AActor*>                              Children;                                                 // 0x01D8(0x0010) (ZeroConstructor, Transient)
	class APawn*                                       Instigator;                                               // 0x01E8(0x0008) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData18[0x50];                                      // 0x01F0(0x0050) MISSED OFFSET
	TEnumAsByte<ENetRole>                              Role;                                                     // 0x0240(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData19[0x3];                                       // 0x0241(0x0003) MISSED OFFSET
	float                                              NetPriority;                                              // 0x0244(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ForceReplicateInterleavingFreq;                           // 0x0248(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData20[0x4];                                       // 0x024C(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnReleased;                                               // 0x0250(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TEnumAsByte<EInputConsumeOptions>                  InputConsumeOption;                                       // 0x0260(0x0001) (ZeroConstructor, Deprecated, IsPlainOldData)
	unsigned char                                      UnknownData21[0x7];                                       // 0x0261(0x0007) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnClicked;                                                // 0x0268(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TArray<class AMatineeActor*>                       ControllingMatineeActors;                                 // 0x0278(0x0010) (ZeroConstructor, Transient)
	TArray<struct FName>                               Layers;                                                   // 0x0288(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData22[0x8];                                       // 0x0298(0x0008) UNKNOWN PROPERTY: EncryptedObjectProperty Engine.Actor.RootComponent
	int                                                InputPriority;                                            // 0x02A0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData23[0x4];                                       // 0x02A4(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnBeginCursorOver;                                        // 0x02A8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData24[0x10];                                      // 0x02B8(0x0010) MISSED OFFSET
	TArray<class UActorComponent*>                     InstanceComponents;                                       // 0x02C8(0x0010) (ExportObject, ZeroConstructor)
	struct FScriptMulticastDelegate                    OnTakeAnyDamage;                                          // 0x02D8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData25[0x58];                                      // 0x02E8(0x0058) MISSED OFFSET
	class UInputComponent*                             InputComponent;                                           // 0x0340(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TWeakObjectPtr<class AActor>                       ParentComponentActor;                                     // 0x0348(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	float                                              NetCullDistanceSquared;                                   // 0x0350(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              InitialLifeSpan;                                          // 0x0354(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TArray<class UActorComponent*>                     BlueprintCreatedComponents;                               // 0x0358(0x0010) (ExportObject, ZeroConstructor)
	struct FScriptMulticastDelegate                    OnInputTouchLeave;                                        // 0x0368(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TArray<struct FName>                               Tags;                                                     // 0x0378(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FScriptMulticastDelegate                    OnDestroyed;                                              // 0x0388(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnEndPlay;                                                // 0x0398(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData26[0x8];                                       // 0x03A8(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnInputTouchEnter;                                        // 0x03B0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              MinNetUpdateFrequency;                                    // 0x03C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData27[0x4];                                       // 0x03C4(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnInputTouchBegin;                                        // 0x03C8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	uint64_t                                           HiddenEditorViews;                                        // 0x03D8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData28[0x8];                                       // 0x03E0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass(_xor_("Class Engine.Actor"));

		return ptr;
	}


	bool STATIC_WasRecentlyRendered(float Tolerance);
	void STATIC_UserConstructionScript();
	void STATIC_TearOff();
	void STATIC_SnapRootComponentTo(class AActor* InParentActor, const struct FName& InSocketName);
	void STATIC_SetTickGroup(TEnumAsByte<ETickingGroup> NewTickGroup);
	void STATIC_SetTickableWhenPaused(bool bTickableWhenPaused);
	void STATIC_SetReplicates(bool bInReplicates);
	void STATIC_SetReplicateMovement(bool bInReplicateMovement);
	void STATIC_SetOwner(class AActor* NewOwner);
	void STATIC_SetLifeSpan(float InLifespan);
	void STATIC_SetActorTickInterval(float TickInterval);
	void STATIC_SetActorTickEnabled(bool bEnabled);
	void STATIC_SetActorScale3D(const struct FVector& NewScale3D);
	void STATIC_SetActorRelativeScale3D(const struct FVector& NewRelativeScale);
	void STATIC_SetActorHiddenInGame(bool bNewHidden);
	void STATIC_SetActorEnableCollision(bool bNewActorEnableCollision);
	void STATIC_RemoveTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void STATIC_RemoveTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void STATIC_ReceiveTick(float DeltaSeconds);
	void STATIC_ReceiveRadialDamage(float DamageReceived, class UDamageType* DamageType, const struct FVector& Origin, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser);
	void STATIC_ReceivePointDamage(float Damage, class UDamageType* DamageType, const struct FVector& HitLocation, const struct FVector& HitNormal, class UPrimitiveComponent* HitComponent, const struct FName& BoneName, const struct FVector& ShotFromDirection, class AController* InstigatedBy, class AActor* DamageCauser, const struct FHitResult& HitInfo);
	void STATIC_ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void STATIC_ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);
	void STATIC_ReceiveDestroyed();
	void STATIC_ReceiveBeginPlay();
	void STATIC_ReceiveAnyDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void STATIC_ReceiveActorOnReleased(const struct FKey& ButtonReleased);
	void STATIC_ReceiveActorOnInputTouchLeave(TEnumAsByte<ETouchIndex> FingerIndex);
	void STATIC_ReceiveActorOnInputTouchEnter(TEnumAsByte<ETouchIndex> FingerIndex);
	void STATIC_ReceiveActorOnInputTouchEnd(TEnumAsByte<ETouchIndex> FingerIndex);
	void STATIC_ReceiveActorOnInputTouchBegin(TEnumAsByte<ETouchIndex> FingerIndex);
	void STATIC_ReceiveActorOnClicked(const struct FKey& ButtonPressed);
	void STATIC_ReceiveActorEndOverlap(class AActor* OtherActor);
	void STATIC_ReceiveActorEndCursorOver();
	void STATIC_ReceiveActorBeginOverlap(class AActor* OtherActor);
	void STATIC_ReceiveActorBeginCursorOver();
	void STATIC_OnRep_Role();
	void STATIC_OnRep_ReplicateMovement();
	void STATIC_OnRep_ReplicatedMovement();
	void STATIC_OnRep_Owner();
	void STATIC_OnRep_Instigator();
	void STATIC_OnRep_AttachmentReplication();
	void STATIC_MakeNoise(float Loudness, class APawn* NoiseInstigator, const struct FVector& NoiseLocation, float MaxRange, const struct FName& Tag);
	class UMaterialInstanceDynamic* STATIC_MakeMIDForMaterial(class UMaterialInterface* Parent);
	bool STATIC_K2_TeleportTo(const struct FVector& DestLocation, const struct FRotator& DestRotation);
	bool STATIC_K2_SetActorTransform(const struct FTransform& NewTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	bool STATIC_K2_SetActorRotation(const struct FRotator& NewRotation, bool bTeleportPhysics);
	void STATIC_K2_SetActorRelativeTransform(const struct FTransform& NewRelativeTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_SetActorRelativeRotation(const struct FRotator& NewRelativeRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_SetActorRelativeLocation(const struct FVector& NewRelativeLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	bool STATIC_K2_SetActorLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	bool STATIC_K2_SetActorLocation(const struct FVector& NewLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_OnReset();
	void STATIC_K2_OnEndViewTarget(class APlayerController* PC);
	void STATIC_K2_OnBecomeViewTarget(class APlayerController* PC);
	class USceneComponent* STATIC_K2_GetRootComponent();
	struct FRotator STATIC_K2_GetActorRotation();
	struct FVector STATIC_K2_GetActorLocation();
	void STATIC_K2_DetachFromActor(EDetachmentRule LocationRule, EDetachmentRule RotationRule, EDetachmentRule ScaleRule);
	void STATIC_K2_DestroyComponent(class UActorComponent* Component);
	void STATIC_K2_DestroyActor();
	void STATIC_K2_AttachToComponent(class USceneComponent* Parent, const struct FName& SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
	void STATIC_K2_AttachToActor(class AActor* ParentActor, const struct FName& SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
	void STATIC_K2_AttachRootComponentToActor(class AActor* InParentActor, const struct FName& InSocketName, TEnumAsByte<EAttachLocation> AttachLocationType, bool bWeldSimulatedBodies);
	void STATIC_K2_AttachRootComponentTo(class USceneComponent* InParent, const struct FName& InSocketName, TEnumAsByte<EAttachLocation> AttachLocationType, bool bWeldSimulatedBodies);
	void STATIC_K2_AddActorWorldTransform(const struct FTransform& DeltaTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_AddActorWorldRotation(const struct FRotator& DeltaRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_AddActorWorldOffset(const struct FVector& DeltaLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_AddActorLocalTransform(const struct FTransform& NewTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_AddActorLocalRotation(const struct FRotator& DeltaRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_AddActorLocalOffset(const struct FVector& DeltaLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	bool STATIC_IsOverlappingActor(class AActor* Other);
	bool STATIC_IsChildActor();
	bool STATIC_IsActorTickEnabled();
	bool STATIC_IsActorBeingDestroyed();
	bool STATIC_HasAuthority();
	float STATIC_GetVerticalDistanceTo(class AActor* OtherActor);
	struct FVector STATIC_GetVelocity();
	struct FTransform STATIC_GetTransform();
	bool STATIC_GetTickableWhenPaused();
	float STATIC_GetSquaredDistanceTo(class AActor* OtherActor);
	TEnumAsByte<ENetRole> STATIC_GetRemoteRole();
	class UChildActorComponent* STATIC_GetParentComponent();
	class AActor* STATIC_GetParentActor();
	class AActor* STATIC_GetOwner();
	void STATIC_GetOverlappingComponents(TArray<class UPrimitiveComponent*>* OverlappingComponents);
	void STATIC_GetOverlappingActors(class UClass* ClassFilter, TArray<class AActor*>* OverlappingActors);
	float STATIC_GetLifeSpan();
	class AController* STATIC_GetInstigatorController();
	class APawn* STATIC_GetInstigator();
	struct FVector STATIC_GetInputVectorAxisValue(const struct FKey& InputAxisKey);
	float STATIC_GetInputAxisValue(const struct FName& InputAxisName);
	float STATIC_GetInputAxisKeyValue(const struct FKey& InputAxisKey);
	float STATIC_GetHorizontalDotProductTo(class AActor* OtherActor);
	float STATIC_GetHorizontalDistanceTo(class AActor* OtherActor);
	float STATIC_GetGameTimeSinceCreation();
	float STATIC_GetDotProductTo(class AActor* OtherActor);
	float STATIC_GetDistanceTo(class AActor* OtherActor);
	TArray<class UActorComponent*> STATIC_GetComponentsByTag(class UClass* ComponentClass, const struct FName& Tag);
	TArray<class UActorComponent*> STATIC_GetComponentsByClass(class UClass* ComponentClass);
	class UActorComponent* STATIC_GetComponentByClass(class UClass* ComponentClass);
	struct FName STATIC_GetAttachParentSocketName();
	class AActor* STATIC_GetAttachParentActor();
	void STATIC_GetAttachedActors(TArray<class AActor*>* OutActors);
	void STATIC_GetAllChildActors(bool bIncludeDescendants, TArray<class AActor*>* ChildActors);
	struct FVector STATIC_GetActorUpVector();
	float STATIC_GetActorTimeDilation();
	float STATIC_GetActorTickInterval();
	struct FVector STATIC_GetActorScale3D();
	struct FVector STATIC_GetActorRightVector();
	struct FVector STATIC_GetActorRelativeScale3D();
	struct FVector STATIC_GetActorForwardVector();
	void STATIC_GetActorEyesViewPoint(struct FVector* OutLocation, struct FRotator* OutRotation);
	bool STATIC_GetActorEnableCollision();
	void STATIC_GetActorBounds(bool bOnlyCollidingComponents, struct FVector* Origin, struct FVector* BoxExtent);
	void STATIC_ForceNetUpdate();
	void STATIC_FlushNetDormancy();
	void STATIC_EnableInput(class APlayerController* PlayerController);
	void STATIC_DisableInput(class APlayerController* PlayerController);
	void STATIC_DetachRootComponentFromParent(bool bMaintainWorldPosition);
	void STATIC_AddTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void STATIC_AddTickPrerequisiteActor(class AActor* PrerequisiteActor);
	class UActorComponent* STATIC_AddComponent(const struct FName& TemplateName, bool bManualAttachment, const struct FTransform& RelativeTransform, class UObject* ComponentTemplateContext);
	bool STATIC_ActorHasTag(const struct FName& Tag);
};


// Class Engine.StaticMeshActor
// 0x0010 (0x03F8 - 0x03E8)
class AStaticMeshActor : public AActor
{
public:
	class UStaticMeshComponent*                        StaticMeshComponent;                                      // 0x03E8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	bool                                               bStaticMeshReplicateMovement;                             // 0x03F0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	ENavDataGatheringMode                              NavigationGeometryGatheringMode;                          // 0x03F1(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x03F2(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass(_xor_("Class Engine.StaticMeshActor"));

		return ptr;
	}

};


// Class Engine.ActorComponent
// 0x01D0 (0x0200 - 0x0030)
class UActorComponent : public UObject
{
public:
	unsigned char                                      UnknownData00[0xF0];                                      // 0x0030(0x00F0) MISSED OFFSET
	struct FActorComponentTickFunction                 PrimaryComponentTick;                                     // 0x0120(0x0058) (Edit, DisableEditOnInstance)
	TArray<struct FName>                               ComponentTags;                                            // 0x0178(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAssetUserData*>                      AssetUserData;                                            // 0x0188(0x0010) (ExportObject, ZeroConstructor)
	unsigned char                                      UnknownData01 : 3;                                        // 0x0198(0x0001)
	unsigned char                                      bReplicates : 1;                                          // 0x0198(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance)
	unsigned char                                      bNetAddressable : 1;                                      // 0x0198(0x0001)
	unsigned char                                      bNetRemappable : 1;                                       // 0x0198(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData02[0x1];                                       // 0x0199(0x0001) MISSED OFFSET
	unsigned char                                      UnknownData03 : 2;                                        // 0x019A(0x0001)
	unsigned char                                      bCreatedByConstructionScript : 1;                         // 0x019A(0x0001) (Deprecated)
	unsigned char                                      bInstanceComponent : 1;                                   // 0x019A(0x0001) (Deprecated)
	unsigned char                                      bAutoActivate : 1;                                        // 0x019A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bIsActive : 1;                                            // 0x019A(0x0001) (Net, Transient)
	unsigned char                                      bEditableWhenInherited : 1;                               // 0x019A(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData04[0x1];                                       // 0x019B(0x0001) MISSED OFFSET
	struct FGuid                                       DestructibleId;                                           // 0x019C(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	bool                                               bIsDestroyedVersion;                                      // 0x01AC(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x01AD(0x0003) MISSED OFFSET
	unsigned char                                      bCanEverAffectNavigation : 1;                             // 0x01B0(0x0001) (Edit)
	unsigned char                                      UnknownData06 : 2;                                        // 0x01B0(0x0001)
	unsigned char                                      bIsEditorOnly : 1;                                        // 0x01B0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData07[0x4];                                       // 0x01B1(0x0004) MISSED OFFSET
	EComponentCreationMethod                           CreationMethod;                                           // 0x01B5(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0xA];                                       // 0x01B6(0x000A) MISSED OFFSET
	TArray<struct FSimpleMemberReference>              UCSModifiedProperties;                                    // 0x01C0(0x0010) (ZeroConstructor)
	struct FScriptMulticastDelegate                    OnComponentActivated;                                     // 0x01D0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnComponentDeactivated;                                   // 0x01E0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData09[0x9];                                       // 0x01F0(0x0009) MISSED OFFSET
	unsigned char                                      bReplayRewindable : 1;                                    // 0x01F9(0x0001)
	unsigned char                                      UnknownData10[0x6];                                       // 0x01FA(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass(_xor_("Class Engine.ActorComponent"));

		return ptr;
	}


	void STATIC_ToggleActive();
	void STATIC_SetTickGroup(TEnumAsByte<ETickingGroup> NewTickGroup);
	void STATIC_SetTickableWhenPaused(bool bTickableWhenPaused);
	void STATIC_SetIsReplicated(bool ShouldReplicate);
	void STATIC_SetComponentTickInterval(float TickInterval);
	void STATIC_SetComponentTickEnabled(bool bEnabled);
	void STATIC_SetAutoActivate(bool bNewAutoActivate);
	void STATIC_SetActive(bool bNewActive, bool bReset);
	void STATIC_RemoveTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void STATIC_RemoveTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void STATIC_ReceiveTick(float DeltaSeconds);
	void STATIC_ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);
	void STATIC_ReceiveBeginPlay();
	void STATIC_OnRep_IsActive();
	void STATIC_K2_DestroyComponent(class UObject* Object);
	bool STATIC_IsComponentTickEnabled();
	bool STATIC_IsBeingDestroyed();
	bool STATIC_IsActive();
	class AActor* STATIC_GetOwner();
	float STATIC_GetComponentTickInterval();
	void STATIC_Deactivate();
	bool STATIC_ComponentHasTag(const struct FName& Tag);
	void STATIC_AddTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void STATIC_AddTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void STATIC_Activate(bool bReset);
};


// Class Engine.SceneComponent
// 0x02B0 (0x04B0 - 0x0200)
class USceneComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0200(0x0008) MISSED OFFSET
	struct FName                                       AttachSocketName;                                         // 0x0208(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EDetailMode>                           DetailMode;                                               // 0x0210(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0211(0x0007) MISSED OFFSET
	unsigned char                                      UnknownData02[0x50];                                      // 0x0211(0x0050) UNKNOWN PROPERTY: SetProperty Engine.SceneComponent.ClientAttachedChildren
	unsigned char                                      UnknownData03 : 1;                                        // 0x0268(0x0001)
	unsigned char                                      bReplicatesAttachmentReference : 1;                       // 0x0268(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance)
	unsigned char                                      bReplicatesAttachment : 1;                                // 0x0268(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance)
	unsigned char                                      bWorldToComponentUpdated : 1;                             // 0x0268(0x0001) (Transient)
	unsigned char                                      UnknownData04 : 1;                                        // 0x0268(0x0001)
	unsigned char                                      bAbsoluteLocation : 1;                                    // 0x0268(0x0001) (Edit, BlueprintVisible, Net)
	unsigned char                                      bAbsoluteRotation : 1;                                    // 0x0268(0x0001) (Edit, BlueprintVisible, Net)
	unsigned char                                      bAbsoluteScale : 1;                                       // 0x0268(0x0001) (Edit, BlueprintVisible, Net)
	unsigned char                                      bVisible : 1;                                             // 0x0269(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net)
	unsigned char                                      bHiddenInGame : 1;                                        // 0x0269(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bShouldUpdatePhysicsVolume : 1;                           // 0x0269(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bBoundsChangeTriggersStreamingDataRebuild : 1;            // 0x0269(0x0001)
	unsigned char                                      bUseAttachParentBound : 1;                                // 0x0269(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bEnableInsensitiveUpdate : 1;                             // 0x0269(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData05 : 2;                                        // 0x0269(0x0001)
	unsigned char                                      UnknownData06 : 2;                                        // 0x026A(0x0001)
	unsigned char                                      bAbsoluteTranslation : 1;                                 // 0x026A(0x0001) (Deprecated)
	unsigned char                                      UnknownData07[0x1];                                       // 0x026B(0x0001) MISSED OFFSET
	TWeakObjectPtr<class APhysicsVolume>               PhysicsVolume;                                            // 0x026C(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData08[0x4];                                       // 0x0274(0x0004) MISSED OFFSET
	struct FVector                                     RelativeLocation;                                         // 0x0278(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net, IsPlainOldData)
	unsigned char                                      UnknownData09[0x2C];                                      // 0x0284(0x002C) MISSED OFFSET
	TArray<class USceneComponent*>                     AttachChildren;                                           // 0x02B0(0x0010) (ExportObject, Net, ZeroConstructor, Transient)
	unsigned char                                      UnknownData10[0x48];                                      // 0x02C0(0x0048) MISSED OFFSET
	struct FVector                                     ComponentVelocity;                                        // 0x0308(0x000C) (IsPlainOldData)
	struct FVector                                     RelativeTranslation;                                      // 0x0314(0x000C) (Deprecated, IsPlainOldData)
	struct FRotator                                    RelativeRotation;                                         // 0x0320(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net, IsPlainOldData)
	unsigned char                                      UnknownData11[0x4];                                       // 0x032C(0x0004) MISSED OFFSET
	class USceneComponent*                             AttachParent;                                             // 0x0330(0x0008) (ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData12[0x38];                                      // 0x0338(0x0038) MISSED OFFSET
	struct FVector                                     RelativeScale3D;                                          // 0x0370(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net, IsPlainOldData)
	TEnumAsByte<EComponentMobility>                    Mobility;                                                 // 0x037C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData13[0xB];                                       // 0x037D(0x000B) MISSED OFFSET
	struct FScriptMulticastDelegate                    PhysicsVolumeChangedDelegate;                             // 0x0388(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    AttachmentChangedDelegate;                                // 0x0398(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData14[0x108];                                     // 0x03A8(0x0108) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass(_xor_("Class Engine.SceneComponent"));

		return ptr;
	}


	void STATIC_ToggleVisibility(bool bPropagateToChildren);
	bool STATIC_SnapTo(class USceneComponent* InParent, const struct FName& InSocketName);
	void STATIC_SetWorldScale3D(const struct FVector& NewScale);
	void STATIC_SetVisibility(bool bNewVisibility, bool bPropagateToChildren);
	void STATIC_SetRelativeScale3D(const struct FVector& NewScale3D);
	void STATIC_SetIsAttachmentReplicated(bool ShouldReplicate);
	void STATIC_SetIsAttachmentReferenceReplicated(bool ShouldReplicate);
	void STATIC_SetHiddenInGame(bool NewHidden, bool bPropagateToChildren);
	void STATIC_SetAbsolute(bool bNewAbsoluteLocation, bool bNewAbsoluteRotation, bool bNewAbsoluteScale);
	void STATIC_ResetRelativeTransform();
	void STATIC_OnRep_Visibility(bool OldValue);
	void STATIC_OnRep_Transform();
	void STATIC_OnRep_AttachSocketName();
	void STATIC_OnRep_AttachParent();
	void STATIC_OnRep_AttachChildren();
	void STATIC_K2_SetWorldTransform(const struct FTransform& NewTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_SetWorldRotation(const struct FRotator& NewRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_SetWorldLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_SetWorldLocation(const struct FVector& NewLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_SetRelativeTransform(const struct FTransform& NewTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_SetRelativeRotation(const struct FRotator& NewRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_SetRelativeLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_SetRelativeLocation(const struct FVector& NewLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	struct FTransform STATIC_K2_GetComponentToWorld();
	struct FVector STATIC_K2_GetComponentScale();
	struct FRotator STATIC_K2_GetComponentRotation();
	struct FVector STATIC_K2_GetComponentLocation();
	void STATIC_K2_DetachFromComponent(EDetachmentRule LocationRule, EDetachmentRule RotationRule, EDetachmentRule ScaleRule, bool bCallModify);
	bool STATIC_K2_AttachToComponent(class USceneComponent* Parent, const struct FName& SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
	bool STATIC_K2_AttachTo(class USceneComponent* InParent, const struct FName& InSocketName, TEnumAsByte<EAttachLocation> AttachType, bool bWeldSimulatedBodies);
	void STATIC_K2_AddWorldTransform(const struct FTransform& DeltaTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_AddWorldRotation(const struct FRotator& DeltaRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_AddWorldOffset(const struct FVector& DeltaLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_AddRelativeRotation(const struct FRotator& DeltaRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_AddRelativeLocation(const struct FVector& DeltaLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_AddLocalTransform(const struct FTransform& DeltaTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_AddLocalRotation(const struct FRotator& DeltaRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void STATIC_K2_AddLocalOffset(const struct FVector& DeltaLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	bool STATIC_IsVisible();
	bool STATIC_IsSimulatingPhysics(const struct FName& BoneName);
	bool STATIC_IsAnySimulatingPhysics();
	struct FVector STATIC_GetUpVector();
	struct FTransform STATIC_GetSocketTransform(const struct FName& InSocketName, TEnumAsByte<ERelativeTransformSpace> TransformSpace);
	struct FRotator STATIC_GetSocketRotation(const struct FName& InSocketName);
	struct FQuat STATIC_GetSocketQuaternion(const struct FName& InSocketName);
	struct FVector STATIC_GetSocketLocation(const struct FName& InSocketName);
	struct FVector STATIC_GetRightVector();
	struct FTransform STATIC_GetRelativeTransform();
	class APhysicsVolume* STATIC_GetPhysicsVolume();
	void STATIC_GetParentComponents(TArray<class USceneComponent*>* Parents);
	int STATIC_GetNumChildrenComponents();
	struct FVector STATIC_GetForwardVector();
	struct FVector STATIC_GetComponentVelocity();
	void STATIC_GetChildrenComponents(bool bIncludeAllDescendants, TArray<class USceneComponent*>* Children);
	class USceneComponent* STATIC_GetChildComponent(int ChildIndex);
	struct FName STATIC_GetAttachSocketName();
	class USceneComponent* STATIC_GetAttachParent();
	TArray<struct FName> STATIC_GetAllSocketNames();
	bool STATIC_DoesSocketExist(const struct FName& InSocketName);
	void STATIC_DetachFromParent(bool bMaintainWorldPosition, bool bCallModify);
};


// Class Engine.PrimitiveComponent
// 0x0510 (0x09C0 - 0x04B0)
class UPrimitiveComponent : public USceneComponent
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x04B0(0x0008) MISSED OFFSET
	float                                              MinDrawDistance;                                          // 0x04B8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LDMaxDrawDistance;                                        // 0x04BC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CachedMaxDrawDistance;                                    // 0x04C0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	TEnumAsByte<ESceneDepthPriorityGroup>              DepthPriorityGroup;                                       // 0x04C4(0x0001) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ESceneDepthPriorityGroup>              ViewOwnerDepthPriorityGroup;                              // 0x04C5(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x04C6(0x0002) MISSED OFFSET
	unsigned char                                      UnknownData02 : 3;                                        // 0x04C8(0x0001)
	unsigned char                                      bAlwaysCreatePhysicsState : 1;                            // 0x04C8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bGenerateOverlapEvents : 1;                               // 0x04C8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bMultiBodyOverlap : 1;                                    // 0x04C8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bCheckAsyncSceneOnMove : 1;                               // 0x04C8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bTraceComplexOnMove : 1;                                  // 0x04C8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bDisableForceFromCharacter : 1;                           // 0x04C9(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bReturnMaterialOnMove : 1;                                // 0x04C9(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bUseViewOwnerDepthPriorityGroup : 1;                      // 0x04C9(0x0001)
	unsigned char                                      bAllowCullDistanceVolume : 1;                             // 0x04C9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bImportantMesh : 1;                                       // 0x04C9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bOverrideCullingDistances : 1;                            // 0x04C9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData03[0x2];                                       // 0x04CA(0x0002) MISSED OFFSET
	float                                              HLODScreenSize;                                           // 0x04CC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bHasMotionBlurVelocityMeshes : 1;                         // 0x04D0(0x0001)
	unsigned char                                      bVisibleInReflectionCaptures : 1;                         // 0x04D0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bRenderInMainPass : 1;                                    // 0x04D0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bRenderInMono : 1;                                        // 0x04D0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bReceivesDecals : 1;                                      // 0x04D0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bReceivesDecalsEx : 1;                                    // 0x04D0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bOwnerNoSee : 1;                                          // 0x04D0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bOnlyOwnerSee : 1;                                        // 0x04D0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bTreatAsBackgroundForOcclusion : 1;                       // 0x04D1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bUseAsOccluder : 1;                                       // 0x04D1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bForceAsOccluder : 1;                                     // 0x04D1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bForceOcclusionQuerying : 1;                              // 0x04D1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bForceDisableOcclusionQuerying : 1;                       // 0x04D1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bSelectable : 1;                                          // 0x04D1(0x0001)
	unsigned char                                      bForceMipStreaming : 1;                                   // 0x04D1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bHasPerInstanceHitProxies : 1;                            // 0x04D1(0x0001)
	unsigned char                                      UnknownData04[0x2];                                       // 0x04D2(0x0002) MISSED OFFSET
	TEnumAsByte<EIndoorOutdoorMask>                    IndoorOutdoorMask;                                        // 0x04D4(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x04D5(0x0003) MISSED OFFSET
	unsigned char                                      CastShadow : 1;                                           // 0x04D8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bAffectDynamicIndirectLighting : 1;                       // 0x04D8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bAffectDistanceFieldLighting : 1;                         // 0x04D8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastDynamicShadow : 1;                                   // 0x04D8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastStaticShadow : 1;                                    // 0x04D8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastVolumetricTranslucentShadow : 1;                     // 0x04D8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bSelfShadowOnly : 1;                                      // 0x04D8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastFarShadow : 1;                                       // 0x04D8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastInsetShadow : 1;                                     // 0x04D9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastCinematicShadow : 1;                                 // 0x04D9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastHiddenShadow : 1;                                    // 0x04D9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastShadowAsTwoSided : 1;                                // 0x04D9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bLightAsIfStatic : 1;                                     // 0x04D9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bLightAttachmentsAsGroup : 1;                             // 0x04D9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData06[0x2];                                       // 0x04DA(0x0002) MISSED OFFSET
	TEnumAsByte<EIndirectLightingCacheQuality>         IndirectLightingCacheQuality;                             // 0x04DC(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x04DD(0x0003) MISSED OFFSET
	unsigned char                                      bReceiveCombinedCSMAndStaticShadowsFromStationaryLights : 1;// 0x04E0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bSingleSampleShadowFromStationaryLights : 1;              // 0x04E0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData08[0x3];                                       // 0x04E1(0x0003) MISSED OFFSET
	struct FLightingChannels                           LightingChannels;                                         // 0x04E4(0x0003) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData09[0x1];                                       // 0x04E7(0x0001) MISSED OFFSET
	unsigned char                                      bIgnoreRadialImpulse : 1;                                 // 0x04E8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bIgnoreRadialForce : 1;                                   // 0x04E8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bApplyImpulseOnDamage : 1;                                // 0x04E8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bSyncBodySleep : 1;                                       // 0x04E8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      AlwaysLoadOnClient : 1;                                   // 0x04E8(0x0001)
	unsigned char                                      AlwaysLoadOnServer : 1;                                   // 0x04E8(0x0001)
	unsigned char                                      bUseEditorCompositing : 1;                                // 0x04E8(0x0001)
	unsigned char                                      bRenderCustomDepth : 1;                                   // 0x04E8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData10[0x3];                                       // 0x04E9(0x0003) MISSED OFFSET
	int                                                CustomDepthStencilValue;                                  // 0x04EC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	ERendererStencilMask                               CustomDepthStencilWriteMask;                              // 0x04F0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData11[0x7];                                       // 0x04F1(0x0007) MISSED OFFSET
	TArray<TEnumAsByte<ECollisionChannel>>             IgnoreCollisionMaskOnSweep;                               // 0x04F8(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	int                                                TranslucencySortPriority;                                 // 0x0508(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                VisibilityId;                                             // 0x050C(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData12[0x4];                                       // 0x0510(0x0004) MISSED OFFSET
	float                                              LpvBiasMultiplier;                                        // 0x0514(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
